<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="7" FACE="Comic Sans MS"><I><B>SECURITE</B></I></FONT></P>
<P>
<P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Tout d'abord il faut que vous sachiez que vous risquez gros en vous
embarquant dans l'art du piratage et de l'escroquerie...</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Certains se disent qu'ils ne se feront jamais attrapper puis passent
10 ans en taule sans meme avoir compris ce qui leur &eacute;tait arriv&eacute;, et tout &ccedil;a pour avoir n&eacute;gliger
quelques r&egrave;gles de s&eacute;curit&eacute;s qui pourtant ne sont pas si difficiles &agrave; respecter.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Premi&egrave;re r&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Vous ne devez jamais parler de votre activit&eacute; aux personnes
vous connaissant physiquement et quand je dis personne, c'est personne (pas meme votre meilleur pote, fr&egrave;re,
m&egrave;re, petite amie) car en cas de dispute, de col&egrave;re ou de cassage de couple certains secrets se retrouvent
r&eacute;v&eacute;l&eacute;s sans aucun remord et vous risquez d'en patir.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Secondes r&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Evitez de parler trop de d&eacute;tails de votre vie sur le net, ne
donnez jamais votre nom, adresse, ou autre detail pouvant permettre &agrave; quelqu'un de vous retrouver.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Troisi&egrave;me R&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Ne rencontrez physiquement personne qui soit au courant de votre activit&eacute;,
dans la vie r&eacute;elle.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Quatri&egrave;me r&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Faites vous une fausse addresse e-mail pour recevoir vos courriers
et rester vagues dans les renseignements lors de l'inscription.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Cinqui&egrave;me r&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Soyez parano au ridicule et faites gaffe &agrave; la moindre trace
laiss&eacute;e derri&egrave;re vous.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Sixi&egrave;me r&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>N'entrez jamais dans un ordinateur gouvernemental car ils ont les
moyens et le temps de vous retrouver.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Septi&egrave;me R&egrave;gle:</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Vous etes l&agrave; pour apprendre et non pour d&eacute;truire donc
jouez pas les connards et n'effacez jamais un dossier sauf pour effacer vos traces.</B></I></FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B>Pensez aux mec qui fait tourner son commerce et vous le foutez en
faillite sans aucune raison, &ccedil;a peut faire encore plus SDF &ccedil;a serait pas cool...</B></I></FONT></P>

<P><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
<BR>
Bon je pense avoir fait le tour mais j'en rajouterai chaque mois</B></I></FONT></P>
<P ALIGN="RIGHT"><FONT SIZE="5" FACE="Comic Sans MS"><I><B></B></I></FONT></P>

<P ALIGN="RIGHT"><FONT SIZE="5" FACE="Comic Sans MS"><I><B><BR>
Demogorgon999</B></I></FONT></P>
<P ALIGN="CENTER"><A HREF="sommaire.htm"><FONT SIZE="5" FACE="Comic Sans MS"><I><B>SOMMAIRE</B></I></FONT></A>

</BODY>

</HTML>