<HTML><HEAD><TITLE>MemenTo</TITLE>

<meta name="Author" content="[Shmeit Corp]--">
<META content="text/html; charset=iso-8859-1" http-equiv=Content-Type>
<meta http-equiv="content-language" content="fr">
</HEAD>
<body  background="stars.jpg" bgcolor="#000000" link="#FFFFFF" vlink="#FFFFFF" alink="#00E0FF">
<font color=#EEEEEE face=arial, verdana, courier size=2>

<center>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>
<h1 >"troisi&egrave;me contact : je blesse l'ennemi"<br>
</h1>
<left>
<br>
Vous vous appretez &agrave; lire de votre plein gr&eacute; le concentr&eacute; de mes pens&eacute;es sur 
des sujets choisis au feeling. Je tiens &agrave; vous pr&eacute;venir que je ne fais aucune concession
quant au point de vue que je compte expliquer et les<br> arguments que j'utiliserai.
De plus mes propos ne sont jamais positif : je suis critique pas enfant de choeur...<br>
  <br>
  <br>
<hr  align="center" width="70%" ><br><br> </font></center><font color=#EEEEEE face=arial, verdana, courier size=2>
<center><b><font size="+1">LA POLITIQUE OU L'ART DES HOMMES :</font></b></center><br><br>
<b>Definition du PETIT LAROUSSE :</b><list>
<li>1) Relatif &agrave; l'organisation du pouvoir dans l'Etat, &agrave; son exercice.</li>
<li>2) Ensemble des pratiques, faits, institutions et d&eacute;terminations du gouvernement d'un Etat ou d'une soci&eacute;t&eacute;.</li>
<li>3) Personne qui s'occupe des affaires publiques, qui fait de la politique.</li>
</list><br><br>

Mouais... m&ecirc;me les d&eacute;finitions me semblent vaseuses...<br><br>

<b>D&eacute;finition perso :</b><list>
<li>1) Art, cr&eacute;er par l'homme afin "d'enduire" en erreur (comme dirait Coluche), la masse la plus importante d'individus et cel&agrave; avec la plus grande hypocrisie.</li>
<li>2) Hommes ayant pour "job" : mentir pour s&eacute;duire les foules, le tout en ayant la conscience tranquille.</li>
</list><br>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Au d&eacute;but je voulais nommer le sujet : politique/mensonge, m&ecirc;me combat mais je trouvais &ccedil;a
trop vendeur, trop pub pour wintel; enfin bref voil&agrave; pour l'intro je vais maintenant essayer
d'&ecirc;tre le plus clair possible en ce qui concerne le developpement.
(NB: le texte risque de ne pas &ecirc;tre tr&egrave;s structur&eacute; car les id&eacute;es et les exemples
affluent dans tous les sens alors... d&eacute;merdez-vous ! :(   mauvaise lecture ! )</p></font>
<hr width="50%">
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b>Tout d'abord</b>, je ne compte pas m'attardez sur  certains hommes que tout le monde &agrave; le 
d&eacute;shonneur de connaître (de nom heureusement), enfin j'esp&egrave;re ne pas d&eacute;vier, car je pense que 
le devoir incombe &agrave; chacun de trouver le "nom d'oiseaux" qu'il est bon de donner &agrave; ces ordures 
de LePan et M&eacute;grit (oups ...).<br>
<i><font size="-4">TOUTE RESSEMBLANCE AVEC DES PERSONNAGES EXISTANT N'EST QUE PURE COINCIDENCE etc...( Ah Ah Ah !!!!)</font></i></p></font>
<font color=#EEEEEE face=arial, verdana, courier size=2><p>La politique n'est pour moi que le plus mauvais programme TV du monde (m&ecirc;me devant
le brasier de la connerie (enfin..peut-&ecirc;tre)). C'est simple la politique est tellement
mensong&egrave;re et inf&acirc;me que c'est &agrave; rapprocher d'un sport o&ugrave; tous les athl&egrave;tes se doperaient
devant les cam&eacute;ras juste avant la comp&eacute;tition, et dont la technique (de dopage) serait
tellement parfaite que les t&eacute;l&eacute;spectateur les ovationneraient. Concr&egrave;tement la politique et
ceux qui la pratique ne m&egrave;ne(ent) &agrave; rien !</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Bien sûr je compte appuyer mes dires avec quelques exemples fort simple<br>(pour des raisons
de simplicit&eacute; je ne donnerai que peu d'exemple de pays autre que la France).</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Lorsque l'on parle de  grande imposture on ne peut pas oublier LE sujet de pr&eacute;dil&eacute;ction des
politiques,<bR> &agrave; savoir les impôt et les diverses taxes !!!!<b><br><br> Souvenez-vous:</b><br>

<center>"J'institue une taxe sur les v&eacute;hicules afin de...blabla...blabla...<br>
"Bien entendu cette taxe prendra fin d&egrave;s ... bla bla.... "<br><br></center>
Oui, c'&eacute;tait la naissance de notre bonne et <i>ch&egrave;re</i> vignette , <i>provisoire !</i><br>
(mais si, mais si ; rappelez-vous bien , il y a plus de 20 ans!)<br><br><br>

<b>Souvenez-vous:</b><br>
<center>"Si je suis &eacute;lus pr&eacute;sident je m'engage &agrave; baisser la...TVA..."</center><br>
Ah Ah Ah! Quelle est bien bonne celle l&agrave;, le plus gros revenue de l'Etat, 800 Milliards
de francs par an, le baisser ?! Ah Ah Ah ! Allocution de celui qui est devenue notre pr&eacute;sident 
pour 7 ans! Au fait la TVA &agrave; pris 2 points 18.6->20.6...Jolie diminution...Entre nous, heureusement qu'il n'avait pas l'intention de l'augmenter ! :(<br><br>
<br>
<b>Souvenez-vous:</b><br>
<center> "Si je suis &eacute;lus pr&eacute;sident je m'engage &agrave; stopper les essais nucl&eacute;aire"<br></center>
<br>Ah Ah Ah!! Celle l&agrave; aussi je m'en souviens, ce qui leur &agrave; mis au poissons de Mururoa, comme on dis pas de survivant = pas de t&eacute;moins !!!
Si je me souviens bien, une 40taine de patate il leur &agrave; mis, des fois qu'il en reste apr&egrave;s les 10 premi&egrave;res...BOMBES NUCLEAIRES !! 
Ouais c'est vrai quoi avec les poissons il faut se m&eacute;fier, parfois ils font...les morts.
Ben ouais vous &ecirc;tiez pas au courant? les poissons s'entrainent &agrave; resister aux impacts nucl&eacute;aire 
au Liban, et de toute mani&egrave;re ils l'avaient bien cherch&eacute;, na !</p></font>
<br><br><br><br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b>Ensuite</b>, une preuve de la fourberie de cet univers : les alliances et autres INTERETS 
inter-pays (ou inter-politiques). En effet les d&eacute;cisions politiques concernant les relations 
ext&eacute;rieures ne sont que de la poudre aux yeux, des "duperies", une farce grotesque pour calmer 
les esprits !<br><br>
Car quand toute la "planete", entendez par l&agrave; le G7 et la Russie, interviens au Kosovo,
4 gal&egrave;riens de l'UNICEF se d&eacute;brouillent pour sauver le plus de famille au Rwanda.<br>
Au fait, sans vouloir vexer la population fran&ccedil;aise soudainement prise de g&eacute;n&eacute;rosit&eacute;,
(pub:"Avec MIRA express, votre conscience est plus nette sans frotter !!"),
il y a eut plus de mort dû &agrave; l'exode en Afrique qu'au Kosovo...
<br><br>Simplement, lorsque sur la balance politique on p&egrave;se un "n&egrave;gro" et un Europ&eacute;en....<br>
On sait tout de suite que la Somalie ne se trouve pas en Europe :(.<br>
De m&ecirc;me, pendant les 3 mois de guerre au Kosovo, je n'ai pas le souvenir d'avoir entendu 1 homme 
politique se soucier du probleme du Nepal et de l'Inde...Apr&egrave;s tout, comme dirait l'autre, "vive 
le pays de la fraternit&eacute;...").<br><br>
Alors que les politiques (et que la politique non plus) ne me fassent pas croire que leurs 
parades pseudo-gentille-mignonne-d&eacute;sinterress&eacute;-et-fraternelle n'est pas qu'un mirage cachant 
en r&eacute;alit&eacute; un bien plus sombre dessein : "P$GNON" !<br><br>
Car ne vous imaginez pas que la reconstruction du Kosovo va &ecirc;tre uniquement financer par l'aide 
internationnale (au fait, elle est o&ugrave; l'aide au Rwanda ???). La gentille Europe (surtout la 
super-gentille France) va pr&ecirc;ter quelque D$llars au Kosovo (psst:...c'est...un...in-ve-sti-sse-ment...chut !)...<br>
<br>Pensez bien que maintenant que la France a fait bonne figure avec son arm&eacute;e, le fournisseur tout
trouv&eacute; du Kosovo au niveau militaire sera: "tut tudu tududu tut tudu..." BINP (c'&eacute;tait le jingle quizz !) LA FRANCE !!!!
<center><b>>>>> plein de $$$ BENEF $$$ <<<<</b></center>
</p></font>
<br><br><br><br>

 
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b>Maintenant</b> attachons nous &agrave; notre beau pays o&ugrave; tout le monde il-est-gentil et comp&eacute;tent...<br> 
Surtout les <b><i>politicards</i></b>: ils sont tellement fort, courageux, exemplaire, disciplin&eacute;, 
honn&ecirc;te, franc et serviable que l'on est outr&eacute; du sort qu'ils leurs est r&eacute;serv&eacute;s (les pauv').<br>
En effet, il devraient se rebell&eacute;, se mettre en gr&ecirc;ve ou brûler l'Elys&eacute;e tellement ils sont 
mal-trait&eacute;...<br><br>
Le pr&eacute;sident n'est pay&eacute; que 35000 f par mois &agrave; vie, le premier ministre quant &agrave; 
lui est oblig&eacute; de manger des patates tous les jours car il doit subvenir &agrave; ses besoins avec 
seulement 37000 f par mois. <br>Les d&eacute;put&eacute; aussi sont &agrave; plaindre: ils doivent faire la sieste dans 
un amphi sur-peupl&eacute; o&ugrave; il y a des voyous qui parfois crient et s'insultent violemment (les pauv').<br><br>

En plus, ils ont tellement pas de chance qu'ils ont le droit d'avoir plusieurs postes et ainsi 
d'&ecirc;tre pay&eacute; en qualit&eacute; de Maire, S&eacute;nateurs, et D&eacute;put&eacute; Europ&eacute;en (alors qu'ils ne font qu'acte de pr&eacute;sence
au parlement Europ&eacute;en...mais au prix du jeton de pr&eacute;sence et vu la note de frais &agrave; laquelle ils ont droit c'est normal !).<br><br>

Mais surtout, quand on sait que tous les hommes r&ecirc;ve de prendre tous les jours le m&eacute;tro au
heures de pointe, sentir la sueur, les mauvaises haleines et le vomis du gosse dans la poussette 
au fond du wagon, on ne peut qu'&ecirc;tre outr&eacute; du supplice de ces hommes : &ecirc;tre oblig&eacute; de prendre 
une Safrane toute &eacute;quip&eacute;, vitre teint&eacute;es et chauffeur priv&eacute;... ah la la.... vraiment des fois 
je me demande comment ils font pour vivre...snif...(les pauv').<br><br>
Vraiment, je suis outr&eacute; qu'au 20&egrave;me si&egrave;cle des hommes puissent vivre dans de telles conditions, 
c'est inadmissible! Je vous invite donc &agrave; signer la p&eacute;tition que je compte....STOP !!!!!!!!!!!!<br>
<i>Colere:</i> pour tous les analphastupide qui n'auraient pas compris, c'&eacute;tait ironique. Ce n'est pas 
permis de voir l'oppulence dans laquelle ses bouffons de f&ecirc;te foraine se complaisent. <br><br>

<center>Comment le peuple peut d&eacute;lib&eacute;rement d&eacute;cid&eacute; de payer un mec...&agrave; vie ?!?( et bien en plus !).<br>
Je suis b&ecirc;te, comprend pas !<br><br>
Il y a pr&egrave;s de 3 millions de chomeurs, et plus de 3000 guignols qui occupe 3 poste chacun...<br>(ndrc: a 30000 balles le poste...et apres on nous parle de partage des richesses...)<br>
Je suis b&ecirc;te, comprend pas !<br><br>
Lorsqu'un entraineur de football ne m&egrave;nent pas son club au titre (convoit&eacute;) il est limog&eacute; aussi sec,<br>
pourquoi pas ces phacoch&egrave;res en costars (&agrave; 5000 balles...)?!?<br>
Je suis b&ecirc;te, comprend pas !</center><br><br>
</p></font><br><br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b>Enfin</b>, mon dernier exemple. Celui-ci tient en 1 mot SARKOZY (ou l'arch&eacute;type du f&eacute;lon !)...<br>
Ah Nicolas, vraiment, en fait je crois que c'est lui mon pr&eacute;f&eacute;r&eacute; ! Oui Oui c vrai , c'est le 
seul qui soit...<i>honnete</i>!! Au moins avec lui le peuple ne devrait plus se tromper.
Mais oui, avec Nico on sait &agrave; quoi s'attendre : c'est une pourriture d'arriviste, avec des
canines si bal&egrave;ze qu'elles rayent le plancher...<br><br>
On sait tous que son but Ultime est le poste de pr&eacute;sident de la R&eacute;publique, apr&egrave;s avoir changer
de bord en 5 seconde chrono, de BallaMou &agrave; 
Jacquot il a  discr&egrave;tement pris le poste de pr&eacute;sident du RPR, sans une larme pour la Ch&egrave;vre.<br><br>
Tout bien r&eacute;fl&eacute;chi, c'est peut-&ecirc;tre le plus con, en effet quand il ment c'est le seul qui soit 
grill&eacute; !!! Ah Ah Ah !!<br>
Bref c'etait l'ultime exemple du merdier au quel croient les gentils &eacute;lecteurs des pays d&eacute;mocratiques.<br><br>
 
Ce fl&eacute;au qu'est la politique me fait prendre conscience d'une chose : la capacit&eacute; des hommes &agrave; 
mentir me fais peur, car si ceux qui ont le pouvoir du plus grand nombre peuvent sans sourciller
mentir &agrave; une foule qui n'aspire qu'au bonheur, je ne souhaite pas rencontr&eacute; le plus vils des 
hommes....
</p></font>
<center><font color=#EEEEEE face=arial, verdana, courier size=2><p>Bon j'en ai marre de vous!! A+</p></font>
<br>
</center>
</font></font></body>
</html>