 -----------------------------------------------------------------------------
| ---- [ BLACKCLOWNS MAGAZINE - ISSUE 01 ]  ------------  [ Article 07 ] ---- |
|-----------------------------------------------------------------------------|
|                       [ File System Rootkit Acheron ]                       |
|                   [ Ivanlef0u <ivanlef0u.tuxfamily.org> ]                   |
 -----------------------------------------------------------------------------


--[ 1 - Intro

Dans le post sur mon blog "POC IRP Hooking", j'avais montré comment intercepter
les requêtes faites au driver NTFS en modifiant directement les pointeur des
fonctions IRP_MJ_XXX dans la table des MajorFunction du driver \filesystem\ntfs.
L'avantage de cette technique est quelle évite de poser un hook sur les
fonctions natives et bypass donc les anti-rk qui ne vérifient pas l'intégrité du
driver NTFS. Cependant comme pour tout hook, nous modifions les résultats
renvoyé par la fonction originale qui, dans mon cas, était
NtfsFsdDirectoryControl, contrôlant les IRP_MJ_DIRECTORY_CONTROL passées au
driver.

Le problème c'est qu'après l'appel à cette fonction certains champs de l'IRP ne
sont plus valable, en effet plus bas, dans la device stack, un driver à
normalement du faire appel à IoCompleteRequest pour renvoyé le résultat,
de ce fait accéder comme je le faisait au buffer représenté par l'IRP était
risqué. Comme le DDK le précise :

--[ 2 - Devices Architecture

Pour commencer il faut savoir que les drivers ne communiquent pas directement
avec le système, ils le font à travers des interfaces (devices). Le driver crée
les devices et peut en posséder plusieurs. Il existe différents type de devices 
:

- Physical Device Object (PDO) : représente un device de driver de bus.

- Functional Device Object (FDO) : est un device de driver "fonctionnel"
c'est à dire agissant sur les IRP.

- Filter Device Object (FiDO) : device qui filtre les IRP.

- Control Device Object (CDO) : device qui sert d'interface de control avec le
driver.

En général, un driver possède un device nommé, qui sert d'interface avec
l'userland permettant au driver de recevoir des IOCTL. Les drivers non-nommés
servent à travailler sur les IRP envoyés soit par les appels natifs, soit par
les interruptions hardware, soit par les autres drivers.

Pour mieux comprendre l'agencement de ces devices regardons les devices associés
au gestionnaire de volume principal.

lkd> !drvobj \driver\ftdisk
Driver object (842d3ae0) is for:
 \Driver\Ftdisk
Driver Extension List: (id , addr)

Device Object list:
842f7d88  842d3900

Le device object à l'adresse 0x842d3900 nommé FtControl sert de device de
communication avec l'userland (CD0), utilisé par le le gestionnaire de disques.

lkd> !devobj 842d3900
Device object (842d3900) is for:
 FtControl \Driver\Ftdisk DriverObject 842d3ae0
Current Irp 00000000 RefCount 0 Type 00000012 Flags 00000840
Dacl e1446394 DevExt 842d39b8 DevObjExt 842d3a70
ExtensionFlags (0000000000)
AttachedTo (Lower) 843aff10

Le second device nommé HarddiskVolume1 correspond au device de type VDO
(Volume Device Object) représenté par le symbolic link C:.

lkd> !object \global??\C:
Object: e14bd0d0  Type: (843c8040) SymbolicLink
    ObjectHeader: e14bd0b8 (old version)
    HandleCount: 0  PointerCount: 1
    Directory Object: e10016b0  Name: C:
    Target String is '\Device\HarddiskVolume1'
    Drive Letter Index is 3 (C:)

lkd> !devobj 842f7d88
Device object (842f7d88) is for:
 HarddiskVolume1 \Driver\Ftdisk DriverObject 842d3ae0
Current Irp 00000000 RefCount 1284 Type 00000007 Flags 00001150
Vpb 842fa790 Dacl e1446394 DevExt 842f7e40 DevObjExt 842f7f28 Dope 843ce500
DevNode 842f7bb0
ExtensionFlags (0000000000)
AttachedDevice (Upper) 842f7928 \Driver\VolSnap
Device queue is not busy.

Au dessus du device HarDiskVolume1, on trouve le device type FiDO VolSnap,
Microsoft Shadow Copy Provider qui permet de crée un backup en temps réel d'un
disque en utilisant le Shadow Copy service, généralement non activé mais qui
peut servir aux sofs de backup de disques.

Le lien entre le VDO HardiskVolume1 et le driver de système de fichier est
réalisé avec le VPB (Volume Parameter Block), qui est un champ (offset 0x24) de
la structure DEVICE_OBJECT.
"A VPB serves as the link between a volume device object and the device object
that a file system driver creates to represent a mounted file system instance
for that volume"

lkd> dt nt!_DEVICE_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   +0x004 ReferenceCount   : Int4B
   +0x008 DriverObject     : Ptr32 _DRIVER_OBJECT
   +0x00c NextDevice       : Ptr32 _DEVICE_OBJECT
   +0x010 AttachedDevice   : Ptr32 _DEVICE_OBJECT
   +0x014 CurrentIrp       : Ptr32 _IRP
   +0x018 Timer            : Ptr32 _IO_TIMER
   +0x01c Flags            : Uint4B
   +0x020 Characteristics  : Uint4B
   +0x024 Vpb              : Ptr32 _VPB
   +0x028 DeviceExtension  : Ptr32 Void
   +0x02c DeviceType       : Uint4B
   +0x030 StackSize        : Char
   +0x034 Queue            : __unnamed
   +0x05c AlignmentRequirement : Uint4B
   +0x060 DeviceQueue      : _KDEVICE_QUEUE
   +0x074 Dpc              : _KDPC
   +0x094 ActiveThreadCount : Uint4B
   +0x098 SecurityDescriptor : Ptr32 Void
   +0x09c DeviceLock       : _KEVENT
   +0x0ac SectorSize       : Uint2B
   +0x0ae Spare1           : Uint2B
   +0x0b0 DeviceObjectExtension : Ptr32 _DEVOBJ_EXTENSION
   +0x0b4 Reserved         : Ptr32 Void

lkd> dt nt!_VPB
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x004 Flags            : Uint2B
   +0x006 VolumeLabelLength : Uint2B
   +0x008 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x00c RealDevice       : Ptr32 _DEVICE_OBJECT
   +0x010 SerialNumber     : Uint4B
   +0x014 ReferenceCount   : Uint4B
   +0x018 VolumeLabel      : [32] Uint2B

On peut obtenir plus d'informations sur le VPB avec la commande !vpb du kd.

lkd> !vpb 842fa790
Vpb at 0x842fa790
Flags: 0x1 mounted
DeviceObject: 0x842bf770 <- FDO du driver \FileSystem\Ntfs
RealDevice:   0x842f7d88 <- HarddiskVolume1, VDO crée par \driver\ftdisk
RefCount: 1284
Volume Label:

On peut résumer la device stack du driver ftdisk avec le schéma suivant :

+--------------------------------+
|                                |
| (noname)                       |
| FiDO du driver \filesystem\sr  |
|                                |
+--------------------------------+
              /\
              ||                   
              ||
+--------------------------------+  +--------------------------------+
|                                |  |                                |
| (noname)                       |  | (noname)                       |
| FDO du driver \filesystem\Ntfs |  | FiDO du driver \driver\VolSnap |
