<html>
<body bgcolor="#000000" text="#FFFFFF">
<p align="center"><font color="#CC0000" size="7" face="Comic Sans MS">Ma Vision de Mitnick</font></p>

<hr>

<p>Cet article est destin&eacute; &agrave; tout ce qui consid&egrave;re Kevin Mitnick comme un Dieu du hacking, il n'est jamais trop tard pour ouvrir les yeux :p <br>
Je vous voit d&eacute;j&agrave; arriv&eacute; avec vos gros sabots en me disant :&quot;Tu ose parler ainsi du B3St H4CK3R oF Da 31337 World&quot; et bien je vous r&eacute;pondrais que vous etes des esclaves de la soci&eacute;t&eacute; en croyant les ragots des m&eacute;dias sans même faire la part des choses entre la fantasmagorie et la dure r&eacute;alit&eacute;.<br>
Mais bon j'vous en veux pas et vous propose de r&eacute;agir (spam interdit) &agrave; cet article en me maillant &agrave; mon adresse mail: <a href="mailto:darkillah@yahoo.fr">darkillah@yahoo.fr</a><br>
</p>

<p><hr><br><font color="#FF0000" size="4">Introduction</font><br><hr></p>

<p>J'exprimerai dans cet article mon d&eacute;saccord avec la plupart des membres de l'underground et de la Silycon Valley,
rien que ça ! <br>
En effet je crois qu'il y a un r&eacute;el malaise entre le mythe qui a &eacute;t&eacute; fait de lui et la r&eacute;alit&eacute;, je ne savais pas que la
d&eacute;sinformation pour en faire un exemple, pouvais provoqu&eacute; une telle idiotie, Mitnick n'&eacute;tait pas un v&eacute;ritable hacker et
faisait encore moins partit de l'Elite, <br>
c'est seulement un pirate informatique tout ce qu'il y a de plus banal !<br>
<br>
passant son temps &agrave; utiliser des failles de r&eacute;seaux vuln&eacute;rables, en r&eacute;cup&eacute;rant des exploits ou autres scripts. Je ne peut qualifi&eacute; Mitnick que de script-kiddies ou voir même de lamer ! je vous avoue que même moi ça me d&eacute;sole de devoir dire ça mais j'ai des preuves <br>
irr&eacute;futables ! C'est vrai, le compte de f&eacute;e qui tournoyait autour de l'affaire Mitnick en avait fait un mythe malgr&eacute; lui !
(Bien que la c&eacute;l&eacute;brit&eacute;e lui plaisait...)</p>

<p align="center"><b>Voici donc des preuves de ce que j'avance et quelques commentaires pour appuyer ses derniers. </b></p>

<p><hr><br><font color="#FF0000" size="4">Mitnick, un ph&eacute;nom&egrave;ne MARKETING</font><br><hr></p>

<p>Cette premi&egrave;re preuve, ne pourra être ni&eacute; de personne, car divers produits ont &eacute;t&eacute; fabriqu&eacute; &agrave; son &eacute;ffigie, dont :</p>

<p>Wargames un film d&eacute;crivant plus ou moins (plutôt moins) la p&eacute;riode de r&eacute;b&eacute;lion, crise d'adolescence oblige, de Mitnick, ce film, d&eacute;crivant un sur-dou&eacute; de l'informatique qui p&eacute;n&egrave;tre une b&eacute;canne de simulation de guerre du pentagone, cette description d'un sur-dou&eacute; n'&eacute;tait que pour inqui&eacute;t&eacute; le publique du potentielle des micro-ordinateur (donc personnel), et
de la &quot;nouvelle jeunesse&quot;.</p>

<p>Un livre d&eacute;crivant les &quot;prouesses&quot; de Mitnick &eacute;crit par John Markoff, certes bien r&eacute;dig&eacute; et tr&egrave;s agr&eacute;able (c'est normal c'est de la science fiction :) montrait r&eacute;ellement que Markoff, un journaliste du N.Y Times sp&eacute;cialis&eacute; dans les affaires de la sylicon Valley, et d'autre affaires se relatant &agrave; l'informatique, ne connaissait visiblement pas son affaire en mati&egrave;re d'informatique et de l'underground plus particuli&egrave;rement.</p>

<p>Bref, d'apr&egrave;s ces deux produits, on peut d&eacute;montrer que Mitnick avait &eacute;t&eacute; choisis pour devenir un mod&egrave;le vis a vis des autres pirates, en mati&egrave;re de jugement d'un pirate informatiques, et par cons&eacute;quent, un martyr...</p>

<p><hr><br><font color="#FF0000" size="4">Mitnick et les flics</font><br><hr></p>

<p>Mitnick &eacute;tait un r&eacute;cidiviste en mati&egrave;re de fraudes informatiques, et ça, tout le monde le sait, il fut inculp&eacute; &agrave; de nombreuses reprises mais s'en est toujours relativement bien sorti lors de son jugement, dont le moyen de d&eacute;fense utilis&eacute; par ses avocats &eacute;tait que Mitnick &eacute;tait atteint de piratomania (sic) donc qu'il ne pouvais s'empêcher de pirater des syst&egrave;mes &eacute;lectroniques ou informatis&eacute;s !</p>

<p>cet argument avait attir&eacute; tous les m&eacute;dias des Etat Unis, c'est la que le &quot;mythe&quot; est n&eacute;, eh oui, il fallait bien un cobaye pour tenir ce rôle et j'avoue que son arrogance ne faisait qu'amplifi&eacute; qu'il &eacute;tait fait pour jou&eacute; le cobaye d'un Etat qu'il d&eacute;testait tant...</p>

<p><b>Mitnick aurait il pris la grosse tête ? </b></p>

<p><hr><br><font color="#FF0000" size="4">Mitnick, un &eacute;ternel perdant</font><br><hr></p>

<p>Mitnick n'avait vraisemblablement pas eu une adolescence facile.</p>

<p>Solitaire, Mitnick a choisis de d&eacute;laisser quelques peu ses &eacute;tudes pour ce consacrer au piratage t&eacute;l&eacute;phonique et informatique, et faire donc partit de l'underground informatique.</p>

<p>El Condor, son nick, avait pris une place dans le milieu underground, et a vrai dire, je ne sais pas comment... sûrement que sa tchatche y &eacute;tait pour quelques chose ... car il avait un don inn&eacute; pour jou&eacute; de la crudilit&eacute; des gens, et de leur bonne volont&eacute;, pour parvenir a ses fins.</p>

<p>Mitnick avait choisis le monde virtuel, s'inventant un monde imaginaire dont il &eacute;tait le h&eacute;ros, fruit de nombreuses lectures de livres de science fictions orient&eacute; cyberpunk qu'il l'on plong&eacute; &agrave; tout jamais dans l'erreur et l'illusion, et l'on peut etre certain que les m&eacute;dia y sont pour quelque chose...</p>

<p><b>On peut mont&eacute; n'importe qui sur un pied d'estales mais faudrait t'il encore qu'il puisse gard&eacute; l'&eacute;quilibre!</b></p>

<p><hr><br><font color="#FF0000" size="4">Mitnick: L'art et la Mani&egrave;re</font><br><hr></p>

<p>Mitnick &eacute;tait &agrave; cheval entre deux monde totalement diff&eacute;rents, le premier, le monde r&eacute;el, ne lui avait pas vraiment sourit, mais s'&eacute;tait il donn&eacute; la peine de chang&eacute; son destin ? <br>
Et le second, le monde du virtuel, ne le jugeant ni par son apparence, ni par sa religion lui ouvrait a bras ouvert ses
services. Il fut rapidement attir&eacute; par le cot&eacute; obscur du net, ce milieu si mysterieux et si appr&eacute;hend&eacute; par certains &eacute;tait
devenu le cot&eacute; qu'avait choisis de franchir Mitnick.</p>

<p>Il travailla avec acharnement pour pouvoir être respect&eacute; des autres hackers, il voulait manifestement être exactement le contraire de ce qu'il &eacute;tait dans la vrai vie<br>
Les r&eacute;sultats semblait prometteurs vus le nombres d'inculpations qu'il poss&egrave;de &agrave; son actif !!!</p>

<p>Il avait un certains talent dans le social Enginering et a tromp&eacute; plus d'une entreprise en se faisant pass&eacute; pour technicien venant de se faire embaucher ou &eacute;tant en manque de renseignements. <br>
Je vous expose ci dessous les talents de Mitnick: <br>
Mitnick a r&eacute;ussi &agrave; contrôler le syst&egrave;me informatique de la centrale t&eacute;l&eacute;phonique de sa ville, et ce, nullement en crackant
le mots de passe ou d&#146;autres techniques plus complexes, non non ! il s'&eacute;tait simplement introduit dans les locaux de
l'entreprise, en bernant le garde qu'il devait parl&eacute; &agrave; son p&egrave;re qui &eacute;tait employ&eacute; dans la firme, et a tout bêtement vol&eacute; un listing possedant le mot de passe root de l'ordinateur centrale, laiss&eacute; par erreur sur le coin d'un bureau.</p>

<p>Alors excusez moi mais on n'a pas besoin d'être l'Elite pour faire ça, alors quand je vous dis que Mitnick se joue de la cr&eacute;dulit&eacute; des gens c'est pas pour rien ! De plus, apr&egrave;s s'être faire arrêter parce qu'il s'&eacute;tait fait rep&eacute;rer par un employ&eacute; (même pas capable d'être discret), l'histoire fut racont&eacute; tout a fait autrement, bien sur tourn&eacute; &agrave; son avantage de la dit Elite, c'est hallucinant non ? <br>
Il y en faut peut pour faire de l'audimat !</p>

<p>Mitnick savait aussi quelques bidouilles de phreak courantes dans le milieu underground, comment le d&eacute;tournement d'un connections, etc... </p>

<p>En fait, le r&eacute;el talent de Mitnick &eacute;tait sans conteste son CULOT. <br>
Mitnick &eacute;tait compl&egrave;tement inconscient des cons&eacute;quences de ses actes, mais il devait connaître la loi sur la criminalit&eacute; informatiques sur le bout des doigts vu le nombres d'inculpations qu'il poss&egrave;de.</strong></p>

<p>voici mon mail, je compte sur vous pour r&eacute;agir (NDC : de maniere intelligente, pas de mail bomb)) : <a href="mailto:darkillah@yahoo.fr">darkillah@yahoo.fr</a></p>

<p align="right"><strong>-ScienTisT-</strong></p>
</body>
</html>
