<html>
<body bgcolor="#000080" text="#FFFF00">

<p align="center">
<font color="#FF0000" size="5">
<b>PETITE HISTOIRE DE BOF, LE HACKER.</b>
</font>
</p>

<p><font color="#FFFF00" size="3"><b>Voila,
c'est l'histoire de bof, un petit garcon de 15 ans, qui est un cancre en classe, pas le
dernier de classe , mais pas loin !! </b></font></p>

<p><font color="#FFFF00" size="3"><b>Seuleument,
ses parents sont des riches trou du cul, et donc Bof a un P3 800 (pas d'athlon c'est pas
assez cher) avec une connection satellite avec un d&eacute;bit faramineux qui fait r&eacute;ver bon
nombres de petits internautes comme vous et moi.</b></font></p>

<p><font color="#FFFF00" size="3"><b>Bof,
devient de pire en pire en classe, et en plus, il ne s'entend plus avec ses copains, car
ils le traitent de riche trou du cul et l'appellent CHEVAL. Du coup, Bof rentre chez lui,
et se connecte au web et &agrave; ses fabuleuses donn&eacute;es, et la, il tombe sur le site du plus
gros lamerz du monde, <a href="http://www.grosselame.gov">http://www.grosselame.gov</a> .
Il y trouve l'attirail du parfait petit lamer en herbe : Mail Bombing, NuKe etc... </b></font></p>

<p><font color="#FFFF00" size="3"><b>Et, comme
il a eu la notice d'utilisation du mail bomber, il se dit, mais tient, ce petit connard de
batard de tristan qui m'a trait&eacute; de tout les noms, je vais le mail bomber &agrave; fond cet
encul&eacute; !!!!</b></font></p>

<p><font color="#FFFF00" size="3"><b>Aussitot
dit, aussitot fait, Bof envoie plus de 100000000 messages &agrave; tristan disant : &quot;Hein,
tu m'appelle cheval, et bien t'es bien nik&eacute; la ahahaha !!!&quot;. Et oui, Bof ne sait pas
encore que les grosses lame qui se respectent doivent &eacute;crire CoMmE Ca, SiNoN Ca Le FaIt
pOa DU TouT. Mais ça, il l'apprendra avec le temps .....</b></font></p>

<p><font color="#FFFF00" size="3"><b>Ceci est
donc le d&eacute;but de la longue carriere de Bof en tant que grosse lame !!</b></font></p>

<p><font color="#FFFF00" size="3"><b>En effet,
apres cet exploit de mail bombing, ses anciens copains sont &eacute;pater et deviennent donc
maintenant ses meilleures amis!! et oui, ces fochetons ont peur de Bof et ils commencent
&agrave; le v&eacute;n&eacute;rer.Bof est tres content, mais il ne va pas en rester la!!!</b></font></p>

<p><font color="#FFFF00" size="3"><b>Oui, Bof,
conscient de sa toute puissance se dit qu'il devrait s'attaquer &agrave; plus gros que ce petit
tristan.Alors il d&eacute;cide avec une intelligence foudroyante de rapidit&eacute; et de lucidit&eacute;
qu'il deviendrait le plus grand WaRloCk De L'IrC !!! Alors, il retourne sur le site des
gros lamerz et t&eacute;l&eacute;charge la notice du nuker qu'il avait t&eacute;l&eacute;charger en même temps
que le mail bomber.</b></font></p>

<p><font color="#FFFF00" size="3"><b>Bof
d&eacute;cide donc d'aller sur l'irc, il commence par dalnet, et la il se dirige au galot sur le
chan le plus connu, et dit qu'il est le plus grand HaCkErZ du monde et que si quelqu'un
l'embet&eacute; et bien il le nukerai. Quelqu'un r&eacute;agit sur le chan et dit ta gueule bof c'est
moi le super op de ce chan ; alors la bof se met &agrave; rire et demande &agrave; l'abruti qui lui a
r&eacute;pondu de s'excus&eacute; tout de suite sinon il va mourrir, mais le petit connard de op
continu,et ca &eacute;nerve BOF qui le nuke et la les 20 autres connect&eacute; au chan sont &eacute;pat&eacute;
et se mette &agrave; v&eacute;n&eacute;rer bof.</b></font></p>

<p><font color="#FFFF00" size="3"><b>C'est le
d&eacute;but de Bof le wArLoCk de L'IrC !! Apres ca bof a &eacute;t&eacute; sur tout les chans et &agrave; semer
la terreur partout!! Mais bof n'aime pas le chan #h=edm² de irc.kewl.org car sur ce chan
y-a que des cons qui lui r&eacute;sistent et s'amusent avec lui .... (NDC : :) top lol :) en
dessous tu dit qu'il peut pas se connecter apr&eacute;s 20 heure, merde je pourrai pas le voir
je me connecte &agrave; 1 heure :) !)</b></font></p>

<p><font color="#FFFF00" size="3"><b>Malgre les
connect&eacute; &agrave; #h=edm², tout les autres ont peur de bof. Je vais pass&eacute; tout les autres
exploits de bof car ils sont nombreux et je vais pass&eacute; &agrave; une autre &eacute;tape de la vie de
bof le hackerz ...)</b></font></p>

<p><font color="#FFFF00" size="3"><b>Bof, il en
a assez de l'irc, et oui, tout le monde a peur de lui et il ne s'amuse plus car personne
ne l'embete plus et qu'il peut donc plus nuker personne !!! Du coup, il d&eacute;cide de se
lancer dans le hacking de site web .....</b></font></p>

<p><font color="#FFFF00" size="3"><b>Seulement
voila, BoF, il ne veut pas hacker pour modifier des pages, ou par d&eacute;fit, non non non !!!
Lui il veut etre connu du monde entier, il veut etre le plus grand warlord de tout les
temps!!! Alors, il d&eacute;cide de s'attaquer &agrave; des grands sites, car pour lui, les sites
p&eacute;dophiles et racistes et tout, c'est de la merde car ce n'est pas connu et ca ne fait
pas connaitre beaucoup les hacker qui les piratent !!!</b></font></p>

<p><font color="#FFFF00" size="3"><b>Du coup,
BoF d&eacute;cide de s'attaquer &agrave; Yahoo ! et oui, c'est l'un des premiers moteurs de recherche,
et aussi le plus connu et visiter par beaucoup de monde !! Alors c'est d&eacute;cid&eacute;, ce sera
ce site l&agrave; la cible de bof, et ce sera pour ce soir !!!</b></font></p>

<p><font color="#FFFF00" size="3"><b>Ca y est,
il est 19 heures, BoF va s'attaquer &agrave; Yahoo ! il commence &agrave; 19 heures car sa maman ne
veut pas qu'il se couche apres 20 heures !! </b></font></p>

<p><font color="#FFFF00" size="3"><b>Il met ses
gants et son masque pour pas qu'on le reconnaisse &agrave; travers l'&eacute;cran et il se connecte ;
il se connecte &agrave; Yahoo ! et lance son Flooder, mais voila, il ne faut pas rentrer le host
du site &agrave; flooder, mais son IP , ce qui g&eacute;ne bcp BoF, car il ne sait pas ce qui c'est
une ip, alors il va sur l'irc, change de nick et va sur irc.kewl.org #h=edm² et demande
aux connect&eacute;s l'ip de yahoo ! mais personne ne lui r&eacute;pond jusqu'au moment où un hacker
au grand coeur lui donne l'ip de yahoo (NDC : un hacker au grand coeur, zavez remarquer la
rime) ! BoF ne remercie pas cette personne mais le traite de lamerz et se fait donc bannir
car les connecte de h=edm² sont fatigu&eacute; des lamez.</b></font></p>

<p><font color="#FFFF00" size="3"><b>Bof, tout
content avec son ip la rentre dans son flooder et clic sur start, et, comme il a une
connection encore plus rapide que la plus rapide des connections de chez yahoo ; du coup,
le serveur de yahoo passe un mauvais quart d'heure et est même bloqu&eacute; pendant un quart
d'heure, pas plus car Bof doit se coucher, il est deja 20 heures !! Et oui BoF ob&eacute;i bien
&agrave; sa maman, et il s'endort content de son exploit !</b></font></p>

<p><font color="#FFFF00" size="3"><b>Voila, je
m'arreterai sur cette partie de la vie de BoF le WarloCk , juste une indication : apres
cet exploit qui a ete archi m&eacute;diatis&eacute;,( en effet, c'est pas tout les jour que Yahoo !
est paralize ! ), BoF d&eacute;cide de s'attaquer &agrave; un autre grand site de vente par
correspondance, et aussi d'enchere ....... (mais ceci est une autre histoire !)</b></font></p>

<blockquote>
  <p>&nbsp;</p>
  <p align="center">Voila, j'ai eu envie d'&eacute;crire cette histoire pour : </p>
  <ul>
    <li><p>passer un coup de gueule contre les lamerz</p>
    </li>
    <li><p>passer un coup de gueule contre ceux qui ont flooder yahoo ! ce qui
      n'est pas un exploit du tout ...(y suffit d'avoir une bonne connection !! )</p>
    </li>
    <li><p>M'eclater </p>
    </li>
    <li><p>et pour que vous rigolier un peu et si jamais vous vous sentez tres tres
      proche de BoF et bien r&eacute;fl&eacute;chissez un peu &agrave; ce qu'est un hackeur et quelle est son
      image ou plutot celle qu'il souhaite avoir, mais qu'il n'a pas car des petits connard de
      lamerz la pourisse !!!</p>
    </li>
  </ul>
</blockquote>

<p align="center">&nbsp;</p>

<p align="center">Voila et n'oubliez pas </p>

<p align="center"><br>
<font size="4">Vive les VRAIS hackeurs<br>
Fuck les VRAIS lamerz</font></p>

<p align="center">&nbsp;</p>

<p align="center">Pour finir un proverbe :</p>

<p align="center"><font size="4">&quot;SI TOUT LES CONS VOLAIENT, LES LAMERZ SERAIENT
CHEFS D'ESQUADRILLE&quot;</font></p>

<p>Grosse Note de Croqmort :<br>
ah, quel belle histoire j'en ai la larme a l'oeil :) !!!!!!<br>
prochain mag je fait aussi une zolie histoire ! (pas sur le meme sujet)</p>

<p align="right">BigOOd</p>

<p>&nbsp;</p>
</body>
</html>
