<html>

<head>
<title>PhreakinG</title>
</head>

<body background="images/zertxtr.gif" bgcolor="#000000" text="#FFFFFF" link="#6699CC" vlink="#669966" alink="#999999">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td><font color="#3366FF" face="Verdana, Arial, Helvetica, sans-serif"><b>PHREAKING</b></font></td>
    <td align="right"><font color="#3366FF" face="Verdana, Arial, Helvetica, sans-serif"><b>COUNTERSTRIKE 
      - 2</b></font></td>
  </tr>
</table>
<p>&nbsp;</p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFCC00"><a name="box-files"></a>LES 
  BOX-FILES 2</font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFFFFF" size="2">Voil&agrave; 
  la deuxi&egrave;me partie de notre s&eacute;rie consacr&eacute;e aux boxs. Ici 
  tr&egrave;s peu de montage propos&eacute; pour l'instant, puisqu'il s'agit de 
  vous faire acqu&eacute;rir une &quot;culture g&eacute;n&eacute;rale&quot;. Bien 
  sur, lorsqu'on aura trait&eacute; toutes les box (ou presque), on se consacrera 
  plus au montage. D'ailleur, il y en a d&eacute;j&agrave; en pr&eacute;paration.</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"> 
  </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La can-box 
  =-</b><br>
  C'est tout simplement la red-box adapt&eacute;e aux cabines t&eacute;l&eacute;phoniques 
  canadiennes.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La cheese-box 
  =-</b><br>
  Transformer sa ligne t&eacute;l&eacute;phonique en cabine publique, &ccedil;a 
  vous plairait? Bah d&eacute;sol&eacute;, c'est uniquement aux USA.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La clear-box 
  =-</b><br>
  Celle l&agrave; aussi ne marche (marchait? en effet, elle a &eacute;t&eacute; 
  faite en 84!) qu'aux USA. Il existe des cabines qui ne demandent l'argent que 
  lorsque la communication est &eacute;tablie. Si l'argent n'est pas ins&eacute;r&eacute;, 
  le micro reste coup&eacute;, mais pas le haut-parleur. Le but est donc de remettre 
  en marche le micro sans ins&eacute;r&eacute; d'argent. Enfin, vu la date d'invention 
  de cette box, et la simplicit&eacute; du syst&egrave;me, tout &agrave; d&eacute;j&agrave; 
  du &ecirc;tre fait depuis longtemps pour y rem&eacute;dier.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La day-glo-box 
  =-</b><br>
  Aucun interet, puisque c'est une version plus d&eacute;taill&eacute;e de la 
  beige box. Je vous en parle juste pour votre culture g&eacute;n&eacute;rale 
  quoi. Au moins si vous la croisez vous saurez ce que c'est.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La gold-box 
  =-</b><br>
  C'est un fa&ccedil;on compliqu&eacute;e au maximum pour utiliser la ligne de 
  son voisin. Il faut donc que les deux lignes soient c&ocirc;t&eacute;-&agrave;-c&ocirc;te 
  dans le m&ecirc;me boitier. Une base de la box est branch&eacute;e &agrave; 
  votre ligne, et l'autre base &agrave; celle du voisin. La transmission se fait 
  par photor&eacute;ception. Moi je dis bof...</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La lunch-box 
  =-</b><br>
  Celle-ci est particuli&egrave;rement interessante. Elle permet d'&eacute;couter 
  une ligne &agrave; distance. Elle envoie la conversation par voie hertzienne. 
  On peut la capter avec une simple radio, puisqu'elle utilise la bande AM.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La magenta-box 
  =-</b><br>
  Assez cool pour emmerder le monde. Si quelqu'un vous fait chier, cette box va 
  se charger de faire sonner sa ligne sans interruption. Il suffit juste de trouver 
  un endroit propice, comme pour le beige boxing.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>-= La pink-box 
  =-</b><br>
  Elle sert &agrave; ajouter un boutton d'attente au t&eacute;l&eacute;phone. 
  Lorsque vous appuyez dessus, elle coupe le micro et envoie de la musique ou 
  ce que vous voullez d'ailleur.</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">La suite des Box-Files 
  au prochain num&eacute;ro =)</font> 
<p align="center"><img src="IMAGES/zerrulea.gif" width="600" height="10"> 
<p>&nbsp;
<p><a name="skunk"></a><b><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFCC00">LA 
  SKUNK-BOX </font></b> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Ben 
  la, on va parler d'une box vraiment basique et facile a faire...&nbsp;&nbsp;&nbsp;&nbsp; 
  Elle a quand m&ecirc;me quelques utilit&eacute;s sympas: &eacute;coutes de ses 
  propres communications t&eacute;l&eacute;phoniques, blast box, red box si vous 
  pr&eacute;voyez d'aller aux States&nbsp; (arf)</font><br>
  <font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  Me demandez pas pourkoi je lai appel&eacute;e comme ca, j'en sais rien.</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  &nbsp;</font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><b><u>Matos:</u></b></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">-1 
  t&eacute;l&eacute;phone (tout pourrave &agrave; 50 balles) de pr&eacute;f&eacute;rence 
  en une seule piece. (sans base quoi)</font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-2 prises jacks femelles (sur un vieux wakos y'en a)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-1 micro</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-1 HP (facultatif)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-tournevis/fer &agrave; souder/&eacute;tain...</font></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><b><u>La 
  box:</u></b></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Ouvrez 
  votre t&eacute;l&eacute;phone, trouvez le micro et coupez ses 2 fils &agrave; 
  ras</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  puis soudez 1 prise jack aux fils qui PARTENT du phone. (pas</font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">du micro)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">Ensuite, vous faites pareil avec le hp du t&eacute;l&eacute;phone; 
  ca vous fait donc 1 telephone avec 2 jacks soud&eacute;s a la place du HP et 
  du Mic.</font></font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">Apr&egrave;s, percez 2 trous derri&egrave;re le t&eacute;l&eacute;phone 
  et faites-y passer les 2 jacks </font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">de 
  maniere &agrave; ce qu'on puisse y acc&egrave;der quand le t&eacute;l&eacute;phone 
  est referm&eacute;, et</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  demerdez vous pour qu'on puisse faire la diff&eacute;rence entre le micro et 
  le HP quand le t&eacute;l&eacute;phone est ferm&eacute; et collez moi ca. (les 
  jacks).</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">Ensuite, refermez le tel et c'est fini !!</font></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><u><font color="#FFFFFF">Les 
  utilisations:</font></u></b><br>
  <u><font color="#FFFFFF">*Avec le jack du hp*</font></u></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">-enregistrer 
  ses conversations t&eacute;l&eacute;phoniques en y branchant un magn&eacute;tophone</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  ou directos sur le PC via la carte son</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-enregistrer les tones du phone (mouais bon...)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-brancher le hp &agrave; nimporte quel autre hp, m&ecirc;me 
  votre ampli de gratte</font></font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">--->FT ca d&eacute;coiffe...</font></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><u><font color="#FFFFFF">*Avec 
  le jack du micro*</font></u> <br>
  <font color="#FFFFFF">-balancer des tones d'un magn&eacute;tophone =) au lieu 
  de se faire chier avec un montage ki les genere...</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-vous le branchez sur votre carte son et vous balancez 
  nimporte kel son de votre PC sur la ligne</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-pareil avec un walkman</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-&eacute;couter les conversations de vos parents ;)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">-et enfin si vous vouliez 1 blast box, ben vous lavez 
  !:</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  mettez le volume de votre PC a donf et pensez poa aux oreilles du</font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"> 
  povre gars ke vous avez appel&eacute;.</font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">En 
  cadeau Bonux, zavez aussi le kit main libre.</font> 
<p align="center"><img src="IMAGES/zerrulea.gif" width="600" height="10">
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"> </font> 
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFCC00"><a name="gsm"></a>LES 
  GSM (r&eacute;&eacute;dition)</font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFFFFF" size="2">Bon, 
  je pr&eacute;f&egrave;re vous pr&eacute;venir tout de suite que cet article 
  ne va pas vous apprendre &agrave; phreaker des GSM (mais &ccedil;a va venir, 
  et on fera tout pour). Elle va juste vous donner les bases du fonctionnement 
  du r&eacute;seau GSM, l'organisation, le d&eacute;coupage du territoire, le 
  d&eacute;roulement d'un appel etc... En esp&eacute;rant que &ccedil;a pourra 
  donner des id&eacute;es &agrave; certain, et faire avancer les choses.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">I- 
  La norme GSM</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Le 
  GSM ( pour Global System for Mobile communication) est le successeur du Radiocom 
  2000. En effet, cette ancienne norme &eacute;tait analogique, ce qui posait 
  de nombreux probl&egrave;mes: l'encombrement, la qualit&eacute; audio m&eacute;diocre, 
  et surtout une trop grande phreakabilit&eacute;. En effet, il suffisait d'avoir 
  un graveur d'EEPROM et un fer &agrave; souder pour pouvoir cloner un t&eacute;l&eacute;phone 
  analogique. De plus, les &eacute;coutes t&eacute;l&eacute;phoniques &eacute;taient 
  facile, avec un scanner, on pouvait facilement intercepter une communication. 
  Le passage au num&eacute;rique a r&eacute;solu tout ces probl&egrave;mes d'un 
  coup. Les portables ont pu &ecirc;tre miniaturis&eacute;s, l'&eacute;coute est 
  meilleure, et surtout, les communications son crypt&eacute;es. Et c'est loin 
  d'&ecirc;tre un cryptage de base, mais cette partie sera abord&eacute;e plus 
  loin. Il y a aussi l'apparition de la carte SIM (Subscriber Identification Module), 
  qui stockera les infos de l'utilisateur, style son num&eacute;ro, ses param&egrave;tres, 
  son r&eacute;pertoire...<br>
  En France, trois op&eacute;rateurs se partagent le march&eacute; du portable: 
  SFR, Itineris et Bouyges Telecom (avis personnel: je les ai class&eacute;s du 
  meilleur au moins bon). Bien sur, comme on est en France, il en faut bien au 
  moins un qui ne fait pas comme tout le monde. L&agrave; c'est Bouyges qui va 
  jouer ce r&ocirc;le.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">II- 
  L'organisation du r&eacute;seau</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">En 
  raison du grand nombre d'abonn&eacute;s (environs 16 millions de personnes jusqu'&agrave; 
  maintenant en France), et comme il fallait que la communication ne soit pas 
  interrompue m&ecirc;me si la personne se d&eacute;place, il a fallu diviser 
  le territoire en cellules. </font></p>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td width="36%"><img src="images/cellules.jpg" width="362" height="450"></td>
    <td width="7%">&nbsp;</td>
    <td width="57%" align="left" valign="middle"> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">1 - Une cellule 
        est la plus petite division. Elle contient un emetteur-recepteur, encore 
        appel&eacute; &quot;station de base&quot;</font></p>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">2 - Les &quot;station 
        de base&quot; sont regroup&eacute;es en divisions plus grandes, et g&eacute;r&eacute;e 
        par des &quot;controleurs&quot;, qui sont charg&eacute; notamment d'assurer 
        la continuit&eacute; des communication lorsque l'utilisateur change de 
        cellule. Les controleur peuvent transf&eacute;rer les donn&eacute;es assez 
        vite d'une cellule &agrave; une autre pour qu'un utilisateur se d&eacute;placant 
        &agrave; plus de 300 Km/heure ne soit pas coup&eacute;.</font></p>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">3 - Les &quot;stations 
        de base&quot; et les &quot;controleurs&quot; forment ce qu'on appelle 
        un sous-syst&egrave;me radio. Plusieurs &quot;controleurs&quot; sont g&eacute;r&eacute;s 
        par un sous-syst&egrave;me r&eacute;seau, compos&eacute; de &quot;centres 
        de commutation de mobile&quot;. Ces centres sont reli&eacute;s &agrave; 
        des bases de donn&eacute;es. Ils sont aussi interconnect&eacute;s entre 
        eux, et reli&eacute;s au r&eacute;seau t&eacute;l&eacute;phonique filaire, 
        et au r&eacute;seau num&eacute;ris.</font></p>
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">4 - C'est 
        donc la laison entre les centres, et le r&eacute;seau t&eacute;l&eacute;phonique 
        filaire et num&eacute;ris.</font></p>
      </td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Evidement, toutes 
  les cellules ne sont pas de la m&ecirc;me taille. Le trafique &eacute;tant plus 
  dense, les cellules en milieux urbain sont beaucoup plus petites, et il y a 
  plus d'emetteur-recepteur au Km&sup2;. Quand aux zone moins peupl&eacute;es, 
  une &quot;station de base&quot; peut emettre et recevoir dans un rayon de 30 
  Km maximum.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">III- L'organisation 
  des fr&eacute;quences</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Le r&eacute;seau 
  GSM fran&ccedil;ais fonctionne sur la fr&eacute;quence de 900 MHz. C'est le 
  cas des r&eacute;seaux de SFR et Itineris. Le r&eacute;seau de </font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Bouyges 
  fonctionne sur la bande de 1800 MHz, r&eacute;seau encore appel&eacute; DCS 
  1800 (Digital Cellular System). Ce dernier &eacute;tant le plus r&eacute;cent, 
  il a d&eacute;cid&eacute; de se tourner vers un autre syst&egrave;me, ce qui 
  lui permet entre autre, d'avoir une tr&egrave;s bonne qualit&eacute; d'&eacute;coute. 
  Mais je ne reviendrai que tr&egrave;s rarement sur ce r&eacute;seau. <br>
  Mais de plus en plus, dans les grandes agglom&eacute;rations uniquement, les 
  mobiles SFR et Itineris peuvent fonctionner &agrave; 1800 MHz, et vice-versa 
  pour Bouyges. C'est pour &ccedil;a qu'il existe des t&eacute;l&eacute;phones 
  &quot;bibande&quot;, qui penvent fonctionner sur l'une des deux fr&eacute;quences 
  en fonction de l'encombrement du r&eacute;seau. Il existe m&ecirc;me des mobiles 
  &quot;tribande&quot;, qui penvent fonctionner sur le r&eacute;seau am&eacute;ricain 
  (1900 MHz)(Pour simple information: 120 pays fonctionnent sur la technologie 
  GSM. C'est l'UTI (Union Iternationale des Telecommunications) qui a d&eacute;fini 
  ces trois bandes des fr&eacute;quence pour le syst&egrave;me GSM).</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Mais 
  lorsque l'on parle de fr&eacute;quence &agrave; 900 MHz par exemple, en fait 
  il faut consid&eacute;rer toute une gamme de fr&eacute;quence. La bande 900 
  MHz est divis&eacute;e en deux sous bandes: 890-915 pour l'emission et 935-960 
  pour la reception. Ces sous-bandes sont encore divis&eacute;es, car une cellule, 
  aussi bien en emission qu'en reception ne doit pas &ecirc;tre &agrave; la m&ecirc;me 
  fr&eacute;quence que les cellules voisines. Ce qui fait en fin de compte 124 
  fr&eacute;quences diff&eacute;rentes. Ce syst&egrave;me est appel&eacute; FDMA 
  (acc&egrave;s multiple &agrave; r&eacute;partition de fr&eacute;quence).<br>
  Mais afin de traiter plusieurs abonn&eacute;s en m&ecirc;me temps. Vous imaginez 
  bien qu'une fr&eacute;quence n'est pas monopolis&eacute;e pour un utilisateur. 
  C'est l&agrave; qu'entre en sc&egrave;ne le syst&egrave;me TDMA (acc&egrave;s 
  multiple &agrave; r&eacute;partition dans le temps). Avec ce syst&egrave;me, 
  chaque fr&eacute;quence peut-&ecirc;tre utilis&eacute;e par huit mobile simultan&eacute;ment. 
  Le signal est d&eacute;compos&eacute; en tranches (&quot;trames&quot;), qui 
  reviennent &agrave; intervalles r&eacute;guliers. Chaque &quot;trame&quot; est 
  elle-m&ecirc;me d&eacute;coup&eacute;e e huit segments (slots). Chaque &quot;slot&quot; 
  est attribu&eacute; &agrave; un portable. Donc en r&eacute;sum&eacute;, un portable 
  en communication n'&eacute;met et ne recoit que pendant un laps de temps tr&egrave;s 
  court (le slot, qui dure 576.9 microsecondes), mais ce laps de temps reviens 
  assez souvent (toutes les trames, c'est &agrave; dire tous les 8 slots, faites 
  le calcul) pour que la communication paraisse continue.</font> </p>
<table width="75%" border="1" cellspacing="0" cellpadding="0" height="51">
  <tr align="center" valign="middle" bgcolor="#3366FF"> 
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
  </tr>
  <tr align="center" valign="middle" bgcolor="#FFFFFF"> 
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      1</font></td>
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      2</font></td>
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      3</font></td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Dans cet exemple, 
  le slot 8 a &eacute;t&eacute; attribu&eacute; au mobile. Mais les trames ne 
  durant que quelques milisecondes, et revenant donc souvent, la communication 
  sera continue.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Le t&eacute;l&eacute;phone 
  dispose donc d'une horloge tr&egrave;s pr&eacute;cise pour &ecirc;tre synchronis&eacute; 
  avec le relais. Maintenant, ne faisons plus attention aux autres slots:</font></p>
<table width="75%" border="1" cellspacing="0" cellpadding="0" height="51">
  <tr align="center" valign="middle" bgcolor="#3366FF"> 
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">1</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">2</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">3</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">4</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">5</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">6</font></td>
    <td bgcolor="#000000"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">7</font></td>
    <td bgcolor="#FFCC00"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">8</font></td>
  </tr>
  <tr align="center" valign="middle" bgcolor="#FFFFFF"> 
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      1</font></td>
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      2</font></td>
    <td colspan="8"><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#000000">trame 
      3</font></td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">La communication 
  est donc compos&eacute;e de la succession de ce slot 8, qui revient toute les 
  trames d'une fr&eacute;quence donn&eacute;e. Cette fr&eacute;quence d&eacute;finit 
  un canal physique, qui lui m&ecirc;me est d&eacute;compos&eacute; en canaux 
  logiques: la communication r&eacute;elle, et les informations du r&eacute;seau. 
  C'est pourquoi le syst&egrave;me GSM qui pourrait parraitre simple &agrave; 
  premi&egrave;re vu, en est tout autre.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Bon, le temps me 
  manque pour finir cet article, il sera au complet dans la prochaine issue de 
  CounterStrike... </font></p>
<p align="center"><img src="IMAGES/zerrulea.gif" width="600" height="10"></p>
<p>&nbsp;</p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFCC00"><a name="oufs"></a>LE 
  BEIGE BOXING POUR LES OUFS</font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Voil&agrave; 
  un petit article pas trop long &agrave; lire (donc &agrave; &eacute;crire ;) 
  vu ke y'a que des photos...</font> <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
  <font color="#FFFFFF">En fait ca plaira (j'espere) aux newbies qui s'int&eacute;ressent 
  au phreaking, vu ke la beige est a mon go&ucirc;t &agrave; la fois incontournable 
  et incontourn&eacute;e. (mais ill&eacute;gale, donc bla bla bla bla >et hop 
  un tit disclaimer)</font></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2">. 
  On va donc passer en revue un maximum de points propices au Beige (Pour les 
  ultra-newbies, voir l'article sur la beige box sur le site quand y sera reviendu). 
  Toujours pour ceux qui n'y connaissent rien du tout, ben &ccedil;a vous fera 
  un peu de culture en phreaking.<br>
  Et hop, Tipiak &agrave; pris son tit appareil photo pour vous fournir des explications 
  de base, parce qu'on dit toujours qu'une image vaut mieux qu'un long discours. 
  A croire que vous avez de la chance, puisque vous aurez les deux cette fois 
  ci.</font></p>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/REPART.JPG" height=373 width=300></font></td>
    <td> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font color="#00CC66">Le 
          r&eacute;partiteur</font></b></font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">J'avoue 
          que phreaker &agrave; partir d'un r&eacute;partiteur c'est un peu chaud. 
          Plusieurs raisons &agrave; &ccedil;a: en g&eacute;n&eacute;ral il est 
          situ&eacute; dans une zone r&eacute;sidentielle, donc m&ecirc;me en 
          pleine nuit c'est pas tr&egrave;s discret, &ccedil;a fait beaucoup de 
          bruit quand on l'ouvre (autant vous dire que m&ecirc;me pour prendre 
          la photo du bas on s'est pas &eacute;ternis&eacute;), et les connexions 
          &agrave; l'interieur sont minuscules. Mais d'un autre c&ocirc;t&eacute;, 
          vous avez acc&egrave;s &agrave; des centaines de lignes. Puis bon, c'est 
          toujours sympas de savoir comme c'est &agrave; l'interieur d'un r&eacute;partiteur.<br>
          Pour les ouvrir, deux cas peuvent se pr&eacute;senter:<br>
          - y'a une poign&eacute;e: dans ce cas si vous &ecirc;tes pas trop cons 
          vous la tournez et &ccedil;a doit s'ouvrir<br>
          - y'a pas de poign&eacute;e: bah l&agrave; c'est plus chaud. Explications:</font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">faut 
          un tournevis plat assez long et costaud, et/ou un pied de biche.</font> 
          <font face="Verdana, Arial, Helvetica, sans-serif" size="2"><br>
          <font color="#FFFFFF">A la verticale de l'anneau, tout en haut, &agrave; 
          la jointure, ca se passe comme ca :</font></font> </p>
        <center>
          <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/Image17.jpg" height=100 width=200> 
            </font> 
        </center>
        <p>
      </blockquote>
    </td>
  </tr>
</table>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="56%" valign="top">
      <blockquote>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><br>
          Vous descendez le penne avec le tournevis et avec le pied de biche, 
          vous vous d&eacute;merdez pour entrouvrir la moiti&eacute; superieure 
          de la porte, le tout sans faire de bruit. Ensuite, soulevez la porte 
          pour la d&eacute;gager du p&ecirc;ne inf&eacute;rieur et vous ouvrez...(avec 
          un pied devant pour pas faire trop de potin)</font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Ben 
          voil&agrave;, maintenant que vous l'avez ouvert, vous tombez face &agrave; 
          &ccedil;a. Voyez bien qu'il est difficile (mais pas impossible) de s'y 
          retrouver dans le bordel de fils. </font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Bon, 
          je vais pas m'&eacute;terniser l&agrave;-dessus, puisque tout &ccedil;a 
          fera l'objet d'explications tr&egrave;s d&eacute;taill&eacute;es plus 
          tard. </font></p>
      </blockquote>
    </td>
    <td valign="top" align="right" width="44%"> 
      <p><img src="IMAGES/repartiteur2.jpg" width="384" height="288"></p>
    </td>
  </tr>
</table>
<br>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="25%"><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/PLAK.JPG" height=168 width=243></font></td>
    <td width="75%" valign="top"> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font color="#00CC68">Les 
          plaques au sol</font></b></font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">L&agrave;, 
          tr&egrave;s gros inconv&eacute;nients (avec un s). Elles ne se trouvent 
          que dans des zone urbanis&eacute;es. Rares sont celles qui sont isol&eacute;es 
          de la civilisation. En plus, elles ont pas l'air comme &ccedil;a, mais 
          elles p&egrave;sent lourd, tr&egrave;s lourd... D'ailleur je me suis 
          niqu&eacute; les doigts pour vous!!! Pour que vous ayez la belle photo 
          qui est en-dessous!!! Alors appr&eacute;ciez l&agrave;, parce que j'ai 
          vraiment douill&eacute; sur ce coup l&agrave;. </font></p>
        <center>
        </center>
        <p> 
      </blockquote>
    </td>
  </tr>
</table>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="56%" valign="middle"> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><br>
          Pour aucune raison valable, vous n'aurez pas la photo dans cette &eacute;dition 
          de CounterStrike</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">, 
          mais dans la prochaine version, la 2.1 =) Alors va falloir reviendir 
          sur le site assez souvent, vu que je ne sais pas encore quand je l'aurai 
          cette putain de photo que &ccedil;a fais d&eacute;j&agrave; 6 MOIS QUE 
          J'ATTEND BORDEL!!!!!!!!!!!!!!!!</font></p>
        </blockquote>
    </td>
    <td valign="middle" align="center" width="44%"> 
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p><font color="#CC0000" face="Verdana, Arial, Helvetica, sans-serif">PHOTO 
        PHOTO PHOTO</font></p>
      <p><font color="#CC0000" face="Verdana, Arial, Helvetica, sans-serif">pas 
        dispo</font></p>
      <p><font color="#CC0000" face="Verdana, Arial, Helvetica, sans-serif">PHOTO 
        PHOTO PHOTO</font></p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
    </td>
  </tr>
</table>
<br>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="24%"><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/BOX.JPG" height=216 width=208></font></td>
    <td width="76%" valign="middle"> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font color="#00CC68">Les 
          raccordements aux habitations</font></b></font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Ah, &ccedil;a 
          c'est un truc bien, parce qu'il y en a absolument partout. M&ecirc;me 
          dans la cambrousse la plus profonde. En plus, elles sont tr&egrave;s 
          facile &agrave; ouvrir... au pire il y aura une grosse vis en plastique. 
          Quoique &agrave; bien y r&eacute;fl&eacute;chir, j'en ai vu en fer, 
          ferm&eacute; par une serrure, mais bon, faut quand m&ecirc;me &ecirc;tre 
          t&eacute;tu pour voulloir ouvrir des boites comme &ccedil;a. Donc elles 
          se trouvent en face des habitations, sur les murs, les poteaux. </font></p>
        <center>
        </center>
        <p> 
      </blockquote>
    </td>
  </tr>
</table>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="66%" valign="middle"> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><br>
          Quand on l'ouvre c'est magique. En g&eacute;n&eacute;ral, il y a une 
          grosse gaine noire qui contient les lignes descendantes (vers le central 
          t&eacute;l&eacute;phonique). Les fils qui en sortent sont TOUJOURS raccord&eacute;s 
          par paires aux dominos avec du gel dessus. Ensuite les fils blancs sont 
          les lignes montantes vers les habitations. Pour ceux qui n'ont jamais 
          eu l'occasion d'en voir</font><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">, 
          ben voil&agrave;. Si vous faites du beige boxing un jour, il suffit 
          de choisir un domino, de pas foutre les doigts dans le gel parce que 
          c'est d&eacute;gueu, de prenre les deux fils de la ligne montante et 
          de les d&eacute;nuder. Ensuite, beige box rulez!!! Mais bon, vous le 
          ferez jamais parce que c'est illegal, et d'abord c'est pas bien de trafiquer 
          du mat&eacute;riel qui ne vous appartient pas =) Nous on se d&eacute;gage 
          de toute responsabilit&eacute;. </font></p>
      </blockquote>
    </td>
    <td valign="top" align="right" width="34%"> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/BOXX.JPG" height=273 width=294></font></p>
    </td>
  </tr>
</table>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="37%"><font face="Verdana, Arial, Helvetica, sans-serif" size="2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="IMAGES/Image18.jpg" height=254 width=99><img src="IMAGES/Image19.jpg" height=159 width=191></font></td>
    <td width="63%" valign="middle"> 
      <blockquote> 
        <p>&nbsp;</p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">On en trouve 
          un peu de toutes les tailles. En g&eacute;n&eacute;ral, les boites comme 
          &ccedil;a sont sur des poteaux, et particuli&egrave;rement au d&eacute;but 
          des voix communales. Elles font souvent le lien entre les lignes enfouies 
          et a&eacute;riennes. C'est donc le m&ecirc;me principe, sauf qu'il y 
          a plus de ligne eheh =)</font> </p>
        <p> 
      </blockquote>
    </td>
  </tr>
</table>
<br>
<table width="95%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="70%" valign="middle"> 
      <blockquote> 
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF"><br>
          Enfin pour ceux qui auraient du mal &agrave; reconnaitre du matos de 
          chez FT, ben c'est simple, &ccedil;a porte en g&eacute;n&eacute;ral 
          ce genre d'&eacute;tiquettes, de 4cm sur 8</font></p>
        <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2" color="#FFFFFF">Enjoy 
          =) </font></p>
      </blockquote>
    </td>
    <td valign="top" align="right" width="30%"> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><img src="IMAGES/NOIR.JPG" height=192 width=265></font></p>
    </td>
  </tr>
</table>
<font face="Verdana, Arial, Helvetica, sans-serif" size="2"> </font> 
</body>

</html>
