
<html>
<head>
<title>ccc</title>
</head>
<body bgcolor="#224016" text="#FFFFFF" link="#CCCCCC" vlink="#CCCCCC" alink="#FF0066" >
<center>
<br>
<table width="600" border="0"><td>
<p align="left"><a href="../dst.htm"><img src="previous.gif" border="0"></a></p></td>
<td><p align="right"><a href="../digicode.html"><img src="next.gif" border="0"></a></p></td></table>

<br>
<table width="600"><td>
<font face="verdana" size="2"><BR>
<B><U><FONT FACE="Arial" SIZE=4><P ALIGN="CENTER">  </P>
<P ALIGN="CENTER"></P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
</U></FONT><FONT FACE="Arial" SIZE=6><P ALIGN="CENTER">GUIDE DE CROCHETAGE DES SERRURES A GOUPILLES</P>
<U><P ALIGN="CENTER"></P>
</FONT><FONT FACE="Arial" SIZE=4><P ALIGN="CENTER">&nbsp;</P>
</FONT><FONT FACE="Arial" SIZE=3><P ALIGN="CENTER"><IMG SRC="lock.gif"</P>
</FONT><FONT FACE="Arial" SIZE=4><P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
</U></FONT><FONT FACE="Arial" SIZE=6><P ALIGN="CENTER">M.I.T. Guide to Lock Picking</P>
<P ALIGN="CENTER">TED THE TOOL</P>
<P ALIGN="CENTER"></P>
</B></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="CENTER">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=4><P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
</FONT><FONT FACE="Arial" SIZE=5><P ALIGN="CENTER">TRADUCTION FRANCAISE </P>
<P ALIGN="CENTER"></P>
<P ALIGN="CENTER">&nbsp;</P>
</B></FONT><FONT FACE="Arial" SIZE=4><P ALIGN="CENTER">VERSION O1</P>
<B><P ALIGN="CENTER"></P>
</B></U></FONT><FONT FACE="Arial"><P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<B><U><P ALIGN="CENTER">&nbsp;</P>
</U><P ALIGN="CENTER">Par Efrh@ck et S&eacute;same</P>
<U><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">DISTRIBUTION</P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</B></U><P>Copyrights 1987-1991 Theodore T. TOOL Tous droits r&eacute;serv&eacute;s</P>

<P ALIGN="JUSTIFY">L’autorisation de reproduire ce document est libre de tout droit tant que les reproductions par quelque moyen que ce soit sont distribu&eacute;es gratuitement et qu’elles comportent, de plus, la mention compl&egrave;te des copyrights</P>

<P>Le contenu de ce manuel est diffus&eacute; uniquement &agrave; titre documentaire.</P>

<P>En aucun cas, nous ne  pourrions  &ecirc;tre tenu pour responsable de l’emploi ill&eacute;gal de ces m&eacute;thodes d’ouverture</P>
<P><BR>
</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">AVERTISSEMENT</P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</U></FONT><FONT FACE="Arial" COLOR="#ff0000"><P ALIGN="JUSTIFY">Le contenu de ce manuel est diffus&eacute; uniquement &agrave; titre documentaire.</P>
</FONT><U><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</U></FONT><FONT FACE="Arial" COLOR="#ff0000"><P ALIGN="JUSTIFY">En aucun cas, les traducteurs ne pourraient &ecirc;tre tenus pour responsable de l’emploi ill&eacute;gal des m&eacute;thodes d’ouverture d&eacute;crites dans ce manuel.</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</FONT><B><U><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">&nbsp;</P>
</B></U></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">La traduction fran&ccedil;aise et les annotations techniques sont de&nbsp;: Ephr@ack et S&eacute;same</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">France -  Septembre 1999.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<I><P ALIGN="JUSTIFY">&#9;&#9;&#9;__________________________________________</P>
</I></FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Sommaire</P>
</U></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1 C’est facile&nbsp;!</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">2 Comment une clef ouvre une serrure !</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">3  Le mod&egrave;le de base </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">4 Les bases du crochetage &amp; les d&eacute;fauts m&eacute;caniques</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">5 Le mod&egrave;le &agrave; goupilles </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">6 Les bases du &quot;&nbsp;raclage&nbsp;&quot; ou &quot;&nbsp;ratissage&nbsp;&quot;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">7 Techniques avanc&eacute;es de crochetage </P>
</B><P ALIGN="JUSTIFY">7,1 Habilet&eacute;s m&eacute;caniques </P>
<P ALIGN="JUSTIFY">7,2 Zen ou l'Art du crochetage </P>
<P ALIGN="JUSTIFY">7,3 Pens&eacute;e Analytique </P>
<B><P ALIGN="JUSTIFY">8 Exercices</P>
</B><P ALIGN="JUSTIFY">8,1 Exercice 1:Faire rebondir le crochet ou &quot;&nbsp;pick&nbsp;&quot;</P>
<P ALIGN="JUSTIFY">8,2 Exercice 2 :Tension de crochetage </P>
<P ALIGN="JUSTIFY">8,3 Exercice 3 :La rotation </P>
<P ALIGN="JUSTIFY">8,4 Exercice 4 : Identifier l'ensemble des goupilles</P>
<P ALIGN="JUSTIFY">8,5 Exercice 5 : Projection</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">9</B> <B>Reconna&icirc;tre et exploiter les &quot;&nbsp;faiblesses&nbsp;&quot; des serrures</P>
</B><P ALIGN="JUSTIFY">9,1 De quel c&ocirc;t&eacute; tourner&nbsp;!</P>
<P ALIGN="JUSTIFY">9,2 Comment tourner !</P>
<P ALIGN="JUSTIFY">9,3 La gravit&eacute; </P>
<P ALIGN="JUSTIFY">9,4 Goupille non positionn&eacute;e</P>
<P ALIGN="JUSTIFY">9,5 D&eacute;formations et &eacute;lasticit&eacute; </P>
<P ALIGN="JUSTIFY">9,6 Rotor ou barillet ayant du jeu </P>
<P ALIGN="JUSTIFY">9,7 Diam&egrave;tre de la goupille</P>
<P ALIGN="JUSTIFY">9,8 Trous biseaut&eacute;s et goupilles arrondies </P>
<P ALIGN="JUSTIFY">9,9  Goupille  anti-t&acirc;tage  en "champignon" </P>
<P ALIGN="JUSTIFY">9,10 Clefs &quot;&nbsp;passe partout&nbsp;&quot;</P>
<P ALIGN="JUSTIFY">9,11 Un s&eacute;parateur coince le rotor</P>
<P ALIGN="JUSTIFY">9,12 Crochetage par vibrations </P>
<P ALIGN="JUSTIFY">9,13 Serrures &agrave; paillettes</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">10 Derni&egrave;res remarques</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Appendice A&nbsp;: Les outils</P>
</B><P ALIGN="JUSTIFY">A.1 Formes des crochets palpeurs (ou picks)</P>
<P ALIGN="JUSTIFY">A.2 La lame de balai m&eacute;tallique</P>
<P ALIGN="JUSTIFY">A.3 Le rayon de bicyclette </P>
<P ALIGN="JUSTIFY">A.4 Les bandes m&eacute;talliques de conditionnement</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Appendice B&nbsp;: Implications l&eacute;gales en France</P>
</B><P ALIGN="JUSTIFY"></P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 1</P>
</U></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C'est Facile</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le secret du crochetage des serrures est que c'est facile. N’importe qui peut apprendre comment crocheter. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La th&eacute;orie du crochetage est l'art d'exploiter les d&eacute;fauts m&eacute;caniques des serrures. Il y a un certain nombre de  concepts &eacute;l&eacute;mentaires et quelques d&eacute;finitions &agrave; savoir mais l’essentiel consiste en des astuces qui exploitent les d&eacute;fauts m&eacute;caniques particuliers ou  les caract&eacute;ristiques propres de la serrure &agrave; ouvrir. Ce manuel en refl&egrave;te l’id&eacute;e. Les premiers chapitres pr&eacute;sentent le vocabulaire et les informations de base concernant certaines serrures et leur crochetage. Il est impossible d'apprendre le crochetage sans pratiquer. Un chapitre sera donc consacr&eacute; &agrave; un ensemble d'exercices choisis avec soin pour vous aider &agrave; acqu&eacute;rir les tours de main et <BR>
l’habilet&eacute; n&eacute;cessaire au t&acirc;tage et au crochetage. Ce manuel se termine par une liste de d&eacute;fauts m&eacute;caniques et des caract&eacute;ristiques de certaines serrures ainsi que les techniques &agrave; employer pour reconna&icirc;tre les dits d&eacute;fauts aux fins d’ouverture. Le premier appendice d&eacute;crit comment fabriquer soi-m&ecirc;me ses outils de crochetage. Le second appendice quant &agrave; lui pr&eacute;sente l'aspect l&eacute;gal en France.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Les exercices sont importants. Seule la pratique permet d'apprendre &agrave; reconna&icirc;tre et &agrave; exploiter &agrave; votre avantage les d&eacute;fauts m&eacute;caniques d'une serrure. Cela signifie qu’il faut beaucoup s'exercer, aussi bien sur une m&ecirc;me serrure que sur un grand nombre de marques et de mod&egrave;les diff&eacute;rents. Tout le monde  peut ainsi apprendre comment ouvrir des serrures de bureau, des cadenas, mais la qualification pour ouvrir rapidement la plupart des serrures exige beaucoup d’entra&icirc;nement pour obtenir cette comp&eacute;tence. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Avant d'entrer dans les d&eacute;tails des serrures &agrave; goupilles et de leurs techniques de crochetage, il faut pr&eacute;ciser que ce n'est pas l’unique moyen d’ouverture. Toutefois c’est la solution la plus discr&egrave;te car elle ne cause aucun d&eacute;g&acirc;t. En fait, il est souvent plus facile de neutraliser ou de contourner le m&eacute;canisme interne de la &quot;&nbsp;suret&eacute;&nbsp;&quot; ou d'autres parties de la porte (les gonds par exemple) que la serrure. Il est m&ecirc;me parfois plus simple de contourner carr&eacute;ment la porte en passant par exemple par un autre endroit. Souvenez-vous : Il y a toujours une autre possibilit&eacute; d'entrer qui est souvent bien  meilleure. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 2</P>
</B></U></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Comment une clef ouvre une serrure&nbsp;?</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ce chapitre pr&eacute;sente le fonctionnement de base de la serrure &agrave; goupilles, et le vocabulaire  utilis&eacute; dans cette brochure. Les termes utilis&eacute;s pour d&eacute;crire les serrures et les parties qui les composent varient d'un fabricant &agrave; l'autre et parfois d'une ville &agrave; l'autre, donc m&ecirc;me si vous connaissez d&eacute;j&agrave; le fonctionnement de base d'une serrure, vous devrez regarder le sch&eacute;ma 2,1 pour apprendre le vocabulaire que nous utiliserons dans ce manuel. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image2.gif" WIDTH=612 HEIGHT=476></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 2.1</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*note – nous avons utilis&eacute; comme r&eacute;f&eacute;rence le vocabulaire technique des meilleurs manuels  fran&ccedil;ais de serrurerie du moment.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Vous devez savoir, en premier lieu, quels sont les m&eacute;canismes physiques, m&eacute;caniques, qui entrent en jeu quand une serrure est ouverte par une clef. Vous devez aussi comprendre comment une serrure &quot;&nbsp;r&eacute;pond&nbsp;&quot; au t&acirc;tage et au crochetage. Les chapitres 3 et 5 traiterons de ce sujet, en s’appuyant sur des exemples. </P>
<P ALIGN="JUSTIFY">Le sch&eacute;ma 2,1 pr&eacute;sente le vocabulaire propre &agrave; la serrurerie que nous emploierons. La clef est ins&eacute;r&eacute;e dans l’ &quot;&nbsp;<B><I>l’entr&eacute;e</B></I>&nbsp;&quot; du <B><I>rotor ou barillet</B></I>. Les protub&eacute;rances sur les c&ocirc;t&eacute;s de la l’entr&eacute;e de la cl&eacute; sont appel&eacute;es des &quot;&nbsp;&eacute;ves&nbsp;&quot;  - qui seront saillantes et/ou rentrantes -. Les &quot;&nbsp;<B><I>&eacute;ves</B></I>&nbsp;&quot;  d&eacute;terminent le profil de la clef pouvant &ecirc;tre ins&eacute;r&eacute;e dans l’entr&eacute;e du rotor. Les diff&eacute;rents profils de clef sont appel&eacute;s &quot;&nbsp;variures&nbsp;&quot;. Le barillet ou rotor est la partie mobile de la serrure qui peut pivoter sur son axe lorsque la clef ad&eacute;quate y est ins&eacute;r&eacute;e compl&egrave;tement. La partie fixe de la serrure est appel&eacute;e le <B><I>cylindre ou stator</B></I>. La premi&egrave;re goupille touch&eacute;e par la clef est appel&eacute;e &quot;&nbsp;premi&egrave;re goupille&nbsp;&quot;. Les goupilles restantes sont num&eacute;rot&eacute;es de l'avant vers l'arri&egrave;re de la serrure selon leur nombre. (1, 2&nbsp;; 3, 4, etc.)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La clef ad&eacute;quate l&egrave;ve les goupilles simultan&eacute;ment jusqu'&agrave; ce que l'intervalle (c&eacute;sure) entre les deux goupilles (de rotor et de stator) soit align&eacute; avec <B><I>la ligne de c&eacute;sure</B></I> g&eacute;n&eacute;rale de la serrure appel&eacute;e aussi &quot;mise au &nbsp;passage&nbsp;&quot;. Ce &quot;&nbsp;passage&nbsp;&quot; est donc constitu&eacute; par l’interruption de l’organe de blocage&nbsp;: une  &quot;&nbsp;brisure&nbsp;&quot; de la goupille.&nbsp; Quand toutes les goupilles sont en position d’ouverture, - &quot;&nbsp;au passage&nbsp;&quot; -  le barillet dit aussi rotor peut tourner et la serrure peut &ecirc;tre ouverte. Une clef inadapt&eacute;e (dans la coupe des tailles de goupilles) laissera quelques goupilles &agrave; une hauteur inad&eacute;quate et donc fausse, entre le rotor et le stator,  et ces derni&egrave;res emp&ecirc;cheront la rotation du barillet (ou rotor) dans le cylindre (ou stator) en se bloquant contre ce dernier. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sch&eacute;ma 2.1 : Fonctionnements des serrures &agrave; goupilles</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">*note – lexique </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">nous avons employ&eacute; les termes de &quot;&nbsp;<B><I>goupille active</B></I>&nbsp;&quot; ou &quot;&nbsp;<B><I>active</B></I>&nbsp;&quot; pour la goupille de rotor – en effet, elle est en contact direct avec la partie &quot;&nbsp;active&nbsp;&quot; de la clef (la rampe)</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">les termes de &quot;&nbsp;<B><I>goupille passive</B></I>&nbsp;&quot; ou &quot;&nbsp;<B><I>passive</B></I>&nbsp;&quot; pour la goupille de stator, celle-ci subissant &quot;&nbsp;passivement&nbsp;&quot; l’action de &quot;&nbsp;l’active&nbsp;&quot; </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">un &quot;piston&quot; est constitu&eacute; par deux logements cylindriques &quot;&nbsp;en colonne&nbsp;&quot; dans le prolongement l’un de l’autre dans le rotor et le stator et contenant deux goupilles empil&eacute;es, de taille et de longueur  variables,  et d’un ressort dont l’ensemble constitue une &quot;&nbsp;s&ucirc;ret&eacute;&nbsp;&quot;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">les diff&eacute;rentes &quot;&nbsp;tailles&nbsp;&quot;&nbsp;ou &quot;&nbsp;coupes&nbsp;&quot; de la clef sont appel&eacute;es &quot;&nbsp;variations&nbsp;&quot;. Ce sont les &quot;&nbsp;dents&nbsp;&quot; de la &quot;&nbsp;clef plate&nbsp;&quot; destin&eacute;e aux serrures &agrave; goupilles. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">les diff&eacute;rents &quot;&nbsp;profils&nbsp;&quot; de clef  engendr&eacute;s par les &quot;&nbsp;&eacute;ves&nbsp;&quot; sont appel&eacute;s &quot;&nbsp;variures&nbsp;&quot;. Ils forment un dessin particulier  en fonction des &quot;&nbsp;rainures&nbsp;&quot; de la clef quand on la regarde de face.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">l’ensemble du  &quot;&nbsp;stator&nbsp;&quot; ou &quot;&nbsp;cylindre&nbsp;&quot; et du &quot;&nbsp;rotor&nbsp;&quot; ou &quot;&nbsp;barillet&nbsp;&quot; forment le &quot;&nbsp;canon&nbsp;&quot; de la serrure ou du verrou</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">une serrure &agrave; goupilles est aussi appel&eacute;e parfois&nbsp;serrure ou verrou &quot;&nbsp;paracentrique&nbsp;&quot; </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">un &quot;&nbsp;verrou&nbsp;&quot; ne comporte qu’un seul &quot;&nbsp;p&ecirc;ne dormant&nbsp;&quot;  de forme rectangulaire qui ne peut &ecirc;tre actionn&eacute; que par la cl&eacute; et/ou le bouton de manœuvre interne.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Une serrure dite &agrave; &quot;&nbsp;bec de cane&nbsp;&quot; ou &quot;&nbsp;demi-tour&nbsp;&quot; comporte deux &quot;&nbsp;p&ecirc;nes&nbsp;&quot;&nbsp;:  en plus du &quot;&nbsp;p&ecirc;ne dormant&nbsp;&quot; un autre &quot;&nbsp;p&ecirc;ne&nbsp;&quot; ou &quot;&nbsp;g&acirc;che demi-tour&nbsp;&quot;  (taill&eacute;e en biseau) qui vous permet de &quot;&nbsp;fermer&nbsp;&quot; (&nbsp;?&nbsp;?&nbsp;?) la porte en la &quot;&nbsp;claquant&nbsp;&quot;</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 3</P>
</U></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le mod&egrave;le de d&eacute;monstration </P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour devenir un bon &quot;&nbsp;ouvreur&nbsp;&quot;, vous aurez besoin de comprendre de fa&ccedil;on d&eacute;taill&eacute;e comment fonctionne une serrure et quels sont les diff&eacute;rents m&eacute;canismes physiques ou m&eacute;caniques qui entrent en jeu lorsqu’elle est t&acirc;t&eacute;e ou crochet&eacute;e. Ce manuel pr&eacute;sente deux mod&egrave;les diff&eacute;rents de serrures pour mieux vous aider &agrave; en  comprendre le fonctionnement. Ce chapitre pr&eacute;sente un mod&egrave;le qui souligne l'importance de la position de chacune des goupilles. Le chapitre 4 utilise ce m&ecirc;me mod&egrave;le pour expliquer les principes du t&acirc;tage, tout comme le chapitre 9  qui analyse certains d&eacute;fauts  m&eacute;caniques plus complexes. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="center"><IMG SRC="Image3.gif" WIDTH=595 HEIGHT=197></P></FONT><FONT FACE="Arial">Le mod&egrave;le de serrure de d&eacute;monstration est pr&eacute;sent&eacute; dans le sch&eacute;ma 3.1. Ce n'est pas la coupe d'une v&eacute;ritable serrure, mais la repr&eacute;sentation sch&eacute;matis&eacute;e d’un m&eacute;canisme tr&egrave;s simple utilis&eacute; dans un but didactique ( inspir&eacute; d’une serrure d’&eacute;poque romaine). Le r&ocirc;le de cette serrure est d’emp&ecirc;cher deux plaques de m&eacute;tal de glisser l'une sur l'autre &agrave; moins que la clef ad&eacute;quate ne soit pr&eacute;sente. Cette serrure est constitu&eacute;e de deux plaques superpos&eacute;es et perc&eacute;es de trous de passage qui les traversent. Le sch&eacute;ma montre une serrure &agrave; deux &quot;&nbsp;pistons&nbsp;&quot;. Deux goupilles sont plac&eacute;es dans chaque trou de passage de fa&ccedil;on &agrave; ce que l'intervalle (c&eacute;sure) entre les dites goupilles ne s'aligne pas  au passage (avec la ligne de c&eacute;sure g&eacute;n&eacute;rale) entre les plaques. Le sommet de la goupille active doit &ecirc;tre amen&eacute; sur la ligne de c&eacute;sure g&eacute;n&eacute;rale des plaques  pour autoriser l’ouverture. Une protub&eacute;rance situ&eacute;e sur la partie inf&eacute;rieure de la plaque du bas emp&ecirc;che les goupilles de tomber en dehors des plaques, et un ressort plac&eacute; au-dessus de la plaque sup&eacute;rieure appuie sur la goupille passive (la  goupille sup&eacute;rieure, appel&eacute;e aussi &quot;&nbsp;passive&nbsp;&quot; ou &quot;&nbsp;goupille de stator&nbsp;&quot;).</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 3.1: Mod&egrave;le de serrure </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image4.gif" WIDTH=501 HEIGHT=229></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 3.2: (a) La clef l&egrave;ve les goupilles</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Si la clef est absente, les plaques ne peuvent glisser l'une sur l'autre parce que une partie de la goupille passive passe au travers des deux plaques, les bloquant. La clef ad&eacute;quate soul&egrave;ve les goupilles jusqu’&agrave; ce que l'espace (c&eacute;sure) situ&eacute; entre les deux goupilles (de rotor et de stator) et la ligne de c&eacute;sure g&eacute;n&eacute;rale (l’espace se trouvant entre les plaques) soit align&eacute;e .(Voir le sch&eacute;ma 3.3). Ainsi, la clef soul&egrave;ve simultan&eacute;ment les goupilles (actives et passives) jusqu’&agrave; ce qu'elles atteignent leur ligne de c&eacute;sure propre puis la ligne de c&eacute;sure g&eacute;n&eacute;rale de la serrure. Dans cette configuration les plaques peuvent glisser l'une sur l'autre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le sch&eacute;ma 3,3 illustre &eacute;galement l’une des caract&eacute;ristiques fondamentales des serrures. Il existe toujours un certain jeu entre les diff&eacute;rentes pi&egrave;ces constituant une serrure. En effet, toute pi&egrave;ce m&eacute;canique  glissant l'une sur l'autre doit &ecirc;tre s&eacute;par&eacute;e par un intervalle, un jeu,  m&ecirc;me tr&egrave;s l&eacute;ger. Le jeu m&eacute;canique entre les deux plaques permet &agrave; une vari&eacute;t&eacute; de clefs correctement taill&eacute;es d'ouvrir la serrure. Remarquons que la goupille de droite dans le sch&eacute;ma 3,3 ne se trouve pas exactement au m&ecirc;me niveau que celle de gauche, cependant la serrure s'ouvrira quand m&ecirc;me.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image5.gif" WIDTH=568 HEIGHT=225></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;Sch&eacute;ma 3.3: (b) La clef ad&eacute;quate permet aux plaques de glisser</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 4</P>
<P ALIGN="JUSTIFY"></P>
</U></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Bases du crochetage &amp; les d&eacute;fauts m&eacute;caniques</P>
</B></FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Le mod&egrave;le de d&eacute;monstration  souligne le d&eacute;faut de base qui permet le crochetage&nbsp;: le jeu m&eacute;canique. Ce d&eacute;faut permet d'ouvrir une serrure en positionnant les goupilles par t&acirc;tage l'une apr&egrave;s l'autre, Il n’est alors plus n&eacute;cessaire qu’une clef  soul&egrave;ve tous les goupilles en m&ecirc;me temps. Les sch&eacute;mas 4.1- 4.3 montrent comment les goupilles d'une serrure peuvent &ecirc;tre soulev&eacute;es une par une par t&acirc;tage. La premi&egrave;re &eacute;tape de cette proc&eacute;dure consiste &agrave; appliquer une force translatoire sur la serrure en poussant longitudinalement sur la plaque du bas. Cette force permet &agrave; une ou &agrave; plusieurs des goupilles d’&ecirc;tre  coinc&eacute;es entre les deux plaques en raison des jeux m&eacute;caniques. Le d&eacute;faut le plus classique des serrures est qu'une seule goupille bloque l’ouverture (le glissement) des deux plaques. Dans le sch&eacute;ma 4,1 on peut remarquer que la goupille de gauche bloque les plaques. Pourtant, m&ecirc;me si une goupille bloque, elle peut &ecirc;tre pouss&eacute;e vers le haut gr&acirc;ce &agrave; un outil de crochetage (que l’on appelle &quot;&nbsp;palpeur&nbsp;&quot; ou &quot;&nbsp;pick&nbsp;&quot; ou &quot;&nbsp;lifter&nbsp;&quot; en anglais), voir le sch&eacute;ma 4.2. Quand le sommet de la goupille active atteint la ligne de c&eacute;sure g&eacute;n&eacute;rale, la plaque du bas peut alors glisser l&eacute;g&egrave;rement. Si le palpeur est retir&eacute;, la goupille sera maintenue par chevauchement ou cisaillement de la plaque du bas, et la goupille active retombera en bas &agrave; sa place initiale , voir le sch&eacute;ma 4.3. Le l&eacute;ger mouvement de la plaque du bas cause alors le blocage d'une nouvelle goupille. La m&ecirc;me proc&eacute;dure pourra alors &ecirc;tre utilis&eacute;e pour positionner correctement cette derni&egrave;re. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image6.gif" WIDTH=566 HEIGHT=184></P></FONT><FONT FACE="Arial">&#9;&#9;&#9;Sch&eacute;ma 4.1&nbsp;: </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image7.gif" WIDTH=570 HEIGHT=217></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 4.2</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image8.gif" WIDTH=586 HEIGHT=180></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 4.3</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ainsi, la technique du t&acirc;tage goupille par goupille consiste &agrave; appliquer une force translatoire (rotative dans le cas d’une serrure &agrave; rotor), &agrave; trouver la goupille qui coince le plus, et la mettre en place. Quand le sommet de la goupille active atteint la ligne de c&eacute;sure g&eacute;n&eacute;rale et est &quot;&nbsp;au passage&nbsp;&quot; , la partie en mouvement de la serrure bougera l&eacute;g&egrave;rement, et la goupille  sera alors  &quot;&nbsp;pi&eacute;g&eacute;e&nbsp; par cisaillement&quot; entre les plaques au niveau de la ligne de c&eacute;sure g&eacute;n&eacute;rale (&quot;&nbsp;au passage&nbsp;&quot;). On appelle cela positionner.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le chapitre 9 traite des diff&eacute;rents d&eacute;fauts qui font qu'une seule goupille &agrave; la fois bloque le m&eacute;canisme. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">1. Appliquez une force rotative. 2. Trouvez la goupille qui coince le plus. 3. Pousser cette derni&egrave;re vers le haut jusqu'&agrave; ce que vous sentiez qu'elle a atteint la ligne de c&eacute;sure. 4.Repasser &agrave; la deuxi&egrave;me &eacute;tape et ainsi de suite. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Chapitre 5</P>
</U></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le mod&egrave;le &agrave;&nbsp;goupilles </P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le mod&egrave;le de serrure didactique peut expliquer les effets qui impliquent plus d'une goupille, mais un mod&egrave;le diff&eacute;rent est n&eacute;cessaire pour expliquer le fonctionnement d&eacute;taill&eacute; d'une seule goupille. Voire le sch&eacute;ma 5.1. Le mod&egrave;le de goupilles &quot;&nbsp;en colonne&nbsp;&quot; souligne le rapport entre  la pression rotative &agrave; appliquer et la force &agrave; employer pour soulever chaque goupille. Il est essentiel que vous compreniez cette interd&eacute;pendance.</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image9.gif" WIDTH=335 HEIGHT=456></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 5.1</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Pour comprendre la "sensation" du t&acirc;tage vous devez savoir comment le mouvement d'une goupille est affect&eacute;e par la  rotation appliqu&eacute;e par votre outil de tension (que l’on appelle un entra&icirc;neur) et par la pression appliqu&eacute;e par votre crochet palpeur. Un bon moyen de repr&eacute;senter cette interaction est un graphique repr&eacute;sentant la pression minimum n&eacute;cessaire pour d&eacute;placer une goupille, en fonction de la profondeur qu'elle doit atteindre &agrave; partir de sa position initiale. Le reste de ce chapitre extrapolera le graphique des forces &agrave; appliquer pour le mod&egrave;le des goupilles en  colonne. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le sch&eacute;ma 5,2 repr&eacute;sente la position d’une goupille lorsqu'une force rotative est appliqu&eacute;e sur le rotor. Les  forces en pr&eacute;sences sont les frottements des c&ocirc;t&eacute;s de la goupille, la pression du ressort au-dessus du m&eacute;canisme, et le contact de la goupille du dessous. La force &agrave; appliquer sur le crochet palpeur d&eacute;termine la pression du contact en dessous. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image10.gif" WIDTH=318 HEIGHT=465></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 5.2</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La pression du ressort augmente lorsque les goupilles sont pouss&eacute;es dans le cylindre, mais cette augmentation est l&eacute;g&egrave;re, nous supposerons donc que cette tension est constante. Les goupilles ne se d&eacute;placeront pas &agrave; moins que vous appliquiez assez de pression pour comprimer le ressort. La friction due &agrave; la tension rotative est proportionnelle &agrave; la mani&egrave;re dont la goupille est bloqu&eacute;e entre le rotor et le stator, qui est, dans ce cas proportionnel &agrave; la rotation. Plus vous imprimez une rotation au barillet,  plus dur sera le d&eacute;placement des goupilles. Pour d&eacute;placer une goupille vous devez donc appliquer une pression sup&eacute;rieure &agrave; la somme de la pression du ressort et des forces de frottement. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image11.gif" WIDTH=328 HEIGHT=495></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 5.3</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Quand la goupille atteint la ligne de c&eacute;sure, la situation change soudainement (Voir le sch&eacute;ma 5.3.). La force de friction chute et le rotor tourne l&eacute;g&egrave;rement (pour &ecirc;tre coinc&eacute; par une autre goupille). Maintenant la seule force en pr&eacute;sence est celle du ressort. Apr&egrave;s que le sommet de la goupille ait travers&eacute; l'intervalle entre le rotor et le stator, une nouvelle force de frottement appara&icirc;t entre la goupille et le stator. Cette force peut &ecirc;tre assez importante, et n&eacute;cessite alors une plus grande pression pour d&eacute;placer la goupille. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image12.gif" WIDTH=380 HEIGHT=535></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 5.4</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Si les goupilles sont pouss&eacute;es plus loin dans le cylindre, la goupille entre &agrave; son tour en friction dans la situation initiale. Voire le sch&eacute;ma 5.4. Ainsi, la tension n&eacute;cessaire pour d&eacute;placer les goupilles de part et d'autre de la ligne de c&eacute;sure est approximativement la m&ecirc;me. Accro&icirc;tre la rotation augmente la tension n&eacute;cessaire. Au niveau de la ligne de c&eacute;sure, la tension augmente &eacute;norm&eacute;ment et brusquement lorsque la goupille entre en contact avec le stator. Cette analyse est r&eacute;sum&eacute;e graphiquement dans le sch&eacute;ma 5.5. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image13.gif" WIDTH=478 HEIGHT=320></P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Sch&eacute;ma 5.5</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">&nbsp;</P></DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="JUSTIFY">Chapitre 6</P>
</B></U></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</FONT><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Bases du "raclage" ou du &quot;&nbsp;ratissage&nbsp;&quot;</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A la maison vous pouvez prendre votre temps pour crocheter une serrure, mais sur le terrain, la vitesse est toujours essentielle. Ce chapitre pr&eacute;sente une technique de crochetage appel&eacute; "raclage" qui permet d'ouvrir rapidement un grand nombre de serrures. (aussi nomm&eacute; &quot;&nbsp;racking&nbsp;&quot; en anglais) </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La premi&egrave;re &eacute;tape de la technique de base (chapitre 4) est de localiser la goupille  qui bloque le plus. Le diagramme des forces en pr&eacute;sence (sch&eacute;ma 5.5) d&eacute;velopp&eacute; dans le chapitre 5 sugg&egrave;re une technique rapide pour d&eacute;terminer quelle goupille positionner en premier. Consid&eacute;rons que toutes les goupilles peuvent &ecirc;tre caract&eacute;ris&eacute;es par le m&ecirc;me diagramme de forces. Cela, suppose qu'elles coincent  toutes en m&ecirc;me temps et qu'elles subissent les m&ecirc;me contraintes. Consid&eacute;rons maintenant l'utilisation d’un crochet sur toutes les goupilles avec une pression suffisante pour vaincre la tension du ressort et les frottements mais insuffisante pour vaincre les contraintes  dues au contact de la goupille contre le cylindre ou stator. Toute pression sup&eacute;rieure &agrave; la partie plate du diagramme des forces et inf&eacute;rieure &agrave; l'extr&eacute;mit&eacute; sup&eacute;rieure fonctionnera. Lorsque le crochet passera sur une goupille, ce dernier se d&eacute;placera jusqu'&agrave; ce qu'il rencontre le cylindre ou stator, mais il n'y entrera pas. Voir le sch&eacute;ma 5.3. La force de contact exerc&eacute;e sur la ligne de c&eacute;sure r&eacute;siste &agrave; la pression du crochet, donc ce dernier passe sur la goupille sans la faire p&eacute;n&eacute;trer dans le cylindre ou stator. Si la tension rotative ad&eacute;quate est appliqu&eacute;e, le rotor ou barillet tournera l&eacute;g&egrave;rement. Lorsque le crochet ou pick  abandonnera la goupille, cette derni&egrave;re retombera &agrave; sa place initiale, mais la goupille passive sera coinc&eacute;e sur le bord du rotor (ou barillet)  et restera au-dessus de la ligne de c&eacute;sure. Voire le sch&eacute;ma 6.1. En th&eacute;orie un seul passage sur les goupilles pourrait entra&icirc;ner l'ouverture de la serrure.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image14.gif" WIDTH=374 HEIGHT=468></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 6.1</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En pratique une ou deux goupilles tout au plus se positionneront lors d’un seul passage du crochet, donc plusieurs passages seront n&eacute;cessaires. En r&eacute;sum&eacute;, vous devez d&eacute;placer rapidement le crochet &quot;&nbsp;racleur&nbsp;&quot; d'avant en arri&egrave;re sur  les goupilles tout en ajustant la force rotative sur le rotor ou barillet. Les exercices du chapitre 8 vous apprendront comment d&eacute;terminer la rotation et la pression ad&eacute;quate. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Vous trouverez que les goupilles d'une serrure ont tendance &agrave; se positionner dans un ordre particulier. Beaucoup de facteurs d&eacute;terminent cet ordre (voire le chapitre 9), mais la cause fondamentale est un non-alignement de l'axe du barillet avec l'axe sur lequel les trous de passage des goupilles ont &eacute;t&eacute;s for&eacute;s. Voire le sch&eacute;ma 6.2. Si l'axe des trous des goupilles est &agrave; l'oblique par rapport &agrave; l'axe central du rotor, les goupilles se positionneront de l'avant vers l'arri&egrave;re si le rotor pivote dans un sens, et de l'arri&egrave;re vers l'avant si ce rotor pivote dans l'autre sens. Beaucoup de serrures ont ce d&eacute;faut.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image15.gif" WIDTH=482 HEIGHT=619></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;&#9;Sch&eacute;ma 6.2</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*note: la diff&eacute;rence de diam&egrave;tre entre les trous de passage et les goupilles donnent des d&eacute;fauts d’isom&eacute;trie, la diff&eacute;rence d’alignement des trous des d&eacute;fauts de parall&eacute;lisme qui se combinent et s’additionnent</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Le raclage est plus rapide parce que vous n'avez pas besoin de positionner les goupilles individuellement. Il vous suffit seulement de trouver le sens de rotation du stator et la pression rotative ad&eacute;quate &agrave; exercer. Le sch&eacute;ma 6,1 r&eacute;sume les &eacute;tapes du crochetage par raclage. Les exercices vous apprendront comment reconna&icirc;tre quand une goupille est positionn&eacute;e et comment appliquer une tension rotative suffisante. Si une serrure ne s'ouvre pas rapidement par &quot;&nbsp;raclage&nbsp;&quot; c'est qu'elle poss&egrave;de probablement une des caract&eacute;ristiques d&eacute;crites dans le chapitre 9 et vous devrez positionner chaque&nbsp;goupille&nbsp; individuellement &agrave; l’aide du palpeur&nbsp;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">1. Ins&eacute;rer le crochet. Sans appliquer de rotation, retirez le crochet afin de d&eacute;terminer  la pression des ressorts de la serrure. 2. Appliquez une l&eacute;g&egrave;re rotation. Ins&eacute;rer le crochet sans toucher les goupilles. Puis retirez le crochet en appliquant une pression sur les goupilles. La pression doit &ecirc;tre l&eacute;g&egrave;rement plus grande que le minimum n&eacute;cessaire pour comprimer les ressorts. 3. Graduellement augmenter la pression rotative &agrave; chaque passage du crochet jusqu'&agrave; ce que les pistons commencent &agrave; se positionner. 4 En gardant l’entra&icirc;neur immobile d&eacute;placez d'avant en arri&egrave;re le crochet sur les goupilles qui n'ont pas &eacute;t&eacute;s positionn&eacute;es. Si des  goupilles ne se positionnent pas correctement, rel&acirc;cher la tension et recommencez en imprimant &agrave; l’entra&icirc;neur une rotation &eacute;quivalente &agrave; celle de l'&eacute;tape pr&eacute;c&eacute;dente&nbsp;: 5. Une fois que la majorit&eacute; des goupilles ont &eacute;t&eacute; positionn&eacute;es, augmenter la rotation et "racler" les &quot;&nbsp;goupilles&nbsp;&quot; avec une pression l&eacute;g&egrave;rement plus grande. Cela placera toutes les goupilles maintenues en position basse (&agrave; cause des bords biseaut&eacute;s du rotor) </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 7&nbsp;:</FONT><FONT FACE="Arial" SIZE=4> </P>
</U><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Techniques avanc&eacute;es de crochetage</P>
</B></FONT><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Les techniques simples de crochetage/tat&acirc;ge constituent un art que tout le monde peut apprendre. Cependant, les techniques avanc&eacute;es n&eacute;cessitent une habilet&eacute;, une sensibilit&eacute; m&eacute;canique, une grande dext&eacute;rit&eacute;, une concentration visuelle, et enfin une pens&eacute;e analytique. Si vous vous entra&icirc;nez fr&eacute;quemment  au crochetage, vous ferez rapidement des progr&egrave;s et pourrez ainsi passer &agrave; cette nouvelle &eacute;tape.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">7,1 habilet&eacute;s m&eacute;caniques</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Apprendre comment manipuler les goupilles est &eacute;tonnamment difficile. Le probl&egrave;me est que l'habilet&eacute; et la finesse que vous avez acquis d&eacute;s votre plus jeune &acirc;ge n&eacute;cessitent une position fixe ou une trajectoire fixe pour vos mains, et ce, quelque soit  la force n&eacute;cessaire. Pour le crochetage vous devez apprendre comment appliquer une tension r&eacute;guli&egrave;re quelle que soit la position de votre main. Lorsque vous retirez le crochet palpeur hors de la serrure vous devez appliquer une pression r&eacute;guli&egrave;re sur les pistons. Le crochet  doit "rebondir" de haut en bas dans la serrure en fonction de la r&eacute;sistance de chaque goupille.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour crocheter une serrure vous devez sentir les effets de vos manipulations. Pour cela, vous devez &ecirc;tre sensible au bruits et aux sensations que produisent le passage du crochet palpeur sur les goupilles. Cette habilet&eacute; m&eacute;canique ne peut s’acqu&eacute;rir qu'avec la pratique. Les exercices vous aideront &agrave; recueillir les informations importantes que vos doigts peuvent d&eacute;celer.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">7,2 Zen ou l'Art du crochetage de serrure</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour exceller en crochetage, vous devez vous entra&icirc;ner &agrave; visualiser et &agrave; reconstruire les ph&eacute;nom&egrave;nes en pr&eacute;sence. L'id&eacute;e est d'utiliser  les informations transmises par tous vos sens pour construire une image mentale de ce qui passe &agrave; l'int&eacute;rieur de la serrure lorsque vous la &quot;&nbsp;t&acirc;ter&nbsp;&quot;. Ainsi, tout vos sens vous permettent de construire une image mentale pour comprendre comment la partie du m&eacute;canisme interne de la serrure r&eacute;pond &agrave; vos manipulations. Une fois que vous savez  comment construire cette image mentale, il vous sera facile d’effectuer les manipulations qui ouvriront la serrure.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Tous vos sens fournissent des informations sur la serrure. Le toucher et le son fournissent le plus  d'informations, mais les autres sens peuvent en r&eacute;v&eacute;ler d’autres aussi importantes. Par exemple, l’odorat peut vous dire si une serrure a &eacute;t&eacute; lubrifi&eacute;e r&eacute;cemment. En tant que d&eacute;butant, vous aurez besoin d'utiliser vos yeux pour coordonner  vos gestes, mais avec le temps il ne sera plus utile de  regarder la serrure. En fait, il est m&ecirc;me recommand&eacute; de faire abstraction de la vue, pour construire une image mentale de la serrure bas&eacute;e sur les informations que vous recevez gr&acirc;ce au toucher et &agrave; l’ou&iuml;e.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">L'objectif de cette technique de visualisation mentale est d'acqu&eacute;rir une plus grande concentration sur la serrure. Il faut essayez d'ignorer toute sensation ou pens&eacute;e &eacute;trang&egrave;re &agrave; la serrure, mais il ne faut surtout pas forcer la concentration.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">7,3 Pens&eacute;e Analytique</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Chaque serrure a ses propres caract&eacute;ristiques qui les rendent plus ou moins facile &agrave; crocheter. Si vous apprenez &agrave; reconna&icirc;tre et &agrave; exploiter les "traits particuliers" de chaque serrure, le crochetage en sera plus rapide. Il s’agit en fait, d’analyser la r&eacute;action que vous obtenez de la serrure que vous crochetez, de diagnostiquer son <BR>
" caract&egrave;re " et d’utiliser alors votre exp&eacute;rience pour d&eacute;terminer l’approche la mieux adapt&eacute;e pour parvenir &agrave; vos fins. Le chapitre 9 traite d'un grand nombre de &quot;&nbsp;caract&eacute;ristiques&nbsp; classiques&nbsp;&quot; &agrave; exploiter en votre faveur.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Beaucoup de gens sous-estiment bien souvent les facult&eacute;s  analytiques &agrave; mettre en œuvre pour le crochetage d’une serrure. Ils pensent que seul le crochet ouvre la serrure. Pour eux l’entra&icirc;neur n’est qu’un outil passif qui fait seulement pivoter le rotor. Permettez-moi de proposer une autre approche de la situation. Le crochet  palpeur pousse  seulement sur les goupilles pour obtenir des informations sur la serrure. Bas&eacute; sur l'analyse de ces informations la tension de l’entra&icirc;neur est ajust&eacute; pour maintenir les goupilles en position align&eacute;e. Et c'est l’entra&icirc;neur qui ouvre la serrure.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Varier la tension de rotation quand le crochet va et vient dans la serrure est une astuce qui en g&eacute;n&eacute;ral peut &ecirc;tre utilis&eacute; pour venir &agrave; bout de bien des probl&egrave;mes en crochetage. Par exemple, si les goupilles du milieu sont  bien positionn&eacute;es, mais que celles du fond ne le sont pas, vous pouvez augmenter la tension de rotation quand le crochet  se d&eacute;place sur les goupilles du milieu. Cela r&eacute;duira les chances de d&eacute;placer les goupilles correctement positionn&eacute;es. Si une goupille ne semble pas se soulever suffisamment quand le crochet palpeur passe dessus, il faudra essayer de r&eacute;duire la tension de rotation au prochain passage.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">L'habilet&eacute; &agrave; doser la force de rotation quand le crochet se d&eacute;place, exige une prudente coordination des deux mains, mais plus vous&nbsp;&quot;&nbsp;visualiserez&nbsp;&quot; le processus de &quot;&nbsp;t&acirc;tage&nbsp;&quot; d'une serrure, plus vous ma&icirc;triserez cette technique importante.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 8</P>
<P ALIGN="JUSTIFY"></P>
</U></FONT><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Exercices</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ce chapitre pr&eacute;sente une s&eacute;rie d'exercices qui vous aideront &agrave; acqu&eacute;rir l'habilet&eacute; n&eacute;cessaire au crochetage. Quelques exercices sont destin&eacute;s &agrave; l'apprentissage de techniques particuli&egrave;res, alors que d'autres vous familiariseront &agrave; la coordination  des mouvements. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quand vous faites ces exercices, concentrez-vous sur la finesse et la pr&eacute;cision de vos gestes, et non sur l'ouverture de la serrure. Si vous vous concentrez sur l'ouverture de la serrure, vous risquez d'&ecirc;tre frustr&eacute; et vous arr&ecirc;terez de progresser. L'objectif de chaque exercice est d'apprendre quelque chose de sp&eacute;cifique sur la serrure que vous manipulez et d'en savoir plus sur vous-m&ecirc;me. Si une serrure finit par s'ouvrir, essayez de vous rem&eacute;morer ce que vous faisiez et ce que vous avez senti juste avant qu'elle ne s'ouvre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ces exercices doivent &ecirc;tre pratiqu&eacute;s par courtes sessions. Apr&egrave;s environ trente minutes de pratique vous trouverez que vos doigts deviennent douloureux et que votre esprit perd sa capacit&eacute;  de concentration. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">8,1 Exercice 1 : Faire "rebondir" le crochet</P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Cet exercice vous permet d'apprendre comment appliquer une pression r&eacute;guli&egrave;re sur les goupilles, avec le crochet palpeur, ind&eacute;pendamment de la mani&egrave;re comment ce dernier se d&eacute;place dans la serrure. En fait, il s'agit d'apprendre comment permettre au crochet de "rebondir" lors de son d&eacute;placement de haut en bas en le retirant du rotor en fonction de la r&eacute;sistance offerte par chaque goupille. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La mani&egrave;re dont vous tenez le crochet aura une incidence sur votre  facilit&eacute; &agrave; appliquer une pression r&eacute;guli&egrave;re. Vous devez le tenir de fa&ccedil;on &agrave; ce que la pression vienne de vos doigts ou de votre poignet. Votre coude et votre &eacute;paule n'ont pas la dext&eacute;rit&eacute; suffisante  pour crocheter une serrure. Quand vous pratiquez le "raclage" sur une serrure remarquez quelles articulations de vos doigts sont immobiles et lesquelles peuvent bouger. Les articulations en mouvement fournissent la pression. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Une mani&egrave;re de tenir un crochet est d'utiliser deux doigts pour fournir un point d'appui pendant qu'un autre doigt manipule le crochet pour fournir une pression. Les doigts que vous utiliserez sont une question de choix personnel. Une autre mani&egrave;re est de tenir le crochet comme un crayon. Avec cette m&eacute;thode votre poignet fournit la pression. Si le poignet fournit la pression, l'&eacute;paule et le coude doivent fournir la force pour d&eacute;placer le crochet d'avant en arri&egrave;re dans la serrure. N'utilisez pas votre poignet &agrave; la fois pour d&eacute;placer le crochet et pour appliquer une pression. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un bon moyen de s'habituer &agrave; la sensation du crochet se d&eacute;pla&ccedil;ant de haut en bas dans la serrure est de s’entra&icirc;ner sur les goupilles d'une serrure d&eacute;j&agrave; ouverte. Les goupilles ne peuvent pas &ecirc;tre pouss&eacute;s vers le bas, donc le crochet doit &quot;&nbsp;s’ajuster&nbsp;&quot; &agrave; la hauteur des goupilles&nbsp;; Essayez de sentir les goupilles cliqueter lorsque le crochet les d&eacute;place. Si vous d&eacute;placez le crochet rapidement vous pouvez entendre les cliquetis. Cette m&ecirc;me sensation vous aidera &agrave; d&eacute;terminer quand une goupille est positionn&eacute;e. Si un goupille semble &ecirc;tre positionn&eacute;e mais ne cliquette pas, c'est qu'elle n'est pas vraiment positionn&eacute;e. Ce type de probl&egrave;me peut &ecirc;tre r&eacute;solu en poussant sur les goupilles pour les positionner plus bas, ou en rel&acirc;chant la rotation de l’entra&icirc;neur et ainsi leur permettre de regagner leur place initiale. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un dernier conseil. Concentrez-vous sur le bout du crochet. Ne pensez pas comment vous d&eacute;placez la poign&eacute;e du crochet palpeur&nbsp;! Pensez uniquement &agrave; la mani&egrave;re dont vous d&eacute;placez le bout du crochet sur les goupilles&nbsp;! </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">8,2 Exercice 2 : Pression de crochetage</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cet exercice vous apprendra l'&eacute;ventail des pressions pouvant &ecirc;tre appliqu&eacute; avec un crochet. Quand vous commencez, appliquez seulement une pression sur les goupilles en retirant le crochet de la serrure. Une fois que vous ma&icirc;triserez cette approche, essayez d'appliquer une pression quand le crochet se d&eacute;place de mani&egrave;re diff&eacute;rente &agrave; l'int&eacute;rieur du rotor. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Avec le c&ocirc;t&eacute; plat de votre crochet, poussez sur la premi&egrave;re goupille de la serrure. N'appliquez aucune force rotative sur le rotor. La pression que vous appliquez doit &ecirc;tre juste suffisante pour comprimer le ressort. Cette force vous donne une id&eacute;e de la pression minimum &agrave; appliquer avec votre crochet. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La pression du ressort augmentera &agrave; mesure que vous poussez sur la goupille. Essayez de sentir cette variation de force de pression. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Voyez maintenant quelle est la sensation lorsque vous poussez sur les autres goupilles en retirant le crochet de la serrure. Recommencez maintenant en pla&ccedil;ant le crochet et l’entra&icirc;neur dans la serrure, mais n'appliquez pas de rotation sur le rotor. En retirant le crochet de la serrure, appliquez assez de pression pour pousser chaque goupille se trouvant sur sa trajectoire. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Les goupilles doivent r&eacute;agir  aux sollicitations du crochet. Notez la sensation et le bruit que font les goupilles au passage du crochet.  Notez la sensation d'&eacute;lasticit&eacute; lorsque le crochet pousse chaque nouvelle goupille.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour vous aider &agrave; vous concentrer sur ces sensations, essayez de compter le nombre de goupilles dans la serrure. Certaines serrures de porte comporte sept goupilles voire plus, mais les cadenas n'en ont habituellement  que quatre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour se faire une id&eacute;e de la pression maximum pouvant &ecirc;tre appliqu&eacute;e, utilisez le c&ocirc;t&eacute; plat de votre crochet pour comprimer au maximum les goupilles dans la serrure. Quelquefois vous aurez besoin d'appliquer cette pression sur une seule goupille. Si vous rencontrez un nouveau mod&egrave;le de serrure, ex&eacute;cutez cette proc&eacute;dure pour d&eacute;terminer la raideur de pression de ses ressorts. </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">8,3 Exercice 3 : La rotation &agrave; appliquer</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cet exercice vous apprendra &agrave; d&eacute;terminer la force de rotation ad&eacute;quate &agrave; appliquer sur le rotor. Il fait &eacute;galement la d&eacute;monstration de l'interaction entre la rotation et la pression d&eacute;crite au chapitre 5. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La force rotative minimum que vous utiliserez doit &ecirc;tre juste suffisante pour vaincre la friction caus&eacute;e par la rotation du rotor ou barillet dans le stator ou cylindre. Utilisez votre entra&icirc;neur pour tourner le rotor jusqu'&agrave; ce qu'il vienne en but&eacute;e. Notez de combien de mm peut pivoter le rotor jusqu’&agrave; ce que les goupilles le bloque. La force n&eacute;cessaire peut &ecirc;tre &eacute;lev&eacute;e si la serrure est gripp&eacute;e (si elle a &eacute;t&eacute; laiss&eacute;e sous la pluie par exemple). La rotation minimum pour les cadenas inclut la tension d'un ressort plac&eacute; entre le rotor et le maillon de liaison interne. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour d&eacute;terminer la force rotative  maximum pouvant &ecirc;tre appliqu&eacute;e, utilisez le c&ocirc;t&eacute; plat du crochet pour enfoncer toutes les goupilles, et essayez d'appliquer une rotation suffisante pour permettre aux goupilles de rester en bas apr&egrave;s que le crochet ait &eacute;t&eacute; enlev&eacute;. Si votre entra&icirc;neur s’est tordu, vous ne pourrez maintenir en position que quelques goupilles. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si vous exercez une rotation trop grande et trop de pression sur les goupilles lors du crochetage vous obtiendrez une situation identique &agrave; la pr&eacute;c&eacute;dente. La goupille se trouve pouss&eacute;e trop loin dans le stator et la force rotative est suffisante pour la maintenir en place et la bloquer. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La force rotative ad&eacute;quate peut &ecirc;tre d&eacute;termin&eacute;e en l’accroissant graduellement tout en pratiquant le "raclage", avec le crochet, sur les goupilles. Quelques goupilles deviendront alors plus dures &agrave; pousser. Graduellement augmenter la  force rotative sur le rotor jusqu'&agrave; ce que quelques  goupilles se positionnent. Ces goupilles perdront alors leur &eacute;lasticit&eacute;. Tout en gardant la m&ecirc;me force de rotation, utilisez pendant un moment le crochet pour actionner les goupilles en les &quot;&nbsp;raclant&nbsp;&quot; &agrave; nouveau pour voir si d'autres se mettent en place. </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" COLOR="#ff0000"><P ALIGN="JUSTIFY">L'erreur la plus fr&eacute;quente des d&eacute;butants est d'exercer une pression rotative trop importante avec l’entra&icirc;neur<B>.</B></FONT><FONT FACE="Arial"> Utilisez cet exercice pour trouver la force de rotation minimum n&eacute;cessaire au crochetage d'une serrure. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">8,4 Exercice 4 : Identifier les goupilles positionn&eacute;es</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lorsque vous crochetez une serrure, essayez d'identifier les goupilles positionn&eacute;es. Vous pouvez d&eacute;terminer qu'une goupille est en place lorsque la pression de son ressort  est plus l&eacute;g&egrave;re. C'est &agrave; dire que la goupille peut &ecirc;tre compress&eacute;e sur une tr&egrave;s courte distance avec une l&eacute;g&egrave;re pression mais elle devient dure &agrave; d&eacute;placer au-del&agrave; (voire le chapitre 6 pour plus d’explications). Quand vous rel&acirc;chez la pression la goupille revient en place l&eacute;g&egrave;rement. De plus les goupilles positionn&eacute;es cliquettent si vous les effleurez  avec le crochet. Essayez d'&eacute;couter ce bruit particulier. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">D&eacute;placez le crochet sur les goupilles et essayez de d&eacute;terminer si ces goupilles positionn&eacute;es le sont sur l'avant ou dans le fond de la serrure (ou les deux). Essayez d'identifier exactement quelles goupilles sont positionn&eacute;es. Souvenez-vous que la premi&egrave;re goupille est celle du devant (c'est &agrave; dire, celle que la clef touche en premier). Le plus important dans la technique de crochetage est la capacit&eacute; de d&eacute;terminer correctement les goupilles positionn&eacute;es. Cet exercice vous permettra d'acqu&eacute;rir cette capacit&eacute;. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Essayez de reproduire cet exercice en faisant pivoter le rotor dans l'autre sens. Si les goupilles du devant se positionnent quand le rotor est tourn&eacute; dans un sens, les goupilles du fond se positionneront quand le rotor sera tourn&eacute; dans l'autre sens, (Voire le sch&eacute;ma 6,2 pour comprendre ce fonctionnement m&eacute;canique). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Pour v&eacute;rifier combien de goupilles sont positionn&eacute;es, il suffit de rel&acirc;cher la rotation et de compter les d&eacute;clics produits par les goupilles revenant &agrave; leur place initiale. Essayez de remarquer la diff&eacute;rence entre le bruit produit par une seule goupille et celui produit par deux goupilles &agrave; la fois. Une goupille mal positionn&eacute;e fera aussi un bruit sec significatif. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Essayez cet exercice en variant la rotation du rotor et la pression exerc&eacute;e sur les goupilles. Vous devez remarquer qu'une rotation importante exige une plus grande pression pour positionner correctement  l'ensemble des goupilles. Si la pression est trop importante, les goupilles seront bloqu&eacute;s dans le stator et y resteront. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*Note de la traduction&nbsp;: en cours d’exercice de &quot;&nbsp;t&acirc;tage&nbsp;&quot; &agrave; la maison, vous pouvez secouer le cylindre pr&egrave;s de votre oreille afin de d&eacute;terminer, au bruit, combien de goupilles sont effectivement positionn&eacute;es, ce qui n’est, bien &eacute;videmment, pas possible &quot;&nbsp;sur le terrain&nbsp;&quot; ou en situation r&eacute;elle.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">8,5 Exercice 5 : Projection</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Lorsque vous faites ces exercices essayez de vous repr&eacute;senter mentalement ce qui se produit dans la serrure. Visualiser l'int&eacute;gralit&eacute; du processus m&eacute;canique n'est pas obligatoire, il suffit uniquement de pouvoir se repr&eacute;senter quelles goupilles sont positionn&eacute;es et quelle est la r&eacute;sistance de chacune d’entre elle. Une mani&egrave;re de se construire une image mentale est d'essayer de se souvenir de chaque sensation, et de ce que l'on croyait obtenir,  juste avant qu'une serrure ne s'ouvre. Quand une serrure s'ouvre, ne pensez pas "c'est fini !", mais pensez "que s'est il pass&eacute; ?" </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Cet exercice n&eacute;cessite une serrure que vous pouvez facilement crocheter. Cela vous aidera &agrave; affiner votre  capacit&eacute; de visualisation, ce qui est n&eacute;cessaire &agrave; la ma&icirc;trise du t&acirc;tage. Crocheter une serrure, et essayez de vous souvenir des sensations ressenties lors du processus. R&eacute;p&eacute;tez dans votre esprit chacune de ces sensations et cherchez &agrave; quoi elles correspondent. Fondamentalement vous devez "r&eacute;aliser un film" en enregistrant l'int&eacute;gralit&eacute; du processus de crochetage. Visualisez chacun de vos mouvements en recr&eacute;ant une pression  et une force de rotation ad&eacute;quates, ainsi que la r&eacute;sistance rencontr&eacute;e par le crochet. Maintenant crochetez &agrave; nouveau la serrure en essayant de reproduire ces m&ecirc;mes mouvements. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">En r&eacute;p&eacute;tant cet exercice, vous apprenez &agrave; effectuer des gestes pr&eacute;cis et &agrave; interpr&eacute;ter chacune de vos sensations. La r&eacute;p&eacute;tition de cet exercice vous permettra de visualiser avec plus de pr&eacute;cision comment fonctionne une serrure et de reconna&icirc;tre les &eacute;tapes majeures du crochetage. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Chapitre 9</P>
</B></U></FONT><FONT SIZE=2>
</FONT><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Reconna&icirc;tre et exploiter les faiblesses des serrures</P>
</B></FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Chaque serrure a un large &eacute;ventail de particularit&eacute;s m&eacute;caniques et de d&eacute;fauts qui facilitent ou rendent plus difficile leur crochetage. Si une serrure ne r&eacute;agit pas au &quot;&nbsp;raclage&nbsp;&quot;, c’est qu’elle poss&egrave;de probablement une des caract&eacute;ristiques qui seront d&eacute;taill&eacute;es dans ce chapitre. Pour ouvrir une serrure, vous devez diagnostiquer ses caract&eacute;ristiques propres et appliquer la technique ad&eacute;quate. Les exercices vous aideront &agrave; d&eacute;velopper la dext&eacute;rit&eacute; n&eacute;cessaire pour reconna&icirc;tre et exploiter les diff&eacute;rentes caract&eacute;ristiques.</P>
<P ALIGN="JUSTIFY"> </P>
<B><P ALIGN="JUSTIFY">9,1 De quel c&ocirc;t&eacute; tourner&nbsp;?</P>
</B><P ALIGN="JUSTIFY">Il peut &ecirc;tre tr&egrave;s frustrant de passer un temps incalculable &agrave; crocheter une serrure et de d&eacute;couvrir que vous avez fait pivoter le rotor dans le mauvais sens. Si c’est le cas ce dernier tournera librement jusqu'&agrave; ce qu’il rencontre une but&eacute;e, ou jusqu'&agrave; ce qu'il pivote de 180 degr&eacute;s et que les goupilles passives p&eacute;n&egrave;trent &agrave; nouveau dans le rotor (voire le paragraphe 9.11). Le paragraphe 9,11 explique aussi comment faire pivoter le rotor de plus de 180 degr&eacute;s si n&eacute;cessaire pour r&eacute;tracter compl&egrave;tement le p&ecirc;ne. Quand le rotor pivote dans la bonne direction, vous devez sentir une r&eacute;sistance plus importante au moment o&ugrave; la came du rotor rencontre le ressort du p&ecirc;ne. </P>
<P ALIGN="JUSTIFY">La direction dans laquelle il faut tourner le rotor d&eacute;pend du m&eacute;canisme du p&ecirc;ne, pas de la serrure, mais il y a quelques r&egrave;gles g&eacute;n&eacute;rales &agrave; conna&icirc;tre. La plupart des cadenas  bon march&eacute;s s'ouvriront quel que soit le sens dans lequel le rotor est actionn&eacute;, ainsi vous pouvez choisir le sens qui vous semble le plus confortable pour l'utilisation de l’entra&icirc;neur. Certains cadenas quant &agrave; eux ne peuvent &ecirc;tre ouverts  que si le rotor est actionn&eacute; dans le sens des aiguilles d'une montre. Les serrures &agrave; &quot;&nbsp;double cylindre&nbsp;&quot;   s'ouvrent g&eacute;n&eacute;ralement par la rotation du fond de la serrure (c'est-&agrave;-dire, du c&ocirc;t&eacute; plat de la clef plus ou moins loin du chambranle de la porte) Les serrures &agrave; barillet simple suivent &eacute;galement cette r&egrave;gle. Voire le sch&eacute;ma 9.1.Les serrures int&eacute;gr&eacute;es dans les poign&eacute;es de porte s'ouvrent habituellement dans le sens des aiguilles d'une montre. Les serrures de bureau et des classeurs s'ouvrent &eacute;galement  dans le sens des aiguilles d'une montre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image16.gif" WIDTH=473 HEIGHT=376><IMG SRC="Image17.gif" WIDTH=473 HEIGHT=376></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 9.1</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Quand vous rencontrez un nouveau mod&egrave;le ou un type de m&eacute;canisme diff&eacute;rent, essayer d'actionner le rotor dans les deux directions. Dans la bonne direction le rotor sera arr&ecirc;t&eacute; par les goupilles, ce blocage semblera  souple si vous exercez une rotation trop importante. Dans la mauvaise direction le rotor sera arr&ecirc;t&eacute; par une petite patte interne de m&eacute;tal, cela se traduira par un blocage ferme. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Sch&eacute;ma 9.1 : Sens dans lequel faire pivoter le barillet  </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,2 Jusqu’o&ugrave; tourner ?</P>
</B><P ALIGN="JUSTIFY">La question compl&eacute;mentaire de&nbsp;: "Dans quel sens faire tourner une serrure&nbsp;?" est "Jusqu’o&ugrave; la faire pivoter ?". Les serrures de bureau et classeurs s'ouvrent g&eacute;n&eacute;ralement avec moins d'un demi tour (90 degr&eacute;s). Lors de l'ouverture de la serrure d'un bureau essayez d'&eacute;viter que le rotor reste en position ouverte. Les serrures int&eacute;gr&eacute;es aux poign&eacute;es de porte s'ouvrent aussi souvent en un demi tour. Les serrures non int&eacute;gr&eacute;es &agrave; la poign&eacute;e n&eacute;cessitent quant &agrave; elles un tour complet. Les serrures de verrou, quand &agrave; elles, peuvent n&eacute;cessiter un tour complet voire souvent deux. </P>
<P ALIGN="JUSTIFY">Faire pivoter une serrure de plus de 180 degr&eacute;s est difficile parce que les goupilles p&eacute;n&egrave;trent &agrave; nouveau dans le stator de la serrure qui est alors rebloqu&eacute;. Voire le paragraphe 9.11. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image18.gif" WIDTH=421 HEIGHT=456></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P><DIR>
<DIR>
<DIR>
<DIR>

<P ALIGN="JUSTIFY">&#9;Sch&eacute;ma 9.2</P>
<P ALIGN="JUSTIFY"></P></DIR>
</DIR>
</DIR>
</DIR>

<B><P ALIGN="JUSTIFY">9,3 La gravit&eacute;</P>
</B><P ALIGN="JUSTIFY">Crocheter une serrure dont les ressorts se trouvent sur le dessus est diff&eacute;rent que lorsque les ressorts se trouvent vers le bas. Il est &eacute;vident que les deux cas doivent &ecirc;tre trait&eacute;s s&eacute;par&eacute;ment. Le cot&eacute; positif d'une serrure dont les ressorts sont en bas est que la gravit&eacute; maintient les goupilles positionn&eacute;es en position basse. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">(*note&nbsp;: cas des serrures dites &agrave; profil europ&eacute;en)  </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Avec les goupilles positionn&eacute;es hors de la zone de manipulation, il est plus facile de trouver les goupilles restant &agrave; positionner. Il est aussi plus ais&eacute; de tester le l&eacute;ger jeu des goupilles correctement positionn&eacute;es. Quand les ressorts sont sur le dessus, la gravit&eacute; laissera redescendre les goupilles positionn&eacute;es vers le bas apr&egrave;s qu’elles aient &eacute;t&eacute; bloqu&eacute;es sur la ligne de c&eacute;sure. Dans ce cas vous pouvez identifier les goupilles positionn&eacute;es en remarquant les plus faciles &agrave; soulever et celles dont on ne sent pas l'&eacute;lasticit&eacute;. Celles positionn&eacute;es cliquettent lorsque vous passez le crochet dessus parce qu'elles ne sont pas comprim&eacute;es mais bloqu&eacute;es sur la ligne de c&eacute;sure.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image19.gif" WIDTH=447 HEIGHT=731></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 9.3</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">9,4 Les goupilles non positionn&eacute;es</P>
</B><P ALIGN="JUSTIFY">Si vous pratiquez le &quot;&nbsp;raclage&nbsp;&quot;  sur une serrure et que les goupilles ne se positionnent pas m&ecirc;me quand vous variez la rotation, c'est certainement que quelques goupilles son faussement positionn&eacute;es et qu'elles emp&ecirc;chent le reste de celles-ci de se positionner correctement. Imaginez une serrure dont les goupilles n&eacute;cessitent un crochetage de l'avant vers l'arri&egrave;re. . Si la derni&egrave;re goupille du fond est faussement positionn&eacute;e en haut ou en bas (voire le sch&eacute;ma 9.2), le rotor ne peut pas tourner suffisamment pour permettre aux autres de se bloquer en position. Il est difficile de sentir qu'une goupille du fond est faussement positionn&eacute;e parce que la tension de celles  du devant rend plus difficile la d&eacute;tection du l&eacute;ger jeu d'une goupille du fond correctement positionn&eacute;e. Le sympt&ocirc;me principal de cette situation est que les autres goupilles ne se positionneront pas &agrave; moins qu'une tr&egrave;s forte rotation ne soit appliqu&eacute;e. </P>
<P ALIGN="JUSTIFY">Quand vous rencontrez cette situation, rel&acirc;chez la rotation et recommencez en vous concentrant sur les goupilles du fond. Essayez avec une l&eacute;g&egrave;re rotation et une pression mod&eacute;r&eacute;e ou une forte rotation et une pression importante. Essayez de sentir le d&eacute;clic qui se produit quand une goupille atteint la ligne de c&eacute;sure g&eacute;n&eacute;rale et que le rotor tourne l&eacute;g&egrave;rement. Le d&eacute;clic sera plus facile &agrave; sentir si vous utilisez un entra&icirc;neur rigide. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image20.gif" WIDTH=590 HEIGHT=460></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 9.4</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,5 D&eacute;formations dues &agrave; l'&eacute;lasticit&eacute;</P>
</B><P ALIGN="JUSTIFY">Les ph&eacute;nom&egrave;nes de jeu int&eacute;ressant le crochetage se produisent sur des distances de l'ordre du centi&egrave;me de millim&egrave;tre. Avec de telles contraintes les m&eacute;taux deviennent &eacute;lastiques. Une pression tr&egrave;s l&eacute;g&egrave;re suffit &agrave; d&eacute;vier une pi&egrave;ce de m&eacute;tal sur ces distances, et quand la force est supprim&eacute;e, le m&eacute;tal reviendra &agrave; sa positon initiale. </P>
<P ALIGN="JUSTIFY">De telles d&eacute;formations peuvent &ecirc;tre utilis&eacute;es &agrave; votre avantage si vous voulez forcer plusieurs goupilles &agrave; la fois. Par exemple, crocheter une serrure dont les goupilles n&eacute;cessitent d'&ecirc;tre mis en place  de l'avant vers l'arri&egrave;re, est un processus lent parce que les goupilles se positionnent chacune &agrave; tour de r&ocirc;le. C'est particuli&egrave;rement vrai si vous appliquez seulement  une pression en retirant le crochet de la serrure. Chaque passage du crochet positionnera seulement la goupille de devant qui bloque. Beaucoup de passages r&eacute;p&eacute;t&eacute;es seront alors n&eacute;cessaire pour que toutes les goupilles soient correctement positionn&eacute;es. Si la priorit&eacute; de sens n'est pas tr&egrave;s importante (c'est-&agrave;-dire  que l'axe des trous du rotor est l&eacute;g&egrave;rement a l'oblique par rapport &agrave; la ligne centrale du barillet), alors vous pouvez positionner certaines goupilles suppl&eacute;mentaires  en appliquant une rotation  plus importante. D’un point de vue purement m&eacute;canique, la rotation exerce une torsion sur le rotor qui a pour cons&eacute;quences de plus d&eacute;vier l'avant du rotor que son arri&egrave;re. Avec une l&eacute;g&egrave;re rotation l'arri&egrave;re du rotor reste &agrave; sa place initiale, mais avec rotation moyenne ou plus forte, les goupilles du devant bloquent suffisamment pour permettre &agrave; l'arri&egrave;re du rotor de tourner et donc aux goupilles du fond de positionner &agrave; leur tour. Ainsi avec une rotation plus importante un seul passage du crochet peut en positionner plusieurs &agrave; la fois, et la serrure peut &ecirc;tre ouverte rapidement. Cependant, une rotation par trop importante entra&icirc;ne &eacute;galement des probl&egrave;mes particuliers de blocage. </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image21.gif" WIDTH=588 HEIGHT=183></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 9.5</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Quand la rotation est importante, les goupilles du devant et les trous du rotor peuvent &ecirc;tre d&eacute;form&eacute;s jusqu'&agrave; ce que les goupilles ne puissent plus se positionner correctement. En particulier, la premi&egrave;re a tendance &agrave; mal se positionner vers le bas. Le sch&eacute;ma 9,2 montre comment une rotation excessive peut d&eacute;former la base de la goupille passive  et ainsi emp&ecirc;cher l’emp&ecirc;cher d'atteindre la ligne de c&eacute;sure. Cette situation peut &ecirc;tre reconnue par le manque de jeu de la premi&egrave;re goupille. Un goupille correctement positionn&eacute;e semble &eacute;lastique si elle est comprim&eacute;e (t&acirc;t&eacute;e) l&eacute;g&egrave;rement. Une goupille faussement positionn&eacute;e  ne poss&egrave;de pas cette &eacute;lasticit&eacute;. La solution est d'appuyer fortement sur la premi&egrave;re goupille. Vous devrez alors r&eacute;duire l&eacute;g&egrave;rement la rotation, mais si vous la r&eacute;duisez trop, les autres risquent de se d&eacute;loger lorsque la premi&egrave;re goupille est rel&acirc;ch&eacute;e. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Il est aussi possible d&eacute;former le sommet de la goupille. Le goupille est pinc&eacute;e entre le rotor et le stator et reste bloqu&eacute;e. Quand cela arrive, elle est consid&eacute;r&eacute;e comme &eacute;tant faussement positionn&eacute;e vers le haut. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,6 Rotor ou barillet ayant du jeu</P>
</B><P ALIGN="JUSTIFY">Le rotor ou barillet est maintenu dans le stator ou cylindre par un usinage plus large sur le devant (en chapeau) et par une came ou un &quot;&nbsp;clips&nbsp;&quot; &agrave; l'arri&egrave;re, plus large que le trou for&eacute; dans le stator Si la came (ou le clips) n'est pas ajust&eacute;e correctement, le rotor peut avoir un l&eacute;ger jeu et ainsi bouger l&eacute;g&egrave;rement d'avant en arri&egrave;re dans le  stator. En utilisant le crochet de l’arri&egrave;re vers l'avant, ce mouvement fera avancer le rotor, et si vous appliquez une certaine pression en introduisant le crochet, le rotor sera pouss&eacute; vers l'arri&egrave;re. </P>
<P ALIGN="JUSTIFY">Le probl&egrave;me avec un rotor ayant du jeu est que les goupilles passives se positionnent sur l'arri&egrave;re des trous de passage des goupilles du rotor plut&ocirc;t que sur les c&ocirc;t&eacute;s de ces trous. Quand vous poussez le rotor, les goupilles vont se d&eacute;loger. Vous pouvez utiliser ce d&eacute;faut &agrave; votre avantage en appliquant simplement une pression lors du passage du crochet de l’arri&egrave;re vers l'avant ou de l’avant vers l’arri&egrave;re. Ou bien, vous pouvez utiliser votre doigt ou le l’entra&icirc;neur pour emp&ecirc;cher le rotor d'avancer. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> <IMG SRC="Image22.gif" WIDTH=589 HEIGHT=181></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;&#9;Sch&eacute;ma 9.6</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">sch&eacute;ma 9.2:La goupille est faussement positionn&eacute;e &agrave; cause des d&eacute;formations dues &agrave; l'&eacute;lasticit&eacute; du mat&eacute;riau.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,7 Diam&egrave;tre de la goupille</P>
</B><P ALIGN="JUSTIFY">Quand la paire de goupilles dans une colonne particuli&egrave;re (un piston) a des diam&egrave;tres diff&eacute;rents, ce &quot;&nbsp;piston&nbsp;&quot;  r&eacute;agira de mani&egrave;re &eacute;trange &agrave; la pression du crochet. </P>
<P ALIGN="JUSTIFY">La moiti&eacute; sup&eacute;rieure du sch&eacute;ma  9,3 pr&eacute;sente un &quot;&nbsp;piston&nbsp;&quot; dont la passive  a un diam&egrave;tre plus grand que l’active . Lorsque les goupilles sont soulev&eacute;es, la pression de crochetage rencontre une r&eacute;sistance caus&eacute;e par le frottement et la tension du ressort. Une fois que goupille  atteint la ligne de c&eacute;sure, le rotor tourne (jusqu’&agrave; ce qu'une autre goupille se bloque &agrave; son tour).La seule chose qui r&eacute;siste &agrave; ce mouvement est la tension du ressort. Si la goupille est assez petite et que le rotor n'a pas beaucoup tourn&eacute;, la goupille  peut entrer dans le stator sans entrer en contact avec les bords du stator. Un autre goupille peut bloquer &agrave; son tour, cette fois encore la seule r&eacute;sistance sera la tension du ressort. Ce rapport est repr&eacute;sent&eacute; dans la moiti&eacute; inf&eacute;rieure du sch&eacute;ma. De prime abord, les goupilles semblent normales, puis la serrure cliquette et la goupille devient &eacute;lastique. La goupille au diam&egrave;tre plus petit peut &ecirc;tre pouss&eacute;e jusqu'au bout dans le stator sans perdre de son &eacute;lasticit&eacute;, mais quand la pression de crochetage est rel&acirc;ch&eacute;e, la goupille active  reviendra &agrave; sa place initiale, la passive "plus large" accrochant le bord du trou de passage dans le rotor. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image23.gif" WIDTH=417 HEIGHT=639></FONT><FONT FACE="Arial">&#9;&#9;&#9;&#9;&#9;Sch&eacute;ma 9.7</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Le probl&egrave;me avec une passive large est que l’active &agrave; tendance &agrave; se  bloquer dans le stator quand d'autres sont positionn&eacute;es. Imaginez qu'une goupille voisine soit positionn&eacute;e et que le rotor tourne assez pour en coincer une plus mince. Si le crochet appuyait sur la goupille d’un diam&egrave;tre plus petit en m&ecirc;me temps que sur une positionn&eacute;e, alors la goupille &quot;&nbsp;plus mince&nbsp;&quot; se trouverait dans le stator et emp&ecirc;cherait le rotor de tourner. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">L’&eacute;tude du comportement d'une goupille large est laiss&eacute;e &agrave; la charge du lecteur, dans un but didactique. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,8 Trous biseaut&eacute;s et goupilles arrondies</P>
</B><P ALIGN="JUSTIFY">Quelques fabricants de serrures (par exemple, Yale) biseautent les bords des trous  de passage du rotor et/ou arrondissent l'extr&eacute;mit&eacute; des goupilles. Cela a tendance &agrave; r&eacute;duire l'usure de la serrure et peut &eacute;galement entraver son crochetage. Vous pouvez reconna&icirc;tre une serrure de ce type par le jeu important des goupilles positionn&eacute;es. Voire le sch&eacute;ma 9.4. Cela est d&ucirc; au fait suivant, les trous de passage du rotor sont biseaut&eacute;s et/ou les goupilles sont arrondies, la distance entre la hauteur au bord du trou du rotor et la hauteur n&eacute;cessaire pour que goupille rencontre le stator est plus importante (quelquefois jusqu’&agrave; pr&egrave;s de 1,5mm&nbsp;!). Lorsque la goupille se d&eacute;place entre ces deux hauteurs, la seule r&eacute;sistance au mouvement sera la tension du ressort. Il n'y aura pas de friction. Cela correspond &agrave; la partie d&eacute;croissante du trac&eacute; des forces pr&eacute;sent&eacute; dans le sch&eacute;ma 5.5. </P>
<P ALIGN="JUSTIFY">Une serrure dont le rotor  a des trous de passage biseaut&eacute;s exige de la &quot;&nbsp;racler&nbsp;&quot; plus longuement, qu'une serrure  qui n’est pas &eacute;quip&eacute;e de ce dispositif,  parce que la passive se positionne sur le bord biseaut&eacute; du trou de passage au lieu de se placer sur le sommet du rotor. Le rotor ne tournera alors pas si une des passives est accroch&eacute;e par un bord biseaut&eacute; du trou de passage. Cette goupille doit subir un nouveau &quot;&nbsp;raclage&nbsp;&quot; pour pousser la passive vers le haut et pouvoir enfin passer ce biseau. La passive  de gauche dans le sch&eacute;ma 9.6a est positionn&eacute;e. La passive repose sur le bord biseaut&eacute; du trou de passage, et la plaque du fond se d&eacute;place assez pour permettre &agrave; la passive de droite de coincer. Le sch&eacute;ma 9.6b pr&eacute;sente ce qui se passe lorsque la passive de droite est positionn&eacute;e. La plaque du bas glisse plus loin &agrave; droite et d&eacute;s lors la passive de gauche est pinc&eacute;e entre la partie du biseau et la plaque du haut. Elle est bloqu&eacute;e par le biseau. Pour ouvrir la serrure, la passive de gauche doit &ecirc;tre pouss&eacute;e au-dessus du biseau. Une fois que cette passive est lib&eacute;r&eacute;e, la plaque du bas peut glisser et la passive de droite peut &agrave; son tour &ecirc;tre coinc&eacute;e contre son  trou biseaut&eacute; de passage sur le rotor. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image24.gif" WIDTH=331 HEIGHT=457></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 9.8</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si vous rencontrez une serrure dont le rotor est &eacute;quip&eacute;  de trous de passage de goupilles biseaut&eacute;s, et que tous les goupilles semblent positionn&eacute;es mais que la serrure ne s'ouvre pas, vous devez r&eacute;duire la rotation et continuez le &quot;&nbsp;raclage&nbsp;&quot;. En r&eacute;duisant la rotation, il sera plus facile de pousser les passives au-del&agrave; des biseaux des trous de passage. Si des goupilles se d&eacute;logent quand vous r&eacute;duisez la rotation, essayez en augmentant de fa&ccedil;on croissante la rotation et la pression de crochetage. Le probl&egrave;me est qu’en accroissant la (les) force(s) vous pouvez bloquer quelques goupilles dans le cylindre. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">9,9 Goupille en  "champignon" ou goupille &quot;&nbsp;anti-t&acirc;tage&nbsp;&quot;</P>
</B><P ALIGN="JUSTIFY">Une &quot;&nbsp;truc&nbsp;&quot; g&eacute;n&eacute;ralement utilis&eacute;e par les fabricants de serrures pour rendre plus difficile le crochetage est de modifier la forme des passives. Les formes les plus communes sont le &quot;&nbsp;champignon&nbsp;&quot;, la &quot;&nbsp;bobine&nbsp;&quot; , &quot;&nbsp;en dents de scie&nbsp;&quot;, etc. …&nbsp; <BR>
voir le sch&eacute;ma 9.7.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> (*note&nbsp;: aussi, le &quot;&nbsp;diabolo&nbsp;&quot;, &quot;  les  goupilles form&eacute;es &quot;&nbsp;de disques en pile&nbsp;&quot;, etc.)</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image25.gif" WIDTH=398 HEIGHT=480></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;sch&eacute;ma 9.9</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Le but de ces formes est de causer le faux positionnement des goupilles. Ces passives de formes diverses n’emp&ecirc;che pas une technique appel&eacute;e crochetage par vibrations (voire le paragraphe 9.12), mais elles compliquent l&eacute;g&egrave;rement le &quot;&nbsp;raclage&nbsp;&quot; et le crochetage goupille par goupille  (voire le chapitre 4). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Si vous crochetez une serrure et le que rotor s'arr&ecirc;te de tourner apr&egrave;s avoir pivot&eacute; de quelques degr&eacute;s et qu'aucune goupille ne peut &ecirc;tre manipul&eacute;e, vous avez une serrure &eacute;quip&eacute;e de &quot;&nbsp;goupilles anti-t&acirc;tage&nbsp;&quot;. En pratique, la l&egrave;vre de la passive a accroch&eacute; la ligne de c&eacute;sure. Voire le bas du sch&eacute;ma 9.7.On trouve des goupilles de forme champignon et les formes bobine parfois dans les serrures RUSSWIN, ainsi que dans des serrures &agrave; plusieurs &quot;&nbsp;variations&nbsp;&quot; (tailles de la clef) qui permettent l'utilisation de clefs "passe partout".</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Vous pouvez identifier la places des goupilles en champignon en appliquant une l&eacute;g&egrave;re rotation et en  comprimant chaque goupille. Celles dot&eacute;es de &quot;&nbsp;champignon&nbsp;&quot; auront tendance &agrave; maintenir le rotor en position verrouill&eacute;. En poussant le plat du sommet  d'une active contre le fond inclin&eacute; d'une goupille passive en champignon, cela la &quot;&nbsp;raidit&nbsp;&quot; et emp&ecirc;che ainsi le rotor de tourner. Vous pouvez utiliser ce mouvement pour identifier les colonnes de goupilles &eacute;quip&eacute;es de &quot;&nbsp;champignons&quot;. Poussez ces goupilles jusqu'&agrave; ligne de c&eacute;sure,  m&ecirc;me si vous en d&eacute;logez, lors de cette manipulation, quelques-unes des autres, elles seront plus faciles &agrave; remettre en position que celles munies de &quot;&nbsp;champignon&nbsp;&quot;. Ainsi toutes les goupilles seront alors correctement  positionn&eacute;es sur la ligne de c&eacute;sure. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Une fa&ccedil;on d'identifier toutes les &quot;&nbsp;goupilles champignon&nbsp;&quot; d'une serrure est d'utiliser le c&ocirc;t&eacute; plat de votre crochet pour pousser tous les goupilles &agrave; mi-course. Cette proc&eacute;dure doit placer la plupart des goupilles passives dans leur position "arm&eacute;e" (&nbsp;de blocage)  et vous permettre de les identifier. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Pour crocheter une serrure &agrave; goupilles passives anti-t&acirc;tage, utilisez une l&eacute;g&egrave;re rotation et une forte pression. Toutefois il vous faudra &eacute;viter de trop comprimer la goupille dans le cylindre. En fait une autre mani&egrave;re de crocheter ce type de  serrures est d'utiliser le c&ocirc;t&eacute; plat de votre crochet pour comprimer toutes les goupilles, et d'appliquer une forte rotation pour les maintenir en place. Utilisez alors le &quot;&nbsp;raclage&nbsp;&quot;pour faire vibrer chaque&nbsp;goupille tout en r&eacute;duisant progressivement la rotation (r&eacute;duire la rotation diminue le frottement exerc&eacute; sur les goupilles). La vibration et la tension des ressorts peuvent permettre aux goupilles de glisser jusqu'&agrave; la ligne de c&eacute;sure. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">L'astuce pour crocheter les serrures &agrave; goupilles passives anti-t&acirc;tage est de reconna&icirc;tre les goupilles mal positionn&eacute;es. Une &quot;&nbsp;goupille champignon&nbsp;&quot; positionn&eacute;e sur sa &quot;&nbsp;l&egrave;vre&nbsp;&quot; ou son &quot;&nbsp;rebord anti-t&acirc;tage&nbsp;&quot; n'aura pas l'&eacute;lasticit&eacute; d'une autre goupille correctement positionn&eacute;e. La pratique vous permettra de reconna&icirc;tre la diff&eacute;rence. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,10 Les clefs "passe partout"</P>
</B><P ALIGN="JUSTIFY">Beaucoup d'applications  n&eacute;cessitent des clefs n'ouvrant qu’une seule serrure ainsi que des clefs permettant d'ouvrir un ensemble de serrures. Les clefs qui ouvrent de multiples serrures sont appel&eacute;es les clefs "passe partout" ou clefs &quot;&nbsp;ma&icirc;tresse&nbsp;&quot;. Pour leur permettre d'ouvrir la m&ecirc;me serrure, un serrurier ajoute &agrave; quelques goupilles un petit segment de plus que l'on appelle un s&eacute;parateur. Voire le sch&eacute;ma 9.8. L'effet du s&eacute;parateur est de cr&eacute;er deux intervalles (c&eacute;sures) dans la m&ecirc;me colonne de goupilles (&quot;&nbsp;un piston&nbsp;&quot;) pouvant &ecirc;tre align&eacute;es avec la ligne de c&eacute;sure g&eacute;n&eacute;rale. Habituellement la clef &quot;&nbsp;&quot;&nbsp;partielle&nbsp;&quot; permet d’aligner le sommet du s&eacute;parateur avec la ligne de c&eacute;sure, et la &quot;&nbsp;clef passe-partout&nbsp;&quot; quant &agrave; elle entra&icirc;ne l’alignement de la partie inf&eacute;rieure du s&eacute;parateur avec la ligne de c&eacute;sure (le but est d’emp&ecirc;cher toute modification d'une &quot;&nbsp;clef partielle&nbsp;&quot; pour obtenir une &quot;&nbsp;clef passe partout&nbsp;&quot;). Quel que soit le cas, le barillet ou rotor peut alors pivoter. </P>
<P ALIGN="JUSTIFY">En g&eacute;n&eacute;ral, les s&eacute;parateurs rendent les serrures plus faciles &agrave; crocheter. Ils augmentent le nombre de possibilit&eacute;s de mettre &quot;&nbsp;au passage&nbsp;&quot; (de positionner) chaque goupille, et multiplient les probabilit&eacute;s d’ouverture de la serrure en positionnant tous les goupilles &agrave; la bonne hauteur. Dans la plupart des cas seulement deux ou trois colonnes de goupilles seront &eacute;quip&eacute;es de s&eacute;parateurs. Il est ais&eacute; de les identifier ,gr&acirc;ce &agrave; deux d&eacute;clics perceptibles quand on comprime la goupille. Si le s&eacute;parateur a un diam&egrave;tre plus petit que ceux de la passive  et de l’active,  une partie de l’active vous semblera tr&egrave;s &eacute;lastique. C’est d&ucirc; au fait que le s&eacute;parateur ne coincera pas en traversant la ligne de c&eacute;sure. Il est habituel que le s&eacute;parateur soit plus grand que la passive. Une augmentation des frottements, lorsque le s&eacute;parateur traverse la ligne de c&eacute;sure, vous permet de vous en apercevoir. Du fait que le s&eacute;parateur soit plus grand que la passive, il accrochera plus facilement le rotor. Si vous poussez le s&eacute;parateur plus loin dans le cylindre, vous sentirez un fort d&eacute;clic quand la partie inf&eacute;rieure du s&eacute;parateur franchira la ligne de c&eacute;sure. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Un s&eacute;parateur trop mince peut causer de s&eacute;rieux probl&egrave;mes. Si vous appliquez une forte rotation et que le rotor est &eacute;quip&eacute; de trous de passage biseaut&eacute;s, le s&eacute;parateur peut se tordre et se coincer sur la ligne de c&eacute;sure. Il est aussi possible que le s&eacute;parateur tombe dans le trou de passage de la goupille de la serrure si le barillet a pivot&eacute; de 180 degr&eacute;s. (Pour r&eacute;soudre ce probl&egrave;me se r&eacute;f&eacute;rer au paragraphe 9,11). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> <IMG SRC="Image26.gif" WIDTH=515 HEIGHT=623></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma 9.10</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sch&eacute;ma 9.7 : Champignon, bobine, et goupilles en dents de scie </P>
<P ALIGN="JUSTIFY">Sch&eacute;ma 9.8 : S&eacute;parateur pour clef "passe partout"</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,11 Une passive ou un s&eacute;parateur entre dans le trou de passage</P>
</B><P ALIGN="JUSTIFY">Le sch&eacute;ma 9,9 montre comment un s&eacute;parateur ou une passive peuvent entrer dans le trou de passage de la colonne de goupilles quand le rotor pivote de 180 degr&eacute;s. Vous pouvez emp&ecirc;cher cela en pla&ccedil;ant le c&ocirc;t&eacute; plat de votre crochet dans le fond du passage de la cl&eacute; de la serrure avant de faire trop pivoter le rotor. Si un s&eacute;parateur ou une passive  entre dans le trou de passage du rotor et vous emp&ecirc;che de faire pivoter ce dernier, utilisez le c&ocirc;t&eacute; plat de votre crochet pour pousser le bas du s&eacute;parateur dans le stator. Vous pouvez &eacute;galement avoir besoin d'un entra&icirc;neur pour limiter toute la &quot;&nbsp;force de rupture&nbsp;&quot; bloquant le s&eacute;parateur ou la passive. Si cela ne fonctionne pas passez le c&ocirc;t&eacute; pointu de votre crochet sur les goupilles. Dans le cas ou le s&eacute;parateur tomberait compl&egrave;tement dans le trou de passage du rotor de la serrure, la seule option serait de l’y retirer. Un palpeur en forme de crochet est dans ce cas  l’outil appropri&eacute;, mais faute de mieux, un trombone recourb&eacute; peut  aussi bien faire l'affaire, &agrave; moins que le s&eacute;parateur ne soit coinc&eacute;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> sch&eacute;ma 9.9:Un s&eacute;parateur ou une passive peuvent entrer dans le trou de passage</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">9,12 Crochetage par vibrations </P>
</B><P ALIGN="JUSTIFY">Le crochetage par vibrations fonctionne en cr&eacute;ant un vide sur la ligne de c&eacute;sure. Le principe de base semblera familier &agrave; celui qui a d&eacute;j&agrave; jou&eacute; au billard. Quand une boule en heurte  une autre avec force, la premi&egrave;re boule s'arr&ecirc;te et transmet &agrave; la seconde sa trajectoire, sa vitesse ainsi que sa force inertielle. Imaginez maintenant un appareil qui transmettrait une onde de choc au sommet de toutes les goupilles actives. Les goupilles actives transf&eacute;reraient ce mouvement aux passives qui iraient se placer rapidement dans le stator en y laissant un vide. Si vous appliquez une l&eacute;g&egrave;re  rotation &agrave; ce moment l&agrave;, le barillet tournera quand toutes les passives auront travers&eacute; la ligne de c&eacute;sure.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*note – s’effectue en &quot;&nbsp;manuel&nbsp;&quot; &agrave; l’aide du &quot;&nbsp;pistolet am&eacute;ricain&nbsp;&quot; appel&eacute; aussi &quot;&nbsp;pistolet d&eacute;crocheteur&nbsp;&quot;. Il existe &eacute;galement des pistolets vibreurs &eacute;lectriques fonctionnant &agrave; piles ou &agrave; batteries.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<B><P ALIGN="JUSTIFY">9,13 Serrures &agrave; paillettes</P>
</B><P ALIGN="JUSTIFY">Les serrures bon march&eacute; que l'on trouve sur les bureaux sont &eacute;quip&eacute;es de paillettes en m&eacute;tal au lieu de goupilles. Le sch&eacute;ma 9,10 repr&eacute;sente les fonctionnements de base de ces serrures. Les paillettes ont toutes le m&ecirc;me contour ext&eacute;rieur mais chaque usinage interne est diff&eacute;rent (hauteur de &quot;&nbsp;fen&ecirc;tre&nbsp; interne&nbsp;&quot; correspondant &agrave; la taille ou &agrave; la coupe de la clef). Ces serrures sont faciles &agrave; crocheter avec les outils ad&eacute;quats. Du fait que les paillettes soient proches les unes des autres l'utilisation d’un crochet &quot;&nbsp;semi-circulaire&nbsp;&quot; semble plus appropri&eacute; qu'un crochet en &quot;&nbsp;demi-diamant&nbsp;&quot;  (voire le sch&eacute;ma A.1). Vous pouvez &eacute;galement avoir besoin d'un entra&icirc;neur plus mince. Effectuez une tension rotative mod&eacute;r&eacute;e ou l&eacute;g&egrave;rement accentu&eacute;e si n&eacute;cessaire. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Sch&eacute;ma 9.10 : Fonctionnement d'une serrure &agrave; paillettes</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*note -  le crochet en &quot;&nbsp;double boule&nbsp;&quot; et un &quot;&nbsp;raclage&nbsp;&quot; sont particuli&egrave;rement efficaces sur ce type de serrure.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">un entra&icirc;neur de type &quot;&nbsp;pince &agrave; &eacute;piler&nbsp;&quot; &eacute;galement. (il applique une force rotative simultan&eacute;ment en haut et en bas du rotor sur l’entr&eacute;e de clef contrairement &agrave; l’entra&icirc;neur classique qui lui &quot;&nbsp;accroche&nbsp;&quot; en un seul point du rotor)</P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Chapitre 10</P>
</B></U></FONT><FONT SIZE=2>
</FONT><B><FONT FACE="Arial" SIZE=5><P ALIGN="JUSTIFY">Derni&egrave;res Remarques</P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Le crochetage est un savoir-faire, pas une science. Ce manuel pr&eacute;sente les connaissances techniques et les conseils n&eacute;cessaires pour acqu&eacute;rir ce savoir faire. De plus, il vous fournit des exemples et des exercices qui vous aideront &agrave; &eacute;tudier seul bon nombre de serrures. Pour exceller dans ce domaine, vous devrez toutefois pratiquer r&eacute;guli&egrave;rement et d&eacute;velopper un style qui vous convienne. Mais souvenez-vous que la meilleure technique qui soit est celle qui fonctionne le mieux pour vous. </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">               </P>
</FONT><B><U><FONT FACE="Arial" SIZE=5><P>Appendice A  </P>
</U></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial" SIZE=5><P>Les outils  </P>
<P ALIGN="JUSTIFY"></P>
</B></FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Cet appendice d&eacute;crit comment concevoir et fabriquer vos outils de crochetage.   </P>
<P ALIGN="JUSTIFY"></P>
<P>A.1 Formes des crochets</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Les crochets peuvent &ecirc;tre de formes et de dimensions variables. Le sch&eacute;ma A.1 pr&eacute;sente les formes les plus classiques. La poign&eacute;e et la lame de chacun des crochets sont identiques. La poign&eacute;e doit &ecirc;tre confortable et la lame doit &ecirc;tre suffisamment fine pour &eacute;viter d’actionner des goupilles inutilement. Toutefois si la lame est trop fine, elle aura tendance &agrave; se comporter comme un ressort et cela risque d’alt&eacute;rer la sensation du bout du crochet agissant sur les goupilles. La forme du bout du crochet d&eacute;termine la pr&eacute;cision avec laquelle celui ci peut agir sur les goupilles et quel type de r&eacute;action vous obtiendrez de chacune d’entre elles.</P>
<P ALIGN="JUSTIFY">   </P>
<P ALIGN="JUSTIFY">La forme du bout du crochet doit &ecirc;tre un compromis entre aisance de mouvement dans la serrure, et sa finesse  d’action sur les goupille. La forme en &quot;&nbsp;demi diamant&nbsp; large&nbsp;&quot; est facile &agrave; introduire et &agrave; retirer de la serrure, vous pouvez ainsi appliquer une pression sur les goupilles quand le crochet se d&eacute;place dans quelque direction que se soit. Il peut crocheter rapidement une serrure dont la longueurs des goupilles varie peu. Si la serrure n&eacute;cessite une clef munies de tailles diff&eacute;rentes dont certaines tr&egrave;s profondes, un tel crochet ne pourra pas comprimer suffisamment la goupille centrale. Le crochet en &quot;&nbsp;demi diamant fin&nbsp;&quot; sera en outre mieux adapt&eacute; &agrave; ce type de serrure, et en g&eacute;n&eacute;ral ce type de crochet donne de meilleurs r&eacute;sultats pour agir sur les goupilles . Malheureusement, ce dernier est moins confortable &agrave; manipuler dans la serrure. Un crochet qui poss&egrave;de un bout avec un angle avant large et un angle arri&egrave;re aigu fonctionne parfaitement avec les serrures Yale.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Les crochets palpeurs &agrave; forme &quot;&nbsp;semi-circulaire&nbsp;&quot; ou en forme de &quot;&nbsp;double boule&nbsp;&quot; sont particuli&egrave;rement adapt&eacute;s aux serrures &agrave; paillettes. (Voir le paragraphe 9.13). Les palpeurs en &quot;&nbsp;diamant&nbsp;&quot; ou en  &quot;&nbsp;boule&nbsp;&quot; sont bien adapt&eacute;s pour les serrures &eacute;quip&eacute;es de rang&eacute;es de paillettes double. Le palpeur avec un bout en  &quot;&nbsp;crochet&nbsp;&quot; est con&ccedil;u pour aligner les goupilles une par une. Il peut aussi &ecirc;tre utilis&eacute; pour &quot;&nbsp;racler&nbsp;&quot; les goupilles, mais la pression n&eacute;cessaire ne peut alors &ecirc;tre appliqu&eacute;e que de l’arri&egrave;re vers l’avant. Le bout en crochet vous permet de sentir la r&eacute;action de chaque goupille avec pr&eacute;cision et d’appliquer une pression variable. Les bouts en crochet peuvent &ecirc;tre plat ou plus ou moins arrondi de fa&ccedil;on &agrave; pouvoir aligner plus facilement le crochet avec les goupilles. L'avantage fondamental de &quot;&nbsp;t&acirc;ter&nbsp;&quot; les goupilles une par une est de pouvoir &eacute;viter de les &eacute;rafler. Racler les pistons laisse des rayures &agrave; leur l’extr&eacute;mit&eacute; et dans le passage de clef, ainsi que de la limaille de m&eacute;tal un peu partout dans la serrure. Si vous d&eacute;sirez ne pas laisser de traces, vous devez &eacute;viter le &quot;&nbsp;raclage&nbsp;&quot;. Le crochet &quot;&nbsp;en serpent&nbsp;&quot; peut &ecirc;tre utilis&eacute;e pour le &quot;&nbsp;raclage&nbsp;&quot; ou pour le &quot;&nbsp;t&acirc;tage&nbsp;&quot;. Quand vous utilisez la technique du &quot;&nbsp;raclage&nbsp;&quot;, les multiples protub&eacute;rances d’un tel outil sont plus efficaces qu’un crochet classique. Le crochet &quot;&nbsp;en serpent&nbsp;&quot; est particuli&egrave;rement adapt&eacute;e  &agrave; l’ouverture des serrures et verrous domestiques &agrave; cinq goupilles. Quand un crochet &quot;&nbsp;en serpent&nbsp;&quot; est utilis&eacute;e pour le crochetage, il peut positionner deux ou trois goupilles en m&ecirc;me temps. En fait, le crochet &quot;&nbsp;en serpent&nbsp;&quot; agit comme le segment d'une clef qui pourrait &ecirc;tre ajust&eacute;e pour soulever ou abaisser son extr&eacute;mit&eacute;, en l'inclinant de long en large, ou en utilisant son extr&eacute;mit&eacute; dans un sens ou dans un autre. Vous devez utiliser une tension rotative mod&eacute;r&eacute;e ou forte avec le crochet &quot;&nbsp;en serpent&nbsp;&quot; pour permettre &agrave; plusieurs goupilles de se positionner en m&ecirc;me temps. Ce type de crochetage est plus rapide que d’utiliser un palpeur classique (en diamant ou en crochet) mais il laisse aussi plus de traces.   </P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image27.gif" WIDTH=513 HEIGHT=720></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma A.1</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">*note -  il semblerait que l’utilisation de la &quot;&nbsp;vraie clef&nbsp;&quot; apr&egrave;s un crochetage effacerait en tout ou partie les menues traces de celui ci sur certains types de goupilles et/ou de serrures.</P>
<P ALIGN="JUSTIFY">  </P>
<B><P ALIGN="JUSTIFY">A.2 Les lamelles de balayeuses </P>
<P ALIGN="JUSTIFY"></P>
</B><P ALIGN="JUSTIFY">Les lamelles d’acier de balayeuses de rue constituent un excellent mat&eacute;riau pour la r&eacute;alisation d’outils de crochetage. Ces lamelles ont la bonne &eacute;paisseur et la bonne largeur, et ils est  facile de leur donner la forme d&eacute;sir&eacute;e. Les outils qui en r&eacute;sultent sont suffisamment &eacute;lastiques et tout en &eacute;tant rigides. Le paragraphe A.3 d&eacute;crit comment r&eacute;aliser des outils moins &eacute;lastiques.   </P>
<P ALIGN="JUSTIFY">Le premi&egrave;re &eacute;tape dans la r&eacute;alisation de ces outils est de poncer toute la rouille qui se trouve sur les lamelles avec du papier de verre fin ou de la paille de fer. Si les bords ou les extr&eacute;mit&eacute;s de la lamelle sont tordues, utilisez un lime pour leur rendre leur forme.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">*note – en France, les balayeuses n’utilisent pas de lamelles d’acier. Les essuies glaces des voitures poss&egrave;dent une lame m&eacute;tallique aux dimensions appropri&eacute;es pour la fabrication de divers crochets et entra&icirc;neurs. Les petites lames de scie &agrave; m&eacute;taux destin&eacute;es au mod&eacute;lisme &eacute;galement.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"><IMG SRC="Image28.gif" WIDTH=320 HEIGHT=234></P></FONT><FONT FACE="Arial">Un entra&icirc;neur poss&egrave;de une &quot;&nbsp;t&ecirc;te&nbsp;&quot; et une &quot;&nbsp;poign&eacute;e&nbsp;&quot; ou &quot;&nbsp;un manche&nbsp;&quot; comme le montre le sch&eacute;ma A.2. La &quot;&nbsp;t&ecirc;te&nbsp;&quot; fait habituellement 0,3 &agrave; 1 centim&egrave;tre de longueur et la &quot;&nbsp;poign&eacute;e&nbsp;&quot;, quand &agrave; elle, peut atteindre de 4 &agrave; 6 centim&egrave;tres de longueur. La t&ecirc;te et la poign&eacute;e sont s&eacute;par&eacute;s par un coude qui est approximativement &agrave; 80 degr&eacute;s. La t&ecirc;te doit &ecirc;tre assez longue pour pouvoir atteindre toute entr&eacute;e de serrures (par exemple celle se trouvant au centre des poign&eacute;es concaves de certaines serrures ) et pouvoir agir avec puissance sur le rotor. Une poign&eacute;e longue permet de contr&ocirc;ler avec pr&eacute;cision la rotation, mais si elle est trop longue, elle risquera d’&ecirc;tre entrav&eacute;e par le chambranle de la porte. La poign&eacute;e, la t&ecirc;te et le coude peuvent &ecirc;tre de dimension r&eacute;duites si vous souhaitez dissimuler facilement vos  outils (par exemple, dans un stylo, dans une lampe de poche, ou une boucle de  ceinture). Quelques  entra&icirc;neurs sont torsad&eacute;s &agrave; 90 degr&eacute; sur la poign&eacute;e. Cette torsade permet de contr&ocirc;ler plus facilement la rotation du barillet en choisissant l’endroit pr&eacute;cis o&ugrave; la poign&eacute;e va d&eacute;vier de sa position initiale. La poign&eacute;e agit alors comme un ressort qui agirait plus souplement sur la rotation. L'inconv&eacute;nient de cette m&eacute;thode est que vous obtiendrez moins de &quot;&nbsp;r&eacute;ponse&nbsp;&quot;  de la part du rotor lorsque vous appliquerez une force rotative. Pour crocheter des serrures plus complexes il vous faudra apprendre a appliquer une tension progressive avec un tenseur  rigide.   </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&#9;&#9;&#9;Sch&eacute;ma A.2</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">La largeur de la t&ecirc;te d’un entra&icirc;neur d&eacute;termine la finesse avec laquelle il s’adaptera &agrave; la serrure. Les serrures &agrave; gorges &eacute;troites (par exemple, les serrures de bureau) requi&egrave;rent un entra&icirc;neur avec une t&ecirc;te mince. Avant de le recourber, limez la lamelle &agrave; la largeur d&eacute;sir&eacute;e. Un entra&icirc;neur &quot;&nbsp;universel&nbsp;&quot; peut &ecirc;tre r&eacute;alis&eacute; en diminuant  l’extr&eacute;mit&eacute; de la t&ecirc;te (d’environ 1 millim&egrave;tre). L’extr&eacute;mit&eacute; de la t&ecirc;te conviendra parfaitement &agrave; des serrures &agrave; passage de cl&eacute;s minces alors que le reste de t&ecirc;te pourra s’adapter &agrave; des passages de cl&eacute;s plus classiques.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Le plus  difficile dans la fabrication d’un entra&icirc;neur c’est de plier la lamelle d’acier sans l’endommager. Pour r&eacute;aliser la torsade &agrave; 90 degr&eacute;s sur la poign&eacute;e de l’entra&icirc;neur, serrez la t&ecirc;te de la lamelle d’acier dans un &eacute;tau ( sur approximativement 3 centim&egrave;tres) et utilisez une pince pour saisir la lamelle &agrave; approximativement un centim&egrave;tre au-dessus de l'&eacute;tau. Vous pouvez utiliser une deuxi&egrave;me pince si vous ne disposez pas d'un &eacute;tau. Appliquez une torsion sur 45 degr&eacute;. Essayez de garder l'axe de la torsion align&eacute; avec l'axe de la lamelle d’acier. Maintenant d&eacute;placez les pinces d’un centim&egrave;tre suppl&eacute;mentaire et  appliquez une nouvelle torsion sur 45 degr&eacute;s . Il  vous faudra tordre la lamelle sur plus de 90 degr&eacute;s pour obtenir une torsade &agrave; 90° degr&eacute;s permanente.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Sch&eacute;ma A.1: Diff&eacute;rentes formes de crochets palpeurs </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Pour donner une inclinaison de 80°  &agrave; la t&ecirc;te, faites d&eacute;passer la lamelle hors de l'&eacute;tau d’environ 1 centim&egrave;tre (il reste donc 2 centim&egrave;tres pris dans l'&eacute;tau). Placer la tige d'un tournevis contre la lamelle et recourbez l'acier autour du tournevis sur un angle d’environ 90 degr&eacute;s. Cela devrait donner au m&eacute;tal une inclinaison permanente de 80 degr&eacute;s. Essayez de garder l'axe de l’inclinaison perpendiculaire au manche. La tige du tournevis garantit que le rayon de cette inclinaison ne sera pas trop petit. Tout objet arrondi peut faire l’affaire (par exemple, une m&egrave;che de perceuse, une pince &agrave; &eacute;piler, ou le bouchon d’un stylo). Si vous avez des probl&egrave;mes avec cette m&eacute;thode, essayez de saisir la lamelle avec deux pinces &eacute;loign&eacute;es d’environ 1,5 centim&egrave;tre et tordez la pi&egrave;ce. Cette m&eacute;thode produit une courbe progressive qui ne cassera pas la lamelle d’acier.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Une meuleuse facilitera beaucoup la fabrication des crochets. Cela demande un peu d'entra&icirc;nement pour apprendre comment faire des d&eacute;coupes propres avec une meuleuse, mais il faut moins de temps pour se faire la main sur deux ou trois crochets que de confectionner un seul crochet avec une lime. La premi&egrave;re &eacute;tape est de tailler l'angle avant du crochet. Utilisez pour cela la partie plane de la meule. Tenez la lamelle d’acier &agrave; 45 degr&eacute;s et d&eacute;placez la lamelle lat&eacute;ralement pour d&eacute;grossir le m&eacute;tal sur la meule. Travaillez par &agrave;-coups pour &eacute;viter de surchauffer le m&eacute;tal ce qui le rendrait  fragile. Si le m&eacute;tal change de couleur (s’il rougit ou noircit), vous l'avez surchauff&eacute;, et vous devrez alors retravailler la zone color&eacute;e. Taillez ensuite l'angle arri&egrave;re du bout du crochet en utilisant le bord de la meule. Habituellement un des c&ocirc;t&eacute;s de la meule est plus coupant que l'autre, c’est ce c&ocirc;t&eacute; que vous choisirez. Maintenez le crochet en conservant l'angle d&eacute;sir&eacute; puis amenez-le lentement sur l’angle du bord de la meule. Le tranchant de la meule devrait alors tailler parfaitement l'angle arri&egrave;re de l’outil. Soyez s&ucirc;r que bout du crochet est maintenu. Si la petite table d’appui de la meuleuse n’est pas assez proche de la meule pour pouvoir tailler le bout du crochet vous pouvez utiliser des pinces pour le tenir. La partie &agrave; tailler doit &ecirc;tre l&eacute;g&egrave;rement sup&eacute;rieure  aux 2/3 de la largeur de la lamelle d’acier. Si le bout du crochet se dessine alors proprement, continuez. Si ce n’est pas le cas arr&ecirc;tez et recommencez avec une autre lamelle d’acier. Sinon, vous risqueriez de casser la lamelle d’acier en la serrant dans un &eacute;tau et en la recourbant &agrave; nouveau.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Le bord de la meule est aussi utilis&eacute; pour tailler la lame du crochet. Faites un gabarit pour indiquer jusqu’&agrave; quel endroit la lame doit &ecirc;tre taill&eacute;e. La lame doit &ecirc;tre suffisamment longue pour pouvoir atteindre la derni&egrave;re goupilles d’une serrure &agrave; sept &quot;&nbsp;suret&eacute;s&nbsp;&quot;. Taillez la lame en faisant plusieurs passages l&eacute;gers. Chaque passage doit aller de l’avant  vers l’arri&egrave;re du gabarit pr&eacute;alablement trac&eacute;. Essayez d'enlever moins d'un 1 millim&egrave;tre de m&eacute;tal &agrave; chaque passage. Utilisez deux doigts pour tenir la lamelle de m&eacute;tal &agrave; l'angle ad&eacute;quat pendant que votre autre main pousse le manche du crochet pour d&eacute;placer la lame le long du bord de la meule.  </P>
<P ALIGN="JUSTIFY">Utilisez une lime &agrave; main ou du papier &eacute;meri fin pour les finitions. L’outil doit vous para&icirc;tre lisse si vous passez votre doigt dessus. Toute rugosit&eacute; de votre outil ajouterait des perturbations dans la perception des sensations lors du t&acirc;tage de la serrure.   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">La gaine externe d’un c&acirc;ble de t&eacute;l&eacute;phone peut &ecirc;tre utilis&eacute;e pour confectionner la poign&eacute;e de votre crochet palpeur. Enlevez trois ou quatre fils sur une certaine longueur de c&acirc;ble et installez cette gaine sur la poign&eacute;e du crochet. Si cette gaine ne reste pas en place, vous pouvez utiliser de la colle &eacute;poxy sur le manche avant d’installer la gaine.   </P>
<P ALIGN="JUSTIFY">  </P>
<P>A.3 Les rayons de bicyclette  </P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Une bonne alternative pour faire des outils si vous ne disposez pas de lamelles de balayeuses c’est de les faire &agrave; partir rayons de la bicyclette. Ces mat&eacute;riaux sont accessibles facilement et une fois trait&eacute;e &agrave; chaud (thermiquement), ils seront plus solides que des outils faits &agrave; partir lamelles m&eacute;talliques non trait&eacute;es.   </P>
<P ALIGN="JUSTIFY">   </P>
<P ALIGN="JUSTIFY">  Sch&eacute;ma A.2: Entra&icirc;neurs   </P>
<P ALIGN="JUSTIFY">  </P>
<P ALIGN="JUSTIFY">Un entra&icirc;neur peut &ecirc;tre construit &agrave; partir d’un clou de petit diam&egrave;tre. En premier lieu il faut le chauffer avec un chalumeau au propane jusqu'&agrave; ce qu'il devienne rouge, puis le retirer lentement  de la flamme, et laissez le refroidir; cela le rend plus mall&eacute;able &agrave; travailler. Le br&ucirc;leur d'une cuisini&egrave;re &agrave; gaz peut &ecirc;tre utilis&eacute; si vous ne disposez pas d’un chalumeau. Martelez le pour lui donner une forme plane comme la lame d’un petit tournevis et recourbez-le sur approximativement 80 degr&eacute;s. Le coude doit &ecirc;tre inf&eacute;rieur &agrave; un  angle droit parce que quelques  serrures sont encastr&eacute;es derri&egrave;re une plaque (que l’on appelle un &eacute;cusson) et il est n&eacute;cessaire que  l’entra&icirc;neur puisse p&eacute;n&eacute;trer d’environ  un centim&egrave;tre dans le barillet. Trempez l’entra&icirc;neur en le chauffant jusqu’&agrave; ce qu’il devienne orange clair puis  refroidissez le  brusquement dans de l’eau glac&eacute;e. Vous obtiendrez alors une sorte de tournevis courbe pratiquement indestructible qui durera des ann&eacute;es malgr&eacute; un usage intensif.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Les rayons de bicyclette font d’excellents entra&icirc;neurs ou m&ecirc;me des crochets. Courbez en un &agrave; la forme que vous voulez obtenir et limez les bords jusqu’&agrave; ce qu’ils deviennent plats afin qu’ils soient rigides &agrave; la verticale et flexibles &agrave; l’horizontale. Pour les crochets plus petits pour des serrures vraiment minuscules, utilisez un ressort de grand diam&egrave;tre et redressez-le en l’&eacute;tirant. Si vous &ecirc;tes prudent vous n’aurez pas besoin de vous lancer dans d’hasardeux travaux de m&eacute;tallurgie amateur.   </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">  *note&nbsp;:  les lames d’essuie glace en acier inox font parfaitement l’affaire et se pr&ecirc;tent bien &agrave; la &quot;&nbsp;mise en forme&nbsp;&quot;  &agrave; froid</P>
<P ALIGN="JUSTIFY">  </P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">A.4 les bandes m&eacute;talliques qui entourent les briques</P>
</B><P ALIGN="JUSTIFY">Pour remplacer parfaitement les clefs vierges (&eacute;bauches) que vous ne pouvez pas trouver en magasin, utilisez les bandes m&eacute;talliques qui entourent les briques pour les transporter sur les palettes. Ce mat&eacute;riau est  particuli&egrave;rement pratique pour fabriquer presque n'importe quoi. Pour obtenir l’angle n&eacute;cessaire pour l’utilisation sur des serrures, il est possible de recourber une de ces  bandes en la serrant dans un &eacute;tau et martelant la partie qui d&eacute;passe pour lui donner la longueur et l'angle requis.   </P>
<P ALIGN="JUSTIFY">Ces bandes m&eacute;talliques sont tr&egrave;s dures. Elles peuvent endommager une meuleuse ou une machine &agrave; clefs. Une lime est l'outil recommand&eacute; pour tailler ou travailler ces bandes m&eacute;talliques.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><U><FONT FACE="Arial" SIZE=5><P>A<B>ppendice B  </P>
</B></U></FONT><FONT SIZE=2>
</FONT><B><FONT FACE="Arial" SIZE=5><P>Implications l&eacute;gales  - en France -</P>
</B></FONT><FONT SIZE=2>
</FONT><FONT FACE="Arial"><P ALIGN="JUSTIFY">Contrairement &agrave; un mythe bien r&eacute;pandu, ce n'est pas un d&eacute;lit de poss&eacute;der des outils de crochetage. Toutefois leur emploi peut s’&eacute;carter du cadre l&eacute;gal en &eacute;tant assimil&eacute; &agrave; une tentative de vol avec effraction, ou &agrave; une &quot;&nbsp;suspicion de cambriolage&nbsp;&quot; facteur aggravant  pouvant avoir d’importantes r&eacute;percutions pour votre avenir.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">C’est pourquoi, m&ecirc;me les serruriers, s’entourent de pr&eacute;cautions et de t&eacute;moignages lors de la r&eacute;daction du &quot;&nbsp;contrat d’ouverture de porte&nbsp;&quot;.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY"> Les articles suivants du code p&eacute;nal fran&ccedil;ais traitent de ce sujet et pr&eacute;sentent les peines encourues dans ce cas de figure. </P>
<I><P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">Art 132-73 </B>L'effraction consiste dans le forcement, la d&eacute;gradation ou la destruction de tout dispositif de fermeture ou de toute esp&egrave;ce de cl&ocirc;ture. Est assimil&eacute; &agrave; l'effraction l'usage de fausses clefs, de clefs ind&ucirc;ment obtenues ou de tout instrument pouvant &ecirc;tre frauduleusement employ&eacute; pour actionner un dispositif de fermeture sans le forcer ni le d&eacute;grader. </P>
<I><P ALIGN="JUSTIFY"></P>
</I><B><P ALIGN="JUSTIFY">Fausses clefs. </B>Doit &ecirc;tre assimil&eacute;e &agrave; une fausse clef, celle dont le voleur fait usage pour ouvrir la serrure m&ecirc;me &agrave; laquelle elle &eacute;tait destin&eacute;e, soit qu'il l'ait pr&eacute;alablement d&eacute;rob&eacute;e, soit qu'il l'ait trouv&eacute;e apr&egrave;s avoir &eacute;t&eacute; perdue.</P>
<B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Art. 381 </B>Le vol simple ou sa tentative sera<B> </B>puni d'un emprisonnement de trois mois a trois ans et d'une amende de 1000 F &agrave; 20 000 F ou de l’une de ces deux peines seulement.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Art. 382</B> Sera puni d'un emprisonnement d'un<B> </B>an &agrave; cinq ans et d'une amende de <BR>
5 000 F &agrave; 200 000 F le coupable de vol commis ou tent&eacute;…&agrave; l’aide d'une effraction ext&eacute;rieure ou int&eacute;rieure,… ou de fausses clefs ou de clefs vol&eacute;es…dans un local d’habitation ou un lieu ou sont conserv&eacute;es des fonds, valeurs, marchandises ou mat&eacute;riels…</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Art. 398 </B>Sont qualifies <I>fausses clefs, </I>tous crochets, rossignols, passes partout, clefs imit&eacute;es, contrefaites, alt&eacute;r&eacute;es, ou qui n'ont pas &eacute;t&eacute;s destin&eacute;es par le propri&eacute;taire, ou le locataire, aux serrures, cadenas, aux fermetures quelconques auxquelles le coupable les aura employ&eacute;es.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Art. 399 </B> Quiconque aura contrefait ou alt&eacute;r&eacute; des clefs sera condamn&eacute; a un emprisonnement de trois mois &agrave; deux ans et &agrave; une amende de 500f &agrave; 15000f…</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="center">&#9;&#9;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:-&nbsp;:</P>
<P ALIGN="center"></P>
<P ALIGN="CENTER">- France - Septembre 1999 -</P>
<I><P ALIGN="center">&#9;&#9;_________________________________________</P>
</I></FONT><P ALIGN="center"></P>
<FONT FACE="Arial"><P ALIGN="center">&nbsp;</P>
</FONT><FONT SIZE=2><P>&nbsp;</P>
</FONT><FONT FACE="Arial"><P ALIGN="center">&nbsp;</P>
<br></td></table>
<table width="600" border="0"><td>
<p align="left"><a href="../dst.htm"><img src="previous.gif" border="0"></a></p></td>
<td><p align="right"><a href="../digicode.html"><img src="next.gif" border="0"></a></p></td></table>

<br><table width=600>
<hr width="80%" size="2"><br><font face="verdana" size="2">
CRYPTEL 1999: Distribution autorisée et conseillée d'ailleurs !
Citez juste les AUTEURS et les SOURCES par simple politesse :)<br><br></font>
<hr width="80%" size="2"><br></table></center></BODY></HTML>
