<html>
<head>
<title>Conclusion</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFF8" text="#000000" link="#309868" vlink="#309868" alink="#309868">
<table width="283" border="0" cellspacing="0" cellpadding="0" background="IMAGES/fnd_stitre.jpg" height="40">
  <tr> 
    <td width="23">&nbsp;</td>
    <td width="294"><font face="Verdana, Arial, Helvetica, sans-serif" color="#FFCC00"><font color="#CCCCCC" size="2">CONCLUSION</font></font></td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>LoginX:</b> 
  Tous les efforts ont &eacute;t&eacute;s faits pour que vous puissiez passer 
  plusieurs heures a lire des articles d'un excellent niveau, un mag ou tous les 
  details ont &eacute;t&eacute;s travaill&eacute;s pendant plusieurs heures, ou 
  tous les articles ont &eacute;t&eacute;s relus, corrig&eacute;s, v&eacute;rifi&eacute;s 
  et test&eacute;s avant meme de penser a la publication.<br>
  Nous vous invitons tr&egrave;s vivement a &eacute;crire a chaque auteur si vous 
  avez des questions a poser, toutes nos adresses emails sont<br>
  pr&eacute;sent&eacute;s avec le mag, nous sommes tr&egrave;s attentifs a vos 
  questions, angoisses et reactions.<br>
  ++<br>
  </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b>Nexxt:</b> Voil&agrave; 
  notre 3 &egrave;me &eacute;dition est enfin termin&eacute;e, et on s'est donn&eacute; 
  du mal cette fois ci. Vous avez remarqu&eacute; que la partie phreaking ne contient 
  pas beaucoup d'articles, mais c'est pour plusieurs raisons. Il y a d'abord le 
  manque de temps, car je passais des examens, donc &ccedil;a ne m'a pas aid&eacute;. 
  De plus mon coll&egrave;gue N9 s'est absent&eacute; pdt une longue p&eacute;riode. 
  Il n'y a pas non plus de partie Cracking, avec notament la suite du tuto sur 
  l'asm, et pourtant je sais qu'il est attendu par beaucoup de monde... j'en suis 
  d&eacute;sol&eacute;, mais si je ne l'ai pas fait, c'est pour la m&ecirc;me 
  raison. Mais promis, je me rattraperais dans le 4, qui promet d'&ecirc;tre encore 
  mieux que celui l&agrave; =)<br>
  Sur ce, je vous salut bien bas...</font></p>
</body>
</html>
