<HTML><HEAD><TITLE>MemenTo</TITLE>

<meta name="Author" content="[Shmeit Corp]-->
<META content="text/html; charset=iso-8859-1" http-equiv=Content-Type>
<meta http-equiv="content-language" content="fr">
</HEAD>
<body  background="stars.jpg" bgcolor="#000000" link="#FFFFFF" vlink="#FFFFFF" alink="#00E0FF">
<font color=#EEEEEE face=arial, verdana, courier size=2>
<center><h1>Chronikz IV<br></h1></center>
<br><br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b><h3>Les fêtes catalogu&eacute;es...</h3></b>
<br>
Bon, il est vrai que le titre n'inspire pas grand chose mais je compte m'attaquer &agrave; un monument de notre soci&eacute;t&eacute;... car certaines actions que je qualifierais d'hypocrite sont accept&eacute;es et suivis de mani&egrave;re r&eacute;guli&egrave;re et plus grave encore parfois sans que les individus "coupable" s'en rendent comptent! <br>
Il est donc temps de sortir le katana.......... :(<br><br>
(au fait, pour les habitu&eacute;s et les n&eacute;ophites je ne structure pas le texte c'est du brut tout droit sorti de l'usine pas où tr&egrave;s peu de retouche, pas de structure argumentative pour conditionner votre lecture, j'&eacute;cris comme je parle et je parle comme je pense..... donc pas de critique sur la forme car .... vous connaissez la suite !)<br>
<br><br><center>----------------------------</center><br><br>

<b>1)</b> Il n'y &agrave; rien de plus hypocrite que le rituel auquel se livrent la plupart des gens chaque ann&eacute;e &agrave; la même p&eacute;riode.
Toujours la même cohue dans les grands magasins lorsque l'hiver approche et tout ça pourquoi ???
pour une fête, un jour, une soir&eacute;e ....certains appellent ça Noël moi je l'appelle lavage de cerveau collectif (et de portefeuille...).<br><br>
Les paiens me racontent que c'est une tradition mais la j'y met un "bemol" car je pense qu'il y a une limite entre traditions
et (genre faire la fete lorsqu'on se marie) et le pas leger qui vous conduit a la mascarade de noël!
Les Catholiques me diront que c'est important pour eux car biblique..pour eux je dis:<br><br>

<b>Halte l&agrave;</b>, c'est faux ça n'a rien de biblique, il n'y a aucun rapport entre les cadeaux
que les gens  se font et la naissance du Christ : c'est du commerce pur et dur.<br>
Si vous croyez dur comme fer que ce biz est 100% en rapport avec Jesus garanti sans sucre ajout&eacute;,
vous n'êtes pas (tous autant que vous êtes ) sorti de Harvard, ça c'est sûr, mais peut être pas du lyc&eacute;e,
tout bonnement car c'est une invention Romaine !<br><br>

Petit cours d'histoire, les romains &eacute;taient polyth&eacute;iste 
(bon ok , les petits bonhommes qu'Ob&eacute;lix martyrise, et ben ils croyaient &agrave; plusieurs dieux...
ex: dieu du vin, dieu de la guerre, dieu de la fertilit&eacute; etc...)<br>
En pleine conquête du bassin m&eacute;diterrann&eacute;en l'empereur (ze sais pu comment)
craignant une r&eacute;volte des populations soumises monoth&eacute;istes (les chatholiques)
chercha une mani&egrave;re de s'en rapprocher, de les impliqu&eacute;s dans la vie romaine afin
qu'ils s'apparentent d'eux mêmes &agrave; des romains !<br><br>
Comme les cathos croit en la naissance d'un sauveur le 25/12 il a une brillante id&eacute;e :
le 21/12 nous louons le dieu du Soleil (&agrave; cause du solstice d'hiver) pourquoi ne pas
reporter les festivit&eacute;s (dont l'&eacute;change de cadeaux) au 25/12 pour comme ça les cathos
auront l'impressions que leur fête est reconnu par Rome et en plus je gagne en coh&eacute;sion,
le peuple romain  &eacute;vitera de rejeter les vaincue et inversement les vaincues se sentant
mieux eviteront de se rebeller !!!!!!!<br><br>

Voil&agrave; comment on en arrive &agrave; p&eacute;ter les records de consommation fin novembre d&eacute;but d&eacute;cembre chaque ann&eacute;e !
C'est pourquoi je n'offre rien &agrave; personne le 25/12, je ne demande rien non plus et que j'enrage quand je suis oblig&eacute; de me farcir tout le tapage m&eacute;diatique dû &agrave; la fin d'ann&eacute;e (notez que cette annee je suis servi je me tape l'an 2000 alors...). Pour moi le 25 viens juste apr&egrave;s le 24 rien de plus, et ce, tous les mois de l'ann&eacute;e !
J'en vois encore soupçonneux, c'est pas grave car ce n'&eacute;tait que la partie emmerg&eacute;e de l'iceberg!
<br><br><br><br><br>

<b>2)</b>Je trouve cette fête hypocrite donc car il n'y a que lorsque l'hiver approche,
que la masse prend conscience, que des hommes et des femmes, comme eux, vivent sous les pont
c'est &eacute;coeurant  ! Toute l'ann&eacute;e ils vivent mais il n'y a qu'en D&eacute;cembre que j'entend des appels
aux dons "pour que les sans abris puissent avoir un endroit où dormir ou un repas chaud.<br><br>

AAAArRRRgghHH c'est un scandale ! car 11 mois sur 12 les pauvres ne sont que de la merde et
subitement la veille des orgies saumon, foie gras, caviar, homards, dindes farcies, champagne,
vins et autres .... que l'on se rend compte que deux monde co-&eacute;xistent ceux qui en ont et
....les autres.<br>
Les chaînes de t&eacute;l&eacute; et les grandes entreprises se payent "du marketing &agrave; coups de clochards"
pas cher mais ça redore leur blason et  ça leur permet de s'en foutre pleins les fouilles !<br><br>
Ce qui me rend malade ce ne sont pas vraiment les Companies mais le public qui subitement
se sent d'une humeur &agrave; donner...ces mêmes grands m&egrave;res qui toute l'ann&eacute;e jouent les crevures
lorsqu'un gars fais la manche dans le m&eacute;tro, se transforment en gentilles donatrices pour se
vanter d'avoir du coeur le soir de Noël devant la famille .... c'est une honte !!!<br>
A croire que personne ne pense que pour pouvoir profiter de cette "pseudo g&eacute;n&eacute;rosit&eacute;" 
il faut survivre pendant 11 mois ... Je le crie bien haut j'ai plus de respect pour celui qui
donne 10 F &agrave; un mendiant tous les 3mois qu'au bourgeois sur-nourris vomissant le caviar 
qui donne 100 F &agrave; Carrefour pour "les Noël de la solidarit&eacute;"...<br><br>
<br><br><br><br>

<b>3) </b>J'en ai marre, tous les ans c'est les mêmes conneries j'ai presque l'impression 
de revivre le même soir &agrave; un an d'intervalle. Je rentre chez moi faut faire &agrave; manger surtout 
quand je suis en vacances, faut bouffer vers 20h30 puis j'allume le PC pour me faire un ptit 
game avant de me coucher, et justement c'est &agrave; ce moment que chaque ann&eacute;e toute la plan&egrave;te se 
met &agrave; faire la foire et c'est &eacute;galement &agrave; 23h30 qu'&agrave; chaque fois je me rappelle que l'on est 
le 31  et qu'il est bientôt l'heure pour une esp&egrave;ce, pas du tout en voie d'extinctions, 
le D&eacute;bilitus Enrag&eacute;  de se mettre &agrave; gueul&eacute;, tel le putois en rute, un doux ... euh ... chant 
connus par toute l'esp&egrave;ce et servant semble t il de signal de ralliement, qui donne &agrave; peu pr&egrave;s 
ça :<br>
"BBBBOOOONNNNNNNE   ANNNNNNNNNEEEEEEEE ET BBBBOOOONNNNNNE SANNNNTEEEE"<br><br>
A cet instant pr&egrave;cis, je n'ai qu'un reflexe, apr&egrave;s m'être explos&eacute; la r&eacute;tine &agrave; un bon game
et cherchant &agrave; rejoindre les bras de Morph&eacute;e (non ce n'est pas mon chien !) cel&agrave; donne &agrave; 
peu pr&egrave; ça : "Bordel de merde vous me cassez la tête" !!<br><br>

Je ne suis pas tr&egrave;s fut&eacute;, je comprend pas l'entrain de tous ces sacs &agrave; vins qui auront une 
gueule de macab&eacute; au reveil sans parl&eacute; de ceux qui le seront r&eacute;ellement et qui du coups, ne se 
reveilleront pas ! Le premier Janvier n'est rien d'autres que le lendemain du 31/12 rien de 
plus c'est totalement ridicule et en plus ça me fais chier !<br>
Alors &agrave; chaque fois j'ai droit &agrave; la vieille rengaine : "ouais, c'est un nouveau d&eacute;part une 
nouvelle ann&eacute;e, c'est significatif on prend de bonnes r&eacute;solutions pour être mieux que l'ann&eacute;e 
d'avant...c'est chouette quoi !"<br>
C'est du n'importe quoi les gens prennent toujours les mêmes r&eacute;solutions, les femmes se 
promettent de ne plus manger de sucreries, les ivrognes se promettent de moins boire et les 
fumeurs d'arrêter bref autant de truc qu'ils se promettront l'ann&eacute;e prochaine.<br>
Vous feriez mieux de ne pas vous mentir et de cessez de promettre &agrave; tort et &agrave; travers !
<br><br><br><br><br>
<b>4) </b>Bon maintenant c'est simple il reste toutes les autres : on fêtes les rois mages, 
les anniversaires, les fantomes et autres esprits,les Valentin(e)s, les m&egrave;res, les p&egrave;res, 
les grand-m&egrave;res ... il manque plus que grand-p&egrave;re et on peut faire un jeu de 7 familles !<br><br>
C'est peut-être le summum de l'hypocrisie car souhaiter un bon anniversaire &agrave; quelqu'un et lui 
offrir un cadeau c'est hypocrite... Ca veut tout simplement dire qu'il y a qu'une fois dans 
l'ann&eacute;e (oui sur 365 jours) où vous m&eacute;ritez un cadeau, remarquez aussi que c'est &eacute;galement ce 
jour que votre t&eacute;l&eacute;phone sonne le plus souvent, c'est &eacute;videmment le coup de fil de vos pseudo 
amis qui d&eacute;cident de reprendre un bref contact avec vous pour faire style ils ne vous oublient 
pas (c'est surtout parce que toutes vos copines ont un agenda sur lequel elles notent tous les 
anniversaires de toutes leurs connaissances... si ce n'est pas hypocrite de dire qu'elles 
pensent &agrave; vous alors qu'elles ont fais un recensement il y  a 1 an).<br><br>
Si j'&eacute;tais vous, mon ego en aurais pris un coup... enfin bref si vous ne me croyez pas 
interrogez vous : combien de cadeaux faites vous tous les ans &agrave; ceux que vous dites aimer 
(hors anniversaire bien entendu) ?<br><br>
Il va sans dire que la st Valentino est un representant de poids dans le domaine de 
l'hypocrisie puisque : beaucoup de mes potes cherche une go 1 mois avant le 14/02 juste pour 
pouvoir beneficier d'un sweat ou de pompe a l'oeil, et d'autres sont en sang parcequ'il ne 
savent pas quoi offrir &agrave; Dulcin&eacute; et qu'en plus il faut absolument que le cadeau soit different 
de l'annee passe et surtout pour que la "preuve d'amour" soit veritablement intangible il doit 
être si possible plus honereux que l'an passe, bref un vrai casse tête existentiel 
(certain se reconnaisse sûrement...enfin j'me comprend).<br>
Perso je pense ne pas en faire assez, mais bon comme moi je ne souhaite &agrave; personne 
son anniversaire, je suis surement le connard, pingre, et stupide de service n'est-ce pas ??<br>
Dans votre interêt &agrave; tous je vous (me?)je souhaite ! :(<br><br>
<br><br><br>
Bon j'me casse, faut que je r&eacute;cup&egrave;re les heures de sommeil que vous m'avez fais perdre en
D&eacute;cembre dernier et que je prenne de l'avance sur cette ann&eacute;e ! Mauvaises fêtes !!! :(<br><br>
Si vous faite la fête parceque vous en avez envie et non parceque les autres le font, je vous 
donne un conseil : <b>ARRACHEZ-TOUT</b>, je ne vous en voudrais en aucune mani&egrave;re !
(sauf si votre fête est nulle !)<br><br>
<center>
<br>
<br>
</center><br><br><br>

<b>P.S.</b>: Pour tout ceux qui ne sont pas d'accord avec moi en ce qui concerne la premi&egrave;re critique <br>
et qui se sentent visiblement plus cultiv&eacute; que moi th&eacute;ologiquement parlant veuillez lire ceci :<br> 
<i>(au fait pour tout ceux qui sont allergique &agrave; la religion en g&eacute;n&eacute;rale ne lisez pas ce qui suit, 
de plus je ne veux aucun commentaire sur ce qui va suivre je ne r&eacute;pondrais pas non plus au 
lettre d'insurrection des nerveux; je ne voulais pas parler de religion dans mes Chronikz c'est 
donc, vraisemblablement, la premi&egrave;re et surtout la DERNIERE fois que vous y lirez des propos &agrave; 
caract&egrave;re "d&eacute;bat" sur la religion)</i><br><br>

Donc : Je ne suis pas d'accord avec les catholiques quant &agrave; la naissance du Christ un 25 d&eacute;cembre
tout simplement car lorsque je lis le Livre <i>(comprendre la bible pour les incultes)</i>
en Luc 2:8-12 j'y trouve ceci <br><i>(pour ceux qui n'en n'ont pas sous la main)</i> :<br><br>  
<i>"Il y avait aussi dans ce même pays des bergers qui vivaient en plein air et qui, la nuit, 
passaient les veilles &agrave; surveiller leurs troupeaux. Et soudain l'ange de Dieu se tint pr&egrave;s d'eux,
et la gloire de Dieu rayonna autour d'eux, et ils eurent alors tr&egrave;s peur.
Mais l'ange leur dit :"N'ayez pas peur, car voici que je vous annonce la bonne nouvelle d'une 
grande joie que va avoir tout le peuple, parce qu'il vous est n&eacute; aujourd'hui un Sauveur, qui 
est Christ Seigneur - dans la ville de David. Et ceci est un signe pour vous : vous trouverez 
un  nouveau-n&eacute; envelopp&eacute; de langes et couch&eacute; dans une mangeoire."
</i><br><br>
Bon les puristes auront donc reconnus ce passage mais aurez vous not&eacute; que les bergers dormaient 
dehors et que les troupeaux se trouvaient dans les paturage le jour de la naissance du-dit 
Sauveur ?<br>
Pour moi, il semble inconcevable que les bergers aient &eacute;t&eacute; inconscient et pris un 
risque de dormir dehors aux premiers jours de l'hiver.<br><br>
Alors certains me diront qu'en Israël il fais chaud et qu'il ne neige pas mais pourtant en 1992
Jerusalem enregistre l'un de ses plus rgoureux hiver des couches de neige entre 7 et 12 m&egrave;tres.
De plus Jerusalem aurait connus 24 hiver enneig&eacute; entre 49 et 80.<br><br>
Et pour ceux qui douterais de ces infos demandez vous pourquoi en Matthieu 24:20 J&eacute;sus parlant 
des derniers jours dit aux disciples :<i>"Priez sans cesse pour que votre fuite n'arrive pas en hiver ni le jour du sabbat"</i>
<br><br>
Il fallait que je le dise, je sais qu'&agrave; cet instant je me fais une myriade d'ennemi mais <br>
comme dirait "je-ne-sais-plus-qui" :<b>"Que Dieu me prot&egrave;ge de mes amis, mes ennemis je m'en charge"</b>...<br></font></font>