<HTML><HEAD><TITLE>MemenTo</TITLE>

<meta name="Author" content="[Shmeit Corp]--">
<META content="text/html; charset=iso-8859-1" http-equiv=Content-Type>
<meta http-equiv="content-language" content="fr">
</HEAD>
<body  background="stars.jpg" bgcolor="#000000" link="#FFFFFF" vlink="#FFFFFF" alink="#00E0FF">
<font color=#EEEEEE face=arial, verdana, courier size=2>
<center><h1>Chronikz VI<br></h1></center>
<br><br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b><h3>Chien m&eacute;chant ?</h3></b>
<br>			
Tous les jours j'utilise le R (ndSmeita: le 'R', c'est le RER...), le Metro et le Bus pour rejoindre mon lieu d'enseignement
et d'&eacute;ducation ( c joliement dit) ! Je sais vous vous en moquez comme de votre premier steack frite,
mais moi je rigole bien dans le R ! En fait je dois avoir un aimant ou un talisman attirant tout les couillons de la planete !<br><br>

Quand je me pose dans le R y a toujours une bonne femme pour taper des feintes sur moi, je m'explique  :<br>
Je suis assis, il y a 3 places &agrave; cote de moi, tout le wagon est plein (heure de pointe oblige)
et l&agrave; une vielle truie monte dans le wagon cherche du regard une place assise, en trouve une
dans mon secteur, s'approche jusqu'&agrave; ce trouver face &agrave; moi, son oeil s'ouvre en grand :
elle s'arrete net genre je-voulais-m'assoir-mais-en-fait-je-reste-debout et attend 
la station suivante qu'un "autre" si&egrave;ge se lib&egrave;re (meme si celui-ci est moins accessible) !
<br><br>
Vous pensez certainement que je la joue parano et que ce n'est qu'une coïncidence mais je 
n'en aurais pas parl&eacute; si cela m'&eacute;tais arriv&eacute; qu'une fois ... mais c'est une scene au moins 
hebdomadaire (&agrave; peu de chose pr&egrave;s, on change les acteurs et on recommence).<br>
Moi j'en ris, bon c'est vrai c'est pas toujours le cas, j'aimerais parfois en d&eacute;rouler une
(de vielle peau)...<br><br>
Je ne vais pas imagin&eacute; les causes de ce genre de situation, mais voil&agrave;, je veux donner ma vision
(que vous le vouliez ou non : c'est la seule chose que je sache faire) de mon univers pour
contre-balancer l'image que les bourgoise du 'R' ont de la cit&eacute; !<br>
<br>
Bon d'abord, la France n'a rien &agrave; envier aux States, au niveau de la violence ce n'est pas 
&eacute;quivalent mais sinon c'est la même : toujours des gars qui gal&egrave;rent.<br>

C'est &eacute;trange mais les cit&eacute; ne se sont pas cr&eacute;er dans le meme &eacute;tat d'esprit qu'actuellement :<br>
apr&egrave;s la guerre, il faut reconstruire, la France manque de main d'oeuvre, l'Etat fait appel aux ouvriers &eacute;trangers (merci &agrave; l'Afrique again),
on entre de bon coeur dans la societe de consommation telle qu'on la connais aujourd'hui.
Mais comme il a fallut loger les nouveaux arrivants des travaux ont &eacute;t&eacute; entrepris pour r&eacute;pondre
&agrave; la demande croissante de logement. Les immigr&eacute;s n'&eacute;tant pas, &agrave; leur arriv&eacute;, plein aux as, 
il fallait que les logement ne sois pas tres cher donc : compact et voil&agrave; c'est la naissance
des cages &agrave; poules en b&eacute;ton (ndSmeita: comprenez HLM...).
<br><br>
Fini pour l'historique.<br>
Au journal on montre souvent la cit&eacute; de 2 mani&egrave;res distinctes et dans 2 cas seulement :<br>
	<b>*</b> apr&egrave;s un probleme entre les forces de l'ordres et les "sauvageons" <br>
	<b>*</b> quand il n'y a plus rien d'interressant ailleurs !<br><br>

Quand le journal est trop court, on &agrave; toujours droit au reportage ridicule sur la cit&eacute; genre :<br>
'Ouais, dans le quartier des Lilas &agrave; machin truc chouette les jeunes de la cit&eacute; participe
&agrave; des activit&eacute; visant &agrave; canaliser les &eacute;nergies ... blabla ...' avec interview des plus jeunes 
(10-12ans) pour leur faire dire que c'est bien la cit&eacute; et que c'est gentils de les laisser vivre
dans un immeuble de 16 &eacute;tages, au fin fond  d'une zone industrielle...merci monsieur la France.<br><br>

C'est rageant, toujours les memes truc sans interet histoire de rassurer l'opinion publique,
pour dire que dans les cit&eacute;s il n'y a pas QUE des vilains casseurs mais qu'il y reste un espoir,
pour ces JEUNES !<br>
Enfin bref si ça peut les rassurer.... why not ?<br><br><br>

Dans le deuxi&egrave;me cas on parle beaucoup des d&eacute;gats occasionn&eacute; par la jeunesse mais peu des
raisons qui les ont amen&eacute;s &agrave; en venir au combat : r&eacute;cemment un "jeune" s'est fait d&eacute;scendre 
&agrave; coup de fusil &agrave; pompe dans un commissariat. Je vous parie qu'on entendra pas les suites de 
cette histoire, moi je demande : comment vous voulez que des gars r&eacute;agissent autrement quand 
leur pote se fait tuer alors qu'il est menott&eacute; &agrave; un radiateur d'un commissariat ?
<br><br>
Mais ce n'est pas vraiment ça la cit&eacute; : il faut arr&eacute;ter de penser que des voiture brule tous
les jours dans toutes les cit&eacute;, que les vitrines explosent toutes les semaines ou qu'on ne peut
pas sortir sans trouver son logement nettoyer au retour !
<br><br>
La v&eacute;rit&eacute; c'est que les politiciens ont pens&eacute; &agrave; une &eacute;poque qu'il valait mieux que les immigr&eacute;s
ne se m&eacute;lange pas trop avec "les vrais fraçais", ainsi on a droit &agrave; tous les commerces
n&eacute;cessaire &agrave; cot&eacute; de chez soi : pas la peine d'aller &agrave; Paris ou ailleurs :
Il y a E.D., un buraliste, un cabinet m&eacute;dical, une pharmacie, un bureau de poste,
un centre de loisir... bref de quoi vivre en autarcie !<br>
Quand en plus de cel&agrave;, on qualifie votre quartier de Z.U.S.,
votre &eacute;tablissement scolaire comme &eacute;tant en Z.E.P.
(comprenez par l&agrave; Zone Urbaine Sensible et Zone d'Education Prioritaire),
la r&eacute;action rationnelle des gens est de se renferm&eacute; et d'apprendre &agrave; vivre sans les "autres" 
(comprendre tout ceux qui sont ext&eacute;rieur &agrave; la cite) et &agrave; ne faire confiance qu'aux siens.
<br><br>
La rue est une &eacute;cole, je le confirme et les mauvaises actions des jeunes, 
ne sont pas toujours directement imputable aux parents qui auraient donn&eacute; une mauvaise 
&eacute;ducation &agrave; leurs enfants (comme j'ai pu l'entendre r&eacute;cemment) ! 
Dans la rue on apprend pas des leçons comme &agrave; l'&eacute;cole mais une ligne de conduite et 
l'enfant sait parfaitement faire la diff&eacute;rence entre la cour de r&eacute;cr&eacute; et la maison : 
ce qui veut dire que meme s'il semble se tenir convenablement avec ses parents rien ne dit
qu'il ne joue pas les terreurs une fois sortis.
<br><br><br>
C'est donc dehors (&agrave; l'&eacute;cole &eacute;galement) qu'on apprend quelques directive : <br><br>
1)<b>le silence</b> : en gros tu ne donne personne sinon t'es foutu, une r&eacute;putation se fait en 10
seconde chrono ; si tu lache un nom tu porte une &eacute;tiquette sur le front &agrave; vie !<br><br>
2)<b>le respect</b> :c'est g&eacute;n&eacute;rique comme mot, on l'entend souvent &agrave; tort et &agrave; travers 
mais dans les faits ce n'est pas le respect au sens pur c'est plutôt de la crainte 
(quant on est petit) il faut toujours être pr&egrave;t &agrave; d&eacute;rouler un gars !<br><br>
3)<b>la gueule</b> : faut toujours être pret &agrave; l'ouvrir. Si on te regarde fixement, 
faut pas lacher le regard et être pret &agrave; ouvrir sa gueule. C'est celui qui SEMBLE le plus
m&eacute;chant, qui  met le plus de pression quand il parle, qui se fait respecter ... rien d'autre !<br><br>
4)<b>le combat</b> : quand on est petit, c'est un point tres important (et fr&eacute;quent) 
car tout le monde se souvient du jour où untel ou deuxtel t'as d&eacute;calquer sur le mur.
Il est donc necessaire pour le gosse d'etre pret &agrave; cogner un gars pour une broutille
juste pour que les autres voient qu'il ne rigole pas.<br><br>

C'est &agrave; peu pr&egrave;s tout ce qu'on apprend dans la rue quand on est jeune et plus on viellit 
et plus on met l'accent sur la 1 et la 3 mais parfois on en vient aux mains et, &eacute;videmment
les coups sont beaucoup plus lourd qu'&agrave; l'&eacute;cole primaire !
Mais c'est plus rare qu'on veut le laisser croire.
En viellissant on se rend compte du merdier dans lequel on vit, on manque d'espace 
toute excuse est bonne pour sortir du quartier, mais on a pas oubli&eacute; d'où l'on vient
et ce que l'on y a apprit. Le temps passe et certains apr&egrave;s avoir &eacute;chou&eacute; 1 fois,
2 fois devant l'entretien d'embauche, succombe &agrave; l'argent facile...
<br><br>
Alors c'est vrai des gars tiennent les murs toute la nuit mais comment pourrais-je leur 
en vouloir, ils &eacute;taient &agrave; l'&eacute;cole avec moi certain avaient des possibilit&eacute;s, 
mais comme pour tout le monde la vie est une succession de choix, un mauvais choix 
peut en conditionner d'autres. J'aurais pu moi aussi faire de l'argent, 
c'est si simple que tout le monde y a pens&eacute; au moins un jour mais...
Il suffit d'une personne pour ne pas tomber dans ce pi&egrave;ge...
faut il encore que cette personne soit l&agrave; au bon moment.<br><br>

Ceux qui pense que les parents ne devraient pas laisser les gosses trainer jusque tard 
le soir devraient se poser au moins une question :
Comment dire &agrave; des gosses de ne pas sortir alors que dans un 5 pi&egrave;ces vivent 9 personnes,
70 m&egrave;tres carr&eacute; (chiottes comprise) ? De plus les parents bossent dur et ne peuvent
pas toujours être derri&egrave;re eux, tout le monde &agrave; des probl&egrave;mes...<br><br>

Mais n'est ce pas plutôt parce que, comme les bourgeoises qui me toisent le matin, 
certains sont catalogu&eacute; en 3 secondes et recal&eacute; aussi sec, que la rage monte et qu'on a
besoin de se sentir compris aupr&egrave;s d'autres, qui connaissent, eux aussi, ces injustices ?
Ces "sauvageons" comme dit Karl Zero, ne veulent rien de plus que vivre bien, et je suis pret 
&agrave; parier tout ce que je possede (ça ne vas pas chercher loin : mon ordinateur) 
que ces mêmes gars 20 ans en arriere dans une famille "charg&eacute;e" du 16 &egrave;me serait devenu 
des cols blancs, Beau Cul Belle Gueule pur produit de notre societe ....
 <br><br>
Je voulais donner un autre regard sur l'endroit dont tous les journalistes parlent au 20 heures
mais qu'ils ne connaissent pas, j'aurais voulu que les miens vivent dans l'oppulence...
mais bon. Je ne regrette pas de vivre dans une cite, c'est nul mais au moins je connais la 
valeur d'un franc. Quand on habite Mante-la-jolie, la Courneuve, Montreuil, Saint-Denis, Vitry,
Argenteuil, Nanterre, Chatillon, Noisy, Bondy ou Sarcelles il faut prouver 2 fois plus qu'un
autre que l'on m&eacute;rite un job, et bien alors on leur prouvera et temps pis si on touche pas des 
liasses ... Comme certains de mon quartier je compte quitter la cit&eacute; un jour c'est le but 
ultime mais, non, je ne renierais pas les miens même si un jour je roule en Merco classe S Benz
toutes options, car je sais que j'aurais pu être beaucoup moins chanceux !!
<br><br><br><center>Comme dit l'autre la cit&eacute; c'est pas Thoiry !
<br>
<br>
</center><br><br><br>



P.S. : A toutes les truies insolentes du R et du Trome qui me regarde de haut en bas 
de droite &agrave; gauche, les yeux brillants de vice et d'antipathie allez chier, vous avez beau me
tenter chaque semaine, pour que je vous casse en deux afin de pouvoir crier &agrave; l'agression et 
me traiter de voyou je ne c&eacute;derais pas, quand il s'agit de jouer au con je gagne toujours et 
l&agrave; encore je compte gagner !
<br><br>
<font size="-2" color="Silver">[interlude de Smeita]</font><br>
Pour moi, la cit&eacute;, c'est pas si mal...J'prefere vivre ici que dans le 
16eme avec les viocs...Sans rire, ici on a plein de truc 'tomb&eacute; du camion' ;).
Au fait Timy, c'est quand que tu me ramene mon Compac Armada ??<br><br>
C'est vrai que des fois les gens sont un peu amer avec nous, comme si on sentait mauvais 
itou...Mais bon, j'me balance de ce que pense ces vieilles sa#$*!%.
Je sais ce que je vaux et j'imagine ce qu'elles valent...<br>
<font size="-2" color="Silver">[Fin d'interlude]</font><br>
</font></font></body></html>