<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="6" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Arnaque #1</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>By Veinscuts</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Ahlala, moi je trouve que se faire des Pabx pour choper
du matos c'est quand meme un peu vache...</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>France Telecom va r&eacute;clamer sa thune et vous ellez
peut etre mettre en faillite un soci&eacute;t&eacute; (c'est d&eacute;j&agrave; arriv&eacute;, les mecs se commandaient
des home-cin&eacute;ma, des platines dvd et tout...) en vous acharnant &agrave; 100 mecs sur la meme Pabx.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Comment faire pour faire payer France Telecom et pas
une pauvre soci&eacute;t&eacute; qui n'as rien fait ?</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>C'est TRES simple:</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Je vous explique comment j'ai eu cette webcam qui me
permet de vous donner une photo de moi:</B></FONT></P>
<P ALIGN="CENTER"><IMG SRC="nours.jpg" WIDTH="352" HEIGHT="288" ALIGN="BOTTOM" BORDER="0"><FONT SIZE="4" COLOR="#FF0000"
FACE="Comic Sans MS"><B></B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" COLOR="#FF0000" FACE="Comic Sans MS"><B>moi</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" COLOR="#FF0000" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Pour cela, il m'a fallu le g&eacute;n&eacute;rateur de
carte bleue CCMaker (disponible sur le site de Rhylkim), un peu de courage, du temps, et enfin l'assistant de connexion
&agrave; internet (tapez rechercher=&gt;assistant)</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Je me suis connect&eacute; &agrave; l'assistant et j'ai demand&eacute; un nouveau fournisseur, il m'a propos&eacute;
6 fournisseurs, j'ai choisi Wanadoo, j'ai cr&eacute;e un abonnement &agrave; l'aide du g&eacute;n&eacute;rateur
(la date d'expiration ne sert &agrave; rien, moi je mets tout le temps 11/99 et &ccedil;a marche) en prenant l'OPTION
MINITEL et l'abonnement illimit&eacute; (tant qu'&agrave; faire).</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>J'ai ensuite cr&eacute;e une dizaine de comptes comme
&ccedil;a et je me suis connect&eacute; en utilisant un kit de connexion wanadoo (et en rajoutant 3651 devant le
num&eacute;ro je sais pas si c'est bidon ou non mais je ne perds rien de l'essayer).</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>J'ai fait 3617 SEL et j'ai command&eacute; mon mat&eacute;riel
(une webcam) &agrave; l'adresse de mr Pascal Legitimus, 3 rue des inconnus 75016 Paris</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>je me suis connect&eacute; et j'ai attendu (en n'oubliant
pas de taper sur suite chaque 3 minutes), j'ai ensuite vid&eacute; un compte, deux comptes, trois comptes, neuf
comptes...(il fallait arriv&eacute; &agrave; 200 minutes de connexion)</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Neuf comptes pour 197 minutes de connexion, mais o&ugrave;
sont les trois qui restent ?</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Vous vous doutez bien que si je m'&eacute;tait connect&eacute;
les deux cents minutes, la webcam serait parti chez n'importe qui donc je me suis d&eacute;connect&eacute; pour
eviter de taper mon adresse en passant pas wanadoo, et je me suis connect&eacute; de chez moi au minitel pour retaper
l'adresse et rester les trois minutes qui restent.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>J'ai ensuite attendu une dizaine de jours et j'ai re&ccedil;ut
ma chouette webcam.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Bon, je ne dis pas qu'il y a aucun risque, je vous conseille d'utiliser la m&eacute;thode d&eacute;crite dans Snapscan
#1 (3dfx) pour r&eacute;cuperer le matos, moi tout ce que je sais, c'est que je suis pas encore tomb&eacute; et
que j'ai re&ccedil;ut mon materiel, mais au cas ou vous le faites de chez vous, voici la proc&eacute;dure &agrave;
suivre:</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Imprimez sur une feuille blanche:</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>&quot;D&eacute;sol&eacute; d'avoir pirat&eacute; votre
ligne et d'avoir abus&eacute; de votre sympathie. FUCK TELECOM</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Ps: je suis le coursier qui est pass&eacute; chercher
la cam&eacute;ra    sign&eacute;: Killer fou&quot;</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>cherchez votre boitier t&eacute;l&eacute;phonique (pour
cela relevez le numero qui se trouve au bas de votre porte le plus souvent), d&eacute;foncez le et coupez les cordons,
en rentrant chez vous d&eacute;crochez le t&eacute;l&eacute;phone, si vous avez une tonalit&eacute; c'est que le
voisin va pas etre content lol sinon c'est parfait,repartez &agrave; votre boitier </B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>et d&eacute;posez-y le message imprim&eacute;, maintenant
cachez la camera chez un pote ou alors bien cach&eacute;e chez vous.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Apellez France Telecom et dites leurs que vous avez un
probl&egrave;me avec votre ligne, il viendront constaterons le probl&egrave;me et en ouvrant la boite SURPRISE,
ils tomberont sur le gentil petit mot, et il ne pourront pas vous accuser.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Insistez pour vous faire rembourser en contestant toutes
les communications que vous n'avez pas pass&eacute;s ce qui leur mettra encore plus &agrave; l'esprit que vous
etes de bonne foi.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Conseil &eacute;vitez de parler de cette histoire au t&eacute;l&eacute;phone des fois que vous seriez sur &eacute;coute.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
Bonne bourre</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Salut</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FF0000" FACE="Comic Sans MS"><B></B></FONT></P>

<P><FONT SIZE="4" COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT SIZE="4" COLOR="#0099FF" FACE="Comic Sans MS"><B></B></FONT>

</BODY>

</HTML>