<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="6" FACE="Comic Sans MS"><B>Arnaque</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="6" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT SIZE="5" COLOR="#FF0000" FACE="Comic Sans MS"><B>Attention ne faites pas ce qui est marqu&eacute;, si
je l'ai mis dans arnaque c'est parceque le mec m'a fait marrer avec sa grosse arnaque a deux balles (je ne dis
pas qu'elle ne peut pas marcher, mais le truc a l'air trop facile et sans aucun danger, s'en ai trop beau pour
etre vrai)</B></FONT></P>

<P><FONT SIZE="6" FACE="Comic Sans MS"><B></B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>Attention cette arnaque peut rapporter extremement beaucoup mais peut
vous couter aussi quelques ann&eacute;es &agrave; l'ombre si vous ne vous y prenez pas assez bien.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B><BR>
Il faut d'abord avoir de l'argent &agrave; investir.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>Vous cr&eacute;ez deux comptes en banques, un au nom de la soci&eacute;t&eacute;
&quot;SADOBITE&quot;, et un autre au nom de la soci&eacute;t&eacute; Paul Eluard.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>Passez ensuite une pub dans un magazine de cul, pour la soci&eacute;t&eacute;
&quot;SADOBITE&quot; qui fournit des godes merveilleux qui augmentent le plaisir sexuel de 200%, garanti ou rembours&eacute;
sous 30 jours au prix fantastique de 250 balles qu'ils enverront sur le compte de Paul Eluard.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>Vous leurs renverrez ensuite un ch&egrave;que de la soci&eacute;t&eacute;
&quot;SADOBITE&quot; du montant de leur commande, avec un mot d'excuse disant que votre fournisseur ne vous a rien
envoy&eacute;, et vous esperez que le mec aura trop honte pour aller encaisser le ch&egrave;que.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>Sur 3000 commandes moins de 20 personnes ont &eacute;t&eacute; d&eacute;biter
le ch&egrave;que, ce qui fait un b&eacute;n&eacute;fice de 700.000 francs, et en continuant l'op&eacute;ration,
vous pouvez facilement vous payer des petites vacances &agrave; vie dans un pays au soleil, o&ugrave; l'on ne recherche
pas les escrocs.</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B></B></FONT></P>
<P ALIGN="RIGHT"><FONT SIZE="4" FACE="Comic Sans MS"><B></B></FONT></P>

<P ALIGN="RIGHT"><FONT SIZE="4" FACE="Comic Sans MS"><B>Un gentil lecteur qui nous a bien fait marrer malgr&egrave;s
que le truc pourrait marcher</B></FONT></P>

<P ALIGN="RIGHT"><FONT SIZE="4" FACE="Comic Sans MS"><B>Enfin quelqu'un qui voit les choses en grand</B></FONT></P>

<P ALIGN="RIGHT"><FONT SIZE="4" FACE="Comic Sans MS"><B>il s'appelle:</B></FONT></P>

<P ALIGN="RIGHT"><FONT SIZE="4" COLOR="#FF0000" FACE="Comic Sans MS"><B>DA NOM KI TUE-----&gt;  </B></FONT><FONT
SIZE="4" FACE="Comic Sans MS"><B>       DA KILLER OF DA MOON</B></FONT>

</BODY>

</HTML>