<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Mac">
  <TITLE>Document sans titre</TITLE>
</HEAD>
<BODY BACKGROUND="fondsi.jpg" tppabs="c:/mat/cnrs/fondsi.jpg">

<P><A NAME="Editorial"></A><IMG SRC="edito.gif" tppabs="c:/mat/cnrs/edito.gif" ALIGN="LEFT" WIDTH="336" HEIGHT="117" NATURALSIZEFLAG="3"></P>

<BLOCKQUOTE>
  <H2 ALIGN="CENTER">Pas de tr&ecirc;ve de No&euml;l sur Internet</H2>
</BLOCKQUOTE>

<P>&nbsp;</P>

<P>Au Moyen-Age, il &eacute;tait d'usage parmi les preux chevaliers de remettre
l'&eacute;p&eacute;e au fourreau au moment de No&euml;l. Au coin de l'&acirc;tre,
ils avaient tout loisir pour &eacute;voquer leurs combats, conter fleurette
&agrave; leur dame ou vider force hanaps. &Agrave; l'extr&ecirc;me fin du
second mill&eacute;naire, les soudards de l'Internet s'ennuient tellement
au moment des f&ecirc;tes qu'il ne leur reste que leur console pour donner
un peu de piquant &agrave; leur morne existence.</P>

<P>Unit&eacute; XXX, entre le 24 d&eacute;cembre et le 3 janvier : l'activit&eacute;
scientifique ayant fait rel&acirc;che, un petit sournois est venu d&eacute;poser
quelques 700 Mo d'images r&eacute;pr&eacute;hensibles sur le FTP-anonyme
du laboratoire avant d'en diffuser l'adresse par les News. Pendant une semaine,
les amateurs du genre ont eu tout le temps pour se servir avant que l'ing&eacute;nieur
syst&egrave;me, intrigu&eacute; &agrave; son retour de vacances par cet
afflux inhabituel de connexions, ne mette un terme &agrave; ce recel involontaire
de documentation d&eacute;lictueuse.</P>

<P>Moralit&eacute; (elle en a pris un coup...) : lorsqu'on ne peut contr&ocirc;ler
quotidiennement les &quot;logs&quot;, il est prudent d'adopter une configuration
fermant la porte aux intrus.</P>

<P>Unit&eacute; YYY, dot&eacute;e de gros moyens informatiques, entre le
23 d&eacute;cembre et le 2 janvier : un pirate, qui a usurp&eacute; une
identit&eacute; client d'un provider, s'introduit sur le serveur WEB. De
l&agrave; il lance des attaques nombreuses et vari&eacute;es vers les machines
du laboratoire. L'heure des attaques est r&eacute;v&eacute;latrice de sa
volont&eacute; de dissimuler ses manoeuvres frauduleuses : vendredi 27 d&eacute;cembre
entre 19 h 30 et 22 h 00, lundi 30 d&eacute;cembre entre 00 h 00 et 01 h
00, jeudi 2 janvier entre 03 h 00 et 04 h 00... Suivies au jour le jour
par le responsable s&eacute;curit&eacute; de l'unit&eacute;, ces attaques
ont &eacute;chou&eacute;. Comme le permet d&eacute;sormais la r&eacute;glementation,
le CNRS porte plainte.</P>

<P>Moralit&eacute; : vigilance et professionnalisme sont les meilleurs garants
du maintien en &eacute;tat de nos syst&egrave;mes d'information.</P>

<P>La criminalit&eacute; trouve sur Internet un immense et nouveau champ
d'action. Lutter contre elle est un devoir pour chacun d'entre nous car
il suffit parfois d'un seul mot de passe mal choisi pour ouvrir la porte
&agrave; ceux qui ne cherchent qu'a nuire. C'est l'image de nos laboratoires
qui est en jeu et, au-del&agrave;, la cr&eacute;dibilit&eacute; de la Recherche.</P>

<P><B><EM>Philippe Schreiber,</EM></B><EM><BR>
Fonctionnaire de D&eacute;fense</EM><IMG SRC="150pix.gif" tppabs="c:/mat/cnrs/150pix.gif" WIDTH="150" HEIGHT="3" NATURALSIZEFLAG="3" ALIGN="BOTTOM"><IMG SRC="150pix.gif" tppabs="c:/mat/cnrs/150pix.gif" WIDTH="150" HEIGHT="3" NATURALSIZEFLAG="3" ALIGN="BOTTOM"></P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H2 ALIGN="CENTER"><A NAME="Pirater"></A></H2>

<H1 ALIGN="CENTER"><FONT COLOR="#AF0000" SIZE="+4">Pirater n'est pas jouer...</FONT></H1>

<H1 ALIGN="CENTER">&nbsp;</H1>

<P>&nbsp;</P>

<P>Dans tous les laboratoires du CNRS, on rel&egrave;ve depuis quelque temps
une recrudescence des tentatives de p&eacute;n&eacute;tration, de d&eacute;tournement
de ressources et des piratages informatiques divers. Les mesures que prennent
les laboratoires pour se d&eacute;fendre contre ce type de d&eacute;linquance
se r&eacute;v&egrave;lent &ecirc;tre souvent insuffisantes. Dans la lutte
symbolique entre le &quot;glaive&quot; et le &quot;bouclier&quot;, l'avantage
est incontestablement aujourd'hui du c&ocirc;t&eacute; du glaive. C'est
pourquoi la plupart des pays d&eacute;velopp&eacute;s durcissent leur l&eacute;gislation.</P>

<P>Aux USA, un jeune &eacute;tudiant de 20 ans, Nicolas Ryan, a &eacute;t&eacute;
condamn&eacute; &agrave; 250 000 $ et cinq ann&eacute;es de prison pour
avoir, entre juin et d&eacute;cembre 1995, ill&eacute;galement utilis&eacute;
les services en ligne du r&eacute;seau AOL. Pour ce d&eacute;lit, il s'est
servi du logiciel &quot;AOL4Free&quot; - disponible en libre service sur
l'Internet - qu'il a tr&egrave;s l&eacute;g&egrave;rement modifi&eacute;.
N. Ryan n'a pas &eacute;t&eacute; condamn&eacute; pour avoir con&ccedil;u
ce logiciel de piratage, ni pour l'avoir diffus&eacute;, mais pour avoir
acc&eacute;d&eacute; ill&eacute;galement au r&eacute;seau. D&eacute;lit
qu'il partageait avec pr&egrave;s d'un million et demi de personnes ! On
estime la valeur du temps de connexion pirat&eacute; pendant ces six mois
&agrave; moins de 60 $. Ce fait divers montre la d&eacute;termination de
la justice am&eacute;ricaine &agrave; combattre la &quot;d&eacute;linquance
informatique&quot;.</P>

<P>Chez nous, devant ce type de d&eacute;linquance, certains restent encore
un peu r&eacute;ticents : &quot;Internet, c'est la libert&eacute; ; le piratage
est le prix &agrave; payer pour cette libert&eacute;&quot; disent-ils. Oui,
mais cette d&eacute;linquance est &eacute;volutive. Si on la laisse se d&eacute;velopper,
elle deviendra tr&egrave;s rapidement incontr&ocirc;lable et &quot;l'espace
de libert&eacute;&quot; peut se transformer en l'espace de toutes les mafias.
Nos syst&egrave;mes d'information interconnect&eacute;s en r&eacute;seau
sont, pour la qualit&eacute; de notre recherche et son ouverture au monde,
trop importants pour qu'on laisse d&eacute;river le syst&egrave;me jusqu'&agrave;
ce que la situation devienne incontr&ocirc;lable. Se prot&eacute;ger - c'est
vrai - demande des moyens suppl&eacute;mentaires et beaucoup de travail
pour les responsables des syst&egrave;mes. Mais c'est avant tout, pour tous,
une certaine discipline personnelle et une organisation rigoureuse de l'administration
du r&eacute;seau :</P>

<UL>
  <LI>D&eacute;terminer clairement les responsabilit&eacute;s de chacun dans
  le r&eacute;seau du laboratoire.
  <LI>Ne pas connecter directement au r&eacute;seau interne les serveurs
  w3 et ftp et l'isoler de l'ext&eacute;rieur par un garde-barri&egrave;re.
  <LI>Surveiller attentivement l'activit&eacute; r&eacute;seau (TCP/WRAPER),
  v&eacute;rifier r&eacute;guli&egrave;rement ses fragilit&eacute;s (SATAN),
  contr&ocirc;ler la solidit&eacute; des mots de passe (CRACK) et leur dur&eacute;e
  de vie, etc.
</UL>

<P>Les directions des laboratoires doivent &ecirc;tre d&eacute;termin&eacute;es
&agrave; combattre toute tentative de p&eacute;n&eacute;tration ill&eacute;gale,
en concertation avec le Fonctionnaire de d&eacute;fense et avec les conseils
du service juridique du CNRS. Peut-&ecirc;tre est-ce ainsi que nous d&eacute;couragerons
les vocations malsaines et pourrons maintenir la d&eacute;linquance informatique
dans des limites &quot;acceptables&quot; ? C'est ce qu'il faut comprendre
du verdict extr&ecirc;mement s&eacute;v&egrave;re de la justice am&eacute;ricaine
dans cette affaire Nicolas Rya, verdict qui fut tr&egrave;s m&eacute;diatis&eacute;
outre-Atlantique.</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H3 ALIGN="CENTER"><A NAME="Ipgp"></A></H3>

<H1 ALIGN="CENTER"><FONT COLOR="#AF0000" SIZE="+4">L'exp&eacute;rience venue
d'ailleurs</FONT></H1>

<P><I>Dans ce nouveau num&eacute;ro, nous continuons notre visite des grands
&eacute;tablissements de recherche et d'enseignement par l'<FONT COLOR="#00AF00">Institut
de Physique du Globe de Paris</FONT> <B>(IPGP)</B>. <FONT COLOR="#AF0000">Pierre
Fran&ccedil;ois JEANNIN</FONT>, ing&eacute;nieur de recherche premi&egrave;re
classe, et <FONT COLOR="#AF0000">Eduardo SEPULVEDA</FONT>, ing&eacute;nieur
d'&eacute;tude, veulent bien &ecirc;tre nos guides dans cette visite et
nous pr&eacute;senter les solutions qu'ils ont mises en uvre dans ce grand
institut.</I></P>

<P><B><FONT COLOR="#F40153">&nbsp;</FONT></B></P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<H2 ALIGN="CENTER"><FONT COLOR="#F40153">La s&eacute;curit&eacute; informatique
&agrave; l'Institut de Physique du Globe de Paris</FONT></H2>

<P ALIGN="CENTER"><FONT COLOR="#000000">par </FONT><A HREF="mailto:pfj@ipgp.jussieu.fr">Pierre
Fran&ccedil;ois Jeannin</A></P>

<P ALIGN="CENTER"><FONT COLOR="#000000">et </FONT><A HREF="mailto:edo@ipgp.jussieu.fr">Eduardo
Sepulveda</A></P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<H3>Quelques mots pour pr&eacute;senter l'IPGP</H3>

<P>L'Institut de Physique du Globe de Paris, autonome depuis mars 1990,
est un grand &eacute;tablissement sous tutelle du Minist&egrave;re de l'&Eacute;ducation
Nationale, de l'Enseignement Sup&eacute;rieur et de la Recherche. Il travaille
en liaison avec les grands organismes de recherche nationaux et internationaux
: CNRS, INSU, CEE, ESA, NASA... Il a pour missions :</P>

<UL>
  <LI>la recherche fondamentale, notamment dans le domaine des Sciences de
  la Terre,
  <LI>l'enseignement : site d'une &eacute;cole doctorale commune avec l'Universit&eacute;
  Paris VII, l'Institut est habilit&eacute; &agrave; d&eacute;livrer deux
  DEA, un DESS et le doctorat,
  <LI>l'observation des ph&eacute;nom&egrave;nes naturels et la pr&eacute;vention
  des risques sismiques et volcaniques.
</UL>

<P>L'IPGP rassemble environ quatre cents personnes : cent vingt chercheurs
permanents, une centaine de personnels ATOS-ITA, cent trente th&eacute;sards
et &eacute;tudiants de DEA et DESS, et de nombreux visiteurs &eacute;trangers.</P>

<P>L'IPGP est organis&eacute; en D&eacute;partements scientifiques, pour
l'essentiel constitu&eacute;s d'&eacute;quipes associ&eacute;es au CNRS
: Sismologie, Magn&eacute;tisme, Tectonique, G&eacute;ochimie et G&eacute;omat&eacute;riaux.
Les autres d&eacute;partements ont une vocation horizontale entre ces cinq
d&eacute;partements : Enseignement, Spatial, Mod&eacute;lisation Num&eacute;rique
et Observatoires. &Agrave; ces unit&eacute;s, il faut ajouter les &quot;Services
G&eacute;n&eacute;raux&quot; qui regroupent les services administratifs
(budget, personnel, scolarit&eacute;, service int&eacute;rieur), la biblioth&egrave;que,
les relations internationales, les ateliers et le service informatique.</P>

<P>Les &eacute;quipes de l'IPGP sont diss&eacute;min&eacute;es sur plusieurs
sites :</P>

<UL>
  <LI>en r&eacute;gion parisienne : Campus Jussieu (Paris), et Observatoire
  de St-Maur-des-Foss&eacute;s (Val de Marne),
  <LI>en province : Observatoire Magn&eacute;tique National de Chambon la
  For&ecirc;t (Loiret), et Station Sismique de Saint-Sauveur Badol (Loire),
  <LI>dans les d&eacute;partements d'outre-mer : Observatoire Volcanologique
  de la Soufri&egrave;re (Guadeloupe), Observatoire Volcanologique de la
  Montagne pel&eacute;e (Martinique) et Observatoire Volcanologique du Piton
  de la Fournaise (La R&eacute;union),
  <LI>&agrave; l'&eacute;tranger : Observatoire G&eacute;ophysique d'Arta
  (Djibouti) et Observatoire Volcanologique de Karthala (Comores).
</UL>

<P>L'IPGP est sans aucun doute le premier institut de ce genre en Europe
et l'un des trois meilleurs centres de Sciences de la Terre au monde.</P>

<P>Une pr&eacute;sentation de l'IPGP (d&eacute;partements, th&egrave;mes
de recherche, annuaire de l'&eacute;tablissement, programme des conf&eacute;rences,
actualit&eacute;, base de donn&eacute;es, etc.) est propos&eacute;e sur
le serveur d'informations http://www.ipgp.jussieu.fr.</P>

<P>&nbsp;</P>

<H3>Le Service Informatique.</H3>

<P>Les trois-quarts des informaticiens de l'IPGP sont r&eacute;partis dans
la plupart des &eacute;quipes de recherche, en prise directe avec les programmes
scientifiques, pour tout ce qui concerne l'acquisition, le contr&ocirc;le
et le traitement des observations, la diffusion et l'archivage des donn&eacute;es,
le d&eacute;veloppement d'algorithmes num&eacute;riques, etc. Ils ont g&eacute;n&eacute;ralement
en charge l'administration et la maintenance des stations de travail de
leur &eacute;quipe.</P>

<P>Le Service Informatique a en charge les moyens informatiques d'int&eacute;r&ecirc;t
g&eacute;n&eacute;ral affect&eacute;s &agrave; l'enseignement et la recherche,
et les infrastructures de r&eacute;seau de l'&eacute;tablissement.</P>

<P>Les quatre ing&eacute;nieurs du &quot;SI&quot; ont pour t&acirc;che la
gestion des moyens communs : les r&eacute;seaux locaux et leur interconnexion,
les salles utilisateurs, les mat&eacute;riels et logiciels d'utilit&eacute;
g&eacute;n&eacute;rale, l'assistance aux utilisateurs, la coordination avec
les informaticiens des &eacute;quipes, l'administration des stations de
travail des &eacute;quipes d&eacute;pourvues d'informaticien, et la supervision
des consignes de s&eacute;curit&eacute;.</P>

<P>&nbsp;</P>

<H3>Infrastructure et &eacute;quipement.</H3>

<P>Hormis les observatoires implant&eacute;s dans les DOM et &agrave; l'&eacute;tranger,
pour lesquels les r&eacute;seaux locaux sont en phase de r&eacute;alisation,
tous les autres sites de l'IPGP sont interconnect&eacute;s au r&eacute;seau
parisien par liaison Num&eacute;ris ou hertzienne.</P>

<P>Le r&eacute;seau de l'Institut sur le Campus Jussieu b&eacute;n&eacute;ficie
des infrastructures communes compos&eacute;es d'une dorsale Ethernet et
d'un anneau FDDI, d'un serveur d'acc&egrave;s via le r&eacute;seau t&eacute;l&eacute;phonique
commut&eacute; et d'un acc&egrave;s &agrave; 34 Mbits/s &agrave; RERIF et
RENATER.</P>

<P>Le r&eacute;seau local, constitu&eacute; d'un anneau FDDI et de segments
Ethernet et Appletalk, est reli&eacute; au r&eacute;seau FDDI du Campus.
Le parc informatique comprend plus de 320 nuds, en majorit&eacute; des stations
et des serveurs sous Unix (DEC, HP, IBM, SGI, SUN, TMC), mais aussi des
micros (Mac et PC) et des terminaux X.</P>

<P>&nbsp;</P>

<H3>La s&eacute;curit&eacute; informatique &agrave; l'IPGP.</H3>

<P>Quelques constats en guise d'introduction :</P>

<UL>
  <LI>Devant l'augmentation, l'&eacute;volution et l'h&eacute;t&eacute;rog&eacute;n&eacute;it&eacute;
  des machines install&eacute;es dans un grand &eacute;tablissement comme
  l'IPGP, d'une part, et la tendance actuelle &agrave; r&eacute;duire les
  effectifs en personnel technique, d'autre part, il n'est pas possible de
  contr&ocirc;ler ni de s&eacute;curiser en permanence l'ensemble du parc
  de stations de travail connect&eacute;es aux r&eacute;seaux informatiques.
  <LI>Avec l'ouverture tous azimuts du r&eacute;seau de la recherche, il
  est indispensable de se prot&eacute;ger des malveillances externes. L'Institut,
  comme de nombreux &eacute;tablissements de recherche, a d&eacute;j&agrave;
  fait l'objet d'intrusions, qui, si elles n'ont pas &eacute;t&eacute; d&eacute;sastreuses
  localement, ont servi de rebonds pour attaquer d'autres sites.
  <LI>Une particularit&eacute; des &eacute;quipes de recherche de l'Institut
  est leur c&ocirc;t&eacute; &quot;globe-trotter&quot;, et donc leur vuln&eacute;rabilit&eacute;
  &agrave; se faire &eacute;couter leur compte et leur mot de passe.
  <LI>Dans la communaut&eacute; des Sciences de la Terre, o&ugrave; les collaborations
  et les &eacute;changes internationaux sont privil&eacute;gi&eacute;s, o&ugrave;
  les programmes de recherche engagent des &eacute;quipes du monde entier,
  et o&ugrave; le libre acc&egrave;s aux bases de donn&eacute;es est la r&egrave;gle,
  la sensibilisation des utilisateurs de ressources informatiques aux probl&egrave;mes
  de s&eacute;curit&eacute; n'est pas imm&eacute;diate. Pour l'ing&eacute;nieur
  de s&eacute;curit&eacute;, il n'est pas facile de concilier facilit&eacute;
  et confort des &eacute;changes avec les inconv&eacute;nients li&eacute;s
  au contr&ocirc;le d'acc&egrave;s et &agrave; la surveillance de l'int&eacute;grit&eacute;
  des donn&eacute;es et des applications. En bref, tant qu'ils n'ont pas
  &eacute;t&eacute; pirat&eacute;s, les utilisateurs acceptent mal ce type
  de contraintes.
</UL>

<P>&nbsp;</P>

<P>Il a &eacute;t&eacute; men&eacute; cependant un certain nombre d'actions
dans le cadre d'une politique globale de s&eacute;curit&eacute; au niveau
de l'&eacute;tablissement :</P>

<UL>
  <LI>R&eacute;daction d'une &quot;charte de bonne utilisation des ressources
  informatiques de l'IPGP&quot; rappelant les textes l&eacute;gislatifs en
  vigueur et le r&egrave;glement int&eacute;rieur. Ce document qui doit &ecirc;tre
  lu et sign&eacute; par tous les utilisateurs, a pour but de sensibiliser
  aux probl&egrave;mes de s&eacute;curit&eacute;.
  <LI>Nomination de correspondants s&eacute;curit&eacute; dans chaque d&eacute;partement,
  afin d'appliquer les consignes et les corrections diffus&eacute;es par
  le CERT-RENATER.
  <LI>Acquisition et distribution gratuite des logiciels anti-virus AVP,
  FPROT, SAM, TBAV &agrave; toutes les &eacute;quipes.
  <LI>V&eacute;rification des mots de passe, qui est la composante la plus
  simple et la plus importante de la cha&icirc;ne de s&eacute;curit&eacute;
  du r&eacute;seau, &agrave; l'aide du logiciel &quot;crack&quot; (domaine
  public). Les r&eacute;sultats de ce test (10 % de mots de passe triviaux,
  30 % d&eacute;chiffr&eacute;s en quelques heures) ont permis de renforcer
  la campagne de sensibilisation aupr&egrave;s des utilisateurs, et de leur
  faire modifier leur mot de passe. La commande d'origine &quot;password&quot;
  ayant &eacute;t&eacute; remplac&eacute;e par la version modifi&eacute;e
  &quot;yapasswd&quot; qui v&eacute;rifie la non trivialit&eacute; du mot
  de passe choisi.
  <LI>Journalisation des activit&eacute;s. Pour suivre le comportement d'un
  syst&egrave;me, il faut enregistrer l'activit&eacute; des diff&eacute;rents
  &quot;daemon&quot;, mais surtout d&eacute;pouiller ces observations. La
  d&eacute;cision de tout enregistrer (en installant un &quot;wrapper&quot;)
  a impliqu&eacute; la g&eacute;n&eacute;ration de fichiers de plusieurs
  centaines de Ko par jour, qu'il n'est pas possible de traiter manuellement.
  Des programmes ont &eacute;t&eacute; d&eacute;velopp&eacute;s pour surveiller
  r&eacute;guli&egrave;rement le contenu de ces fichiers, et, en cas d'activit&eacute;
  suspecte ou carr&eacute;ment peu amicale, de pr&eacute;venir les responsables
  s&eacute;curit&eacute;.
</UL>

<P>Toutes ces actions concernent essentiellement les machines g&eacute;r&eacute;es
directement par le Service Informatique, et ne suffisent pas pour s&eacute;curiser
le r&eacute;seau de l'&eacute;tablissement. Des mesures compl&eacute;mentaires
ont &eacute;t&eacute; mises en uvre :</P>

<UL>
  <LI>test syst&eacute;matique de la vuln&eacute;rabilit&eacute; des machines
  de l'Institut &agrave; l'aide du logiciel &quot;Satan&quot;. Un rapport
  d&eacute;taill&eacute; a &eacute;t&eacute; fourni &agrave; chaque correspondant
  s&eacute;curit&eacute;, afin qu'il prenne les mesures n&eacute;cessaires
  pour combler les trous de s&eacute;curit&eacute; d&eacute;tect&eacute;s.
  En toute rigueur, il faudrait renouveler ce test lors de chaque modification
  du syst&egrave;me d'une station et chaque fois que l'on rajoute un nud
  sur le r&eacute;seau. Mais ceci est bien au-dessus de nos possibilit&eacute;s
  en personnel.
  <LI>Installation d'un&quot; garde-barri&egrave;re&quot; programm&eacute;e
  dans les semaines &agrave; venir. Dans le contexte du Campus Jussieu (gaines
  techniques contamin&eacute;es par l'amiante), les modifications indispensables
  du c&acirc;blage du r&eacute;seau local sont des op&eacute;rations tr&egrave;s
  lourdes qui mettent en cause une autre forme de s&eacute;curit&eacute;.
  Cependant cette installation semble &ecirc;tre la seule qui puisse pr&eacute;server
  une certaine convivialit&eacute; &agrave; l'int&eacute;rieur de l'Institut
  et r&eacute;aliser une r&eacute;elle protection vis-&agrave;-vis de l'ext&eacute;rieur.
</UL>

<P>&nbsp;</P>

<P ALIGN="CENTER"><IMG SRC="RES_IPGP.JPG" tppabs="c:/mat/cnrs/RES_IPGP.JPG" WIDTH="519" HEIGHT="621" X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN="BOTTOM" NATURALSIZEFLAG="0"></P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<P>&nbsp;</P>

<P><TABLE BORDER="5" CELLPADDING="1" WIDTH="100%" CELLSPACING="2">
<TR>
<TD><H1 ALIGN="CENTER"><FONT COLOR="#AF0000">&nbsp;</FONT><A NAME="Crack"></A><FONT COLOR="#AF0000">Crack</FONT></H1>

<H3 ALIGN="CENTER">&nbsp;</H3>

<P>Le logiciel domaine public &quot;crack&quot; est un programme qui permet
de d&eacute;terminer si les mots de passe d'un syst&egrave;me UNIX (ou autre)
ont &eacute;t&eacute; convenablement choisis. Dans le cas des syst&egrave;mes
UNIX, o&ugrave; les mots de passe sont encrypt&eacute;s par une fonction
non r&eacute;versible, &quot;crack&quot; encrypte des mots choisis et compare
la cha&icirc;ne de caract&egrave;res obtenue au mot de passe encrypt&eacute;
contenu dans le fichier &quot;password&quot;. Si les cha&icirc;nes encrypt&eacute;es
sont identiques, alors le mot de passe est d&eacute;couvert.</P>

<P>Les cha&icirc;nes de caract&egrave;res utilis&eacute;es sont fabriqu&eacute;es
&agrave; partir :</P>

<UL>
  <LI>de l'information personnelle de l'utilisateur contenue dans le fichier
  &quot;password&quot; (champ gecos),
  <LI>de dictionnaires,
  <LI>d'un ensemble de r&egrave;gles de production de nouveaux mots.
</UL>

<P>Crack utilise d'abord l'information concernant l'identit&eacute; de l'utilisateur
(nom, pr&eacute;nom, adresse, t&eacute;l&eacute;phone, etc.), ensuite il
utilise les dictionnaires et les r&egrave;gles de production pour produire
de nouveaux mots, et ce jusqu'&agrave; &eacute;puisement du fichier de configuration
de r&egrave;gles.</P>

<P>La derni&egrave;re version de crack est la 5.0, tr&egrave;s facile &agrave;
configurer et &agrave; installer (elle a &eacute;t&eacute; test&eacute;e
sur de nombreuses architectures). Son utilisation, en compl&eacute;ment
de l'utilisation d'une commande &quot;passwd&quot; restrictive, permet d'am&eacute;liorer
la s&eacute;curit&eacute; d'un r&eacute;seau local.</P>

<P>&nbsp;</TD></TR>
</TABLE>
</P>

<P><TABLE BORDER="5" CELLPADDING="1" WIDTH="100%" CELLSPACING="2">
<TR>
<TD><H1 ALIGN="CENTER"><FONT COLOR="#AF0000">&nbsp;</FONT><A NAME="Satan"></A><FONT COLOR="#AF0000">Satan</FONT></H1>

<H2 ALIGN="CENTER">&nbsp;</H2>

<P>Satan teste les machines attach&eacute;es &agrave; un r&eacute;seau logique
en essayant de contacter les diff&eacute;rents ports et services impliqu&eacute;s
dans des commandes ou programmes consid&eacute;r&eacute;s comme une source
probable d'ins&eacute;curit&eacute;. Ces tests vont depuis le contact avec
le &quot;portmapper&quot; (ou &quot;rpcbind&quot; selon le syst&egrave;me)
jusqu'&agrave; la v&eacute;rification de la s&eacute;curit&eacute; des services
&quot;ftp anonymes&quot;. La configuration de &quot;Satan&quot; permet de
tester en une seule fois toutes les machines attach&eacute;es &agrave; un
m&ecirc;me r&eacute;seau logique, et fournit en sortie un rapport indiquant
les diff&eacute;rentes vuln&eacute;rabilit&eacute;s de chaque machine test&eacute;e.
Les probl&egrave;mes les plus souvent rencontr&eacute;s sont :</P>

<UL>
  <LI>l'exportation non restreinte de r&eacute;pertoire (&quot;nfs&quot;),
  <LI>les configurations des services &quot;ftp&quot; et &quot;tftp&quot;,
  <LI>l'activation de services &quot;inet&quot; consid&eacute;r&eacute;s
  comme peu s&ucirc;rs (&quot;rexd&quot;),
  <LI>le contr&ocirc;le d'acc&egrave;s au serveurs &quot;X11&quot;,
  <LI>et, bien s&ucirc;r, l'utilisation d'anciennes versions bogu&eacute;es
  de &quot;sendmail&quot;.
</UL>

<P>&nbsp;</TD></TR>
</TABLE>
</P>

<P><TABLE BORDER="5" CELLPADDING="1" WIDTH="100%" CELLSPACING="2">
<TR>
<TD><P><FONT COLOR="#AF0000">&nbsp;</FONT></P>

<P>&nbsp;</P>

<H1 ALIGN="CENTER"><A NAME="Garde"></A><FONT COLOR="#AF0000" SIZE="+4">Gardes-barri&egrave;re</FONT></H1>

<H2 ALIGN="CENTER">&nbsp;</H2>

<P>Le terme garde-barri&egrave;re recouvre plusieurs outils logiciels et
mat&eacute;riels :</P>

<UL>
  <LI>un router assurant le filtrage,
  <LI>une machine assurant les fonctionnalit&eacute;s de passerelle au niveau
  applicatif (telnet, rlogin, ftp, X11, W3, etc.), d'authentification des
  appels entrant et de contr&ocirc;le des sessions (fichiers de traces).
</UL>

<P>Le r&ocirc;le d'un garde-barri&egrave;re est d'assurer une protection
du r&eacute;seau interne, et de permettre de travailler sans trop de contraintes
en limitant le nombre de machines &agrave; surveiller et &agrave; administrer
parfaitement.</P>

<P>Le garde-barri&egrave;re est le point de passage obligatoire qui permet
de v&eacute;rifier la bonne application des r&egrave;gles de s&eacute;curit&eacute;,
et de contr&ocirc;ler le trafic entre l'int&eacute;rieur et l'ext&eacute;rieur
du r&eacute;seau local.</P>

<P>Il existe des produits commerciaux chez les principaux fournisseurs de
mat&eacute;riel informatique, et des produits &quot;domaine public&quot;,
en particulier ceux qui ont &eacute;t&eacute; s&eacute;lectionn&eacute;s,
test&eacute;s et document&eacute;s par le CRU. cf :</P>

<H4 ALIGN="CENTER"><A HREF="javascript:if(confirm('http://www.univ-rennes1.fr/CRU/KGB  \n\nThis file was not retrieved by Teleport Pro, because it is addressed on a domain or path outside the boundaries set for its Starting Address.  \n\nDo you want to open it from the server?'))window.location='http://www.univ-rennes1.fr/CRU/KGB'" tppabs="http://www.univ-rennes1.fr/CRU/KGB">http://www.univ-rennes1.fr/CRU/KGB</A></H4>

<P>&nbsp;</TD></TR>
</TABLE>
</P>

<BLOCKQUOTE>
  <P><BR>
  <BR>
  </P>
  <P><TABLE WIDTH="100%" BORDER="1" CELLSPACING="2" CELLPADDING="0">
<TR>
<TD WIDTH="50%">  <P ALIGN="CENTER"><B>Pierre-Fran&ccedil;ois JEANNIN</B><BR>
  T&eacute;l. : 01 44 27 24 42<BR>
  Adel :<A HREF="mailto:pfj@ipgp.jussieu.fr"> pfj@ipgp.jussieu.fr</A></TD>
<TD WIDTH="50%">  <P ALIGN="CENTER">&nbsp;<BR>
  <B>Eduardo SEPULVEDA</B><BR>
  T&eacute;l. : 01 44 27 24 48<BR>
  Adel : <A HREF="mailto:edo@ipgp.jussieu.fr">edo@ipgp.jussieu.fr</A></TD></TR>
</TABLE>
<BR>
  <BR>
  </P>
</BLOCKQUOTE>

<P>&nbsp;</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H1 ALIGN="CENTER"><A NAME="Netscape"></A></H1>

<H1 ALIGN="CENTER">Configuration Netscape pour utiliser le cache de Renater
:</H1>

<H3>&nbsp;</H3>

<P>Pour Jussieu, dans le menu &quot;options -&gt; pr&eacute;f&eacute;rences
de r&eacute;seau -&gt; proxy&quot; choisir &quot;configuration manuelle
du proxy&quot;. Cliquer configurer et mettre &quot;wwwcache.jussieu.fr&quot;
port 3128 pour les proxies ftp et http.</P>

<P>Pour les autres sites, il faut installer un cache de campus qui pourra
&ecirc;tre fils du cache national ou d'un cache r&eacute;gional. Voir http://cache.cnrs.fr
pour une information plus compl&egrave;te.</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H1 ALIGN="CENTER"><A NAME="Breche"></A></H1>

<H1>Une br&egrave;che de s&eacute;curit&eacute; dans FreeBSD :</H1>

<H1>&nbsp;</H1>

<P>Sur les syst&egrave;mes FreeBSD, il est possible, &agrave; partir d'un
terminal distant, d'ex&eacute;cuter des commandes ayant les droits de super-utilisateur
en utilisant une faille du deamon &quot;talkd&quot;. Voir &agrave; ce sujet
CERT advisory CA-96.04 &quot;Corrupt Information from network Servers&quot;
sur ftp://info.cert.org/pub/cert_advisories/</P>

<P>&nbsp;</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H1 ALIGN="CENTER"><A NAME="Nav"></A></H1>

<H1 ALIGN="CENTER"><FONT COLOR="#AF0000" SIZE="+4">Configurez vos navigateurs
correctement !</FONT></H1>

<P>&nbsp;</P>

<P>Toute information est bonne &agrave; prendre pour un individu malveillant
qui cherche &agrave; p&eacute;n&eacute;trer un syst&egrave;me. Les fichiers,
comme le fichier history, le fichier bookmarks ou les fichiers du r&eacute;pertoire
cache de vos navigateurs, rec&egrave;lent de pr&eacute;cieuses informations
sur vous-m&ecirc;me, vos habitudes et sur le r&eacute;seau auquel vous appartenez.
Si ces fichiers peuvent &ecirc;tre accessibles par tout le monde, vous donnez
ainsi les moyens de percer votre mot de passe, de manipuler votre syst&egrave;me
- surtout s'il supporte les extensions HTML 3.0 et Java - et finalement
de servir de point d'appui ou de rebond &agrave; des attaques derri&egrave;re
un &quot;garde-barri&egrave;re&quot; ou vers des syst&egrave;mes plus critiques.
Si vous avez acc&egrave;s &agrave; des webs &quot;prot&eacute;g&eacute;s&quot;
par des mots de passe, alors avec votre &quot;cache&quot; ouvert &agrave;
tous les vents, n'importe quel pirate d&eacute;butant acc&eacute;dera &agrave;
ce web en se faisant passer pour vous. Il suffit simplement qu'il substitue
votre cache au sien. Moralit&eacute; : ne vous laissez pas compromettre
dans ce genre d'affaire, prot&eacute;gez ces fichiers.</P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H1 ALIGN="CENTER"><A NAME="Bref"></A></H1>

<H1><FONT COLOR="#AF0000">En bref ...</FONT></H1>

<P>&nbsp;</P>

<P><I>Je travaille sur une Sun SS20 sous Solaris 2.5 et j'essaie de copier
le r&eacute;pertoire <B>/etc</B> avec la commande <B>&quot;cp -r /etc&quot;</B>,
mais cette copie ne se finit jamais, je dois interrompre la commande par
Contr&ocirc;le-C</I></P>

<P>&nbsp;</P>

<P>Ce n'est pas vraiment une bonne id&eacute;e de sauvegarder les fichiers
syst&egrave;me avec la commande <B>&quot;cp -r&quot;</B>, parce que cela
changera les droits sur les fichiers - propri&eacute;taire et permissions
- et ouvre ainsi une br&egrave;che dans la s&eacute;curit&eacute;. La copie
s'effectue en suivant les liens symboliques, qui peuvent &ecirc;tre r&eacute;cursifs,
ce qui explique pourquoi il faut l'interrompre par <B>Contr&ocirc;le-C</B>.</P>

<P>&nbsp;</P>

<H3>Attention Mosaic 2.2 est bogu&eacute; :</H3>

<P>Mosaic 2.2 et toutes les versions pr&eacute;c&eacute;dentes de NCSA Mosaic
pour X Window pr&eacute;sentent une s&eacute;rieuse faille de s&eacute;curit&eacute;
: ils permettent, &agrave; travers un URL telnet, d'ex&eacute;cuter n'importe
quelle commande UNIX. Ce bogue a &eacute;t&eacute; corrig&eacute; dans la
version 2.3.</P>

<P>&nbsp;</P>

<H3>Documentation de Netscape en fran&ccedil;ais :</H3>

<P>http://home.fr.netscape.com/fr/eng/mozilla/2.02/handbook/index.html</P>

<P>&nbsp;</P>

<H3>L'acc&egrave;s aux FTP anonymes :</H3>

<P>Certains serveurs ftp anonymes ne permettent pas &agrave; Netscape de
se connecter. En effet, ils laissent l'adresse @Mozilla &agrave; la place
de votre adresse personnelle comme le demande l'usage. Pour y rem&eacute;dier,
il suffit d'entrer l'URL recherch&eacute;e sous la forme :</P>

<P>ftp://anonymous@ftp.xxx.fr/;</P>

<P>Une fen&ecirc;tre demande alors de rentrer votre adresse &eacute;lectronique
comme c'est l'usage pour les sites FTP anonymes.</P>

<P>&nbsp;</P>

<H3>Le feuilleton &quot;Good time&quot; (suite) :</H3>

<P>Les virus ne contaminent pas directement une machine par le courrier
&eacute;lectronique, disions-nous dans le num&eacute;ro 12 de S&eacute;curit&eacute;
informatique. Nous rappelons qu'ils peuvent n&eacute;anmoins le faire indirectement
par le biais des &quot;pi&egrave;ces jointes&quot; sous Word - qui peuvent
contenir des &quot;macro virus&quot; - ou des fichiers &quot;uuencode&quot;.
Il convient donc de les v&eacute;rifier avec un anti-virus avant de les
ouvrir (fichiers Word) ou de les ex&eacute;cuter (fichiers ex&eacute;cutables
d&eacute;cod&eacute;s) comme on le ferait pour de tels fichiers s'il &eacute;taient
&quot;import&eacute;s manuellement&quot;.</P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P><IMG SRC="ligne.gif" tppabs="c:/mat/cnrs/ligne.gif" ALIGN="TOP" WIDTH="580" HEIGHT="3" NATURALSIZEFLAG="3"></P>

<H2>&nbsp;</H2>

<H2 ALIGN="RIGHT">Au revoir ....<IMG SRC="fondsi.jpg" tppabs="c:/mat/cnrs/fondsi.jpg" WIDTH="85" HEIGHT="85" ALIGN="BOTTOM" NATURALSIZEFLAG="3"></H2>
</BODY>
</HTML>
