<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="6" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier des lecteurs</B></FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Bon je vous explique Oyama666@iname.com est la boite
des fondateurs et de F34r F4ct0ry, donc en gros on est 5 &agrave; lire les courriers, si vous &eacute;crivez &agrave;
un membre autre que les fondateurs en pr&eacute;cisant que vous voulez leur parler perso on leur transmet le mail
sinon c'est Demogorgon999, Veinscuts, Shaks666, Kio80 et F34r F4ct0ry qui vous r&eacute;ponde...</B></FONT></P>

<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier re&ccedil;ut il y a plus d'un mois:</B></FONT></P>

<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>salut; <BR>
donne moi l'adresse exacte de ton site. pour newspc le pseudo est &eacute;fac&eacute; et l'abonnement est r&eacute;silier
ca veutdir que maintenant tu ne peut plus me retrouv&eacute; quel dommage !!!!!! sur ce coula je t'es eu pauvre
con et en + je me suis fait des adresses chez yahoo, caramail, etc.... j'ai un site chez aol,club-internet,tripod,
easi net, wanadooet mon site fait 60 Mo et tout ca gratuit mais je te donerais pas l'adressepar ce que les cons
ne viennent pas sur mon sites special HARD-WARE. et tu a repondue au quel courier si jamais tu a repondue aux courier
dema famille j'te promet que est dans la merde. Lundi prochain un informatien (ancien-hacker) vien me metre son
propre anti-virus et il va me donn&eacute; des cour de hackers (il a fait 5 ans detole a cause du hack il est m
passer a la t&eacute;l&eacute;: il a hack le site AIR FORCE) c'est un copain de mon tonton et avec tous ca tu est
foutue p'ti et tespotes Maintenant je suis blind&eacute; et toi tu est dans la merde !!!!! J'me rejuit d'avance
ton ordi va se transformer en ta de cendre ha haha ha j'alais oublier il faut que tu enleve la page que tu a fait
sur moi par NEWSPC cc'est une marque d&eacute;poser et ont peut porter plenite pour ca jesait par ce que le pere
d'un pote il est keuf et il m'a tout explique que la piratrerie informatique et aure est reconnue par la loi &gt;
ho ha ho ha oh !!!!!!!!!!!!!!!!!!!!!!!! &gt; tu est dans la merde BYE</B></FONT></P>

<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>NewsPC@aol.com<BR>
</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Cher NewsPC, ta lettre me va droit au coeur et je te donne
volontier l'adresse du site:<BR>
http://members.aol.com/newspc qui est la tienne avant toute chose et au cas ou tu n'aurais pas compris encore que
c'est ta page hack&eacute;...<BR>
En attendant pour ce qui est de ton copain hacker, je me ferais une joie de me faire r&eacute;duire mon ordinateur
en &quot;tas de cendre&quot; et moi (et mes petits copains ???) on a rudement peur...<BR>
Stp ne nous fais rien !!!<BR>
Je te fais juste une petite remarque: si NewsPC est une marque d&eacute;pos&eacute; (ce dont je ne doute pas) comment
ce fait il que tu l'ai pris comme pseudo et que tu ne te sois pas fait poursuivre alors que moi je me ferais poursuivre
?<BR>
Bon je te laisse mais n'oublie pas de me r&eacute;ecrire parceque moi je t'aime bien, je me marre bien avec toi.</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Demogorgon999</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>lettre dat&eacute;e du 18/06/99:</B></FONT></P>

<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>bon d&eacute;j&agrave; ....je veux pas jouer les rabajoies mais
votre explication du <BR>
nbtstat est en partie erron&eacute;e et vous l'avez pomp&eacute; sur un emag existant <BR>
.....trouv&eacute; sur www.multimania.com/flashhack ou ailleurs... (emag tres<BR>
mauvais <BR>
d'ailleurs )<BR>
en effet dans nbstat vous oubliez la commande &quot;net view<BR>
\\nomdel'ordi&quot; qui <BR>
permet avant toute chose de savoir si les ressources sont partag&eacute;es. et qui <BR>
nous donne un inventaire indispensable des ressources partag&eacute;es !<BR>
ensuite on tape<BR>
net use \\nomdel'ordi\C (ici j'ai mis C mais &ccedil;a peut etre n'importe <BR>
quelle lecteur des ressources partag&eacute;es (cf l'inventaire ) )<BR>
voila maintenant vous aurez une ligne de reponse vous disant que le <BR>
lecteur C du type est devenu votre lecteur X ,Y ou Z (&ccedil;a d&eacute;pend ! &ccedil;a peut <BR>
etre n'importe quel lettre de l'alphabet).<BR>
Ensuite vous devez faire rechercher etc .... et l&agrave; vous aurez l'icone de <BR>
l'ordi distant ! si et seuleument si vous avez fait tous &ccedil;a !<BR>
Autre chose dans le fichiers lmhosts (il suffit de taper &quot;edit lmhosts<BR>
&quot; sous <BR>
dos pour l'ouvrir ) il faut ecrire ipdugars nomdel'ordi #PRE et c'est <BR>
TOUT pas de #Hacke par demogorgon ou de tuc du genre ....j'ai pas essay&eacute; mais<BR>
<BR>
si on met &ccedil;a ,&ccedil;a doit foirer car ce qu'on met apres le diese est une <BR>
commande ! PRE veut dire ici qu'il faut precharg&eacute; tout notre bordel et le <BR>
faire passer avant la resolution DNS. faut pas non plus mettre des &quot; <BR>
&quot; <BR>
autour du nom de l'ordi !!!!<BR>
Autre chose encore les lignes de codes sources &agrave; mettre dans l'autoexec.bat <BR>
sont mauvaises : (je converti ce que vous vouliez ecrire dans la bonne <BR>
ecriture)<BR>
@echo.<BR>
@echo @@@@@@@@@@@@@@@@@@@@@@@@@@@<BR>
@echo @Tu t'es fait hacke ton PC comme une vieille merde @<BR>
@echo @ signe user100192 !!!!!!! <BR>
@<BR>
@echo @@@@@@@@@@@@@@@@@@@@@@@@@@@<BR>
@echo.<BR>
voil&agrave; voil&agrave; ! bonne continuation ! la prochaine fois essayez de parler en <BR>
connaissance de cause !<BR>
bye !<BR>
amicalement user100192</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Merci pour ton courrier user, j'ai n&eacute;anmoins quelques
remarques &agrave; faire...<BR>
Tout d'abord pour la partie modification de l'autoexec.bat qui est efectivement une erreur de ma part j'ai oubli&eacute;
de foutre l'arobase devant echo, autant pour moi :( ( Pourtant j'avais pas bu hein veinscuts... ;))<BR>
Par contre, pour nbtstat, il est normal que j'ai saut&eacute; les commandes, je prenais comme exemple l'un des
ordinateurs de notre bahut que nous savions partag&eacute; avec 5 autres.<BR>
De meme pour savoir si les ressources sont partag&eacute;s, nous utilisons le logiciel Legion qui scanne une rang&eacute;e
d'IP et qui nous indique les IP qui utilise Netbui, Netbios et les ressources partag&eacute;s, il permet aussi
d'afficher les ressources sur le bureau, et de faire le lien entre son disque dur et le notre.<BR>
Pour le fichier lmhost, &agrave; ma connaissance, il n'y a aucun probl&egrave;me a foutre #hacked by Demogorgon
car on m'a toujours appris que tout ce qui se trouve derri&egrave;re # est ignor&eacute; et peut servir a donner
des informations (un peu comme le // du c++), ainsi tu peux virer le #PRE le hack fonctionnera quand meme, enfin
bon comme il est rare que j'utilise le hack par Netbios et que Legion fait tout le travail, je peux tr&egrave;s
bien me gourrer.<BR>
Si tu as d'autres remarques n'h&eacute;site pas, car c'est grace a des gens comme toi qu'on fera avancer notre
mag qui, je l'esp&egrave;re, parcourera son petit bout de chemin.</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Demogorgon999</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
<BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Lettre dat&eacute;e du 17/06/99:</B></FONT><FONT
COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>ok bon je pense qu'il vous manque le blue boxing dans
la rubrique phreaking<BR>
mais c'est assez dangereux et il vous trouv&eacute; les composants pour cr&eacute;er le typon qui fera offise de
r&eacute;gulateur de tension mais &eacute;galement le log (cyberbreaking) assez fun votre e-mag ca m'int&eacute;rr&eacute;se
mais il faudrait que j'ai le dernier num&eacute;ro car l&agrave; j'ai juste le tout premier.<BR>
merci d'avance les gas et bonne bourre <BR>
<BR>
PROSPER </B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Le Blue-Boxing c'est pas pour tout de suite, c'est trop
complexe pour etre expliqu&eacute; dans un mag qui va etre lut par presque que par des d&eacute;butants, je veux
pas etre responsable de l'arrestation de dizaines de newbies qui n'auront pas capt&eacute;s les subtilit&eacute;s
de cet &quot;art&quot; en plus il ne marche plus en france donc il faut faire des num&eacute;ros verts internationaux
qui sont pour la plupart trac&eacute;s depuis le d&eacute;tournement de 6 millions de francs par des escrocs fran&ccedil;ais.</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
F34r F4ct0ry</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Lettre dat&eacute;e du 18/06/99:</B></FONT></P>

<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Salut, tr&egrave;s bon mag mais j'ai not&eacute; une erreur en
ce qui concerne le beige boxing, les couleurs ne correspondent pas, dans mon t&eacute;l&eacute;phone il y a un
fil rouge et vert est-ce normal ou dois-je racheter un t&eacute;l&eacute;phone ?<BR>
Merci d'avance et continuez...<BR>
Goldohack</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Non, ne t'inqui&egrave;te pas, les couleurs varient mais
le principe reste le meme, souvent selon selon le pays de fabrication du t&eacute;l&eacute;phone les fils sont
de couleurs diff&eacute;rentes, mais</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B> </B></FONT><FONT
COLOR="#FF0000" FACE="Comic Sans MS"><B>ton t&eacute;l&eacute;phone conviendra sans probl&egrave;mes.</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
F34r F4ct0ry</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Lettre dat&eacute;e du 19/06/99:</B></FONT><FONT
COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>J'ai fabriqu&eacute; une Black box selon les plans indiqu&eacute;s
par TheBoss mais elle ne semble pas fonctionner, j'ai eu beau en fabriquer trois mais quand je les branches la
led ne s'allume pas.<BR>
Vous etes surs de vos plans ?<BR>
Parceque le montage est correctement fait et &ccedil;a en devient stressant.<BR>
<BR>
Pascal<BR>
</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Bon, je vous pr&eacute;vient tous, la led ne marche pas,
vous pouvez la supprimer.<BR>
J'ai moi meme fait plusieurs black box et dans aucun des montages la led n'a fonctionn&eacute;e, cependant que
la led ne fonctionne pas c'est un probl&egrave;me mais cela ne veut en aucun cas dire que la box ne fonctionne
pas...<BR>
tu peux savoir si elle fonctionne de deux mani&egrave;res:<BR>
1) en &eacute;coutant au combin&eacute; &ccedil;a s'entend tout de suite, tu as l'impression qu'un second combin&eacute;
est d&eacute;croch&eacute; chez toi...<BR>
2) en d&eacute;crochant, tu n'as pas de tonalit&eacute; ou tr&egrave;s faible, mais de toute mani&egrave;re tu
ne peux pas composer de num&eacute;ro.<BR>
J'ai comme l'impression que tu as fait deux montages de trop :)))</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Veinscuts</B></FONT></P>

<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>courrier re&ccedil;ut le 19/06/99:<BR>
</B></FONT><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>J'ai crut entendre que quelques uns de vos membres se
trouvent sur AOL, repaire de Lamerz et FAI d&eacute;test&eacute; de tout les hackers, comment ce fait il que vous
ayez choisi un FAI aussi naze ?</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Vous etes la honte de tout les hackers/phreakers et crakers, vous
etes des traitres, bandes de connards.</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Joey Starr</B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Je me pisse dessus tout de suite ou j'attends un peu ?<BR>
Oui, la moiti&eacute; des membres sont sur AOL (entre autres) et oui AOL est un provider d&eacute;t&eacute;st&eacute;
de tout les hackers (presque), pour la simple et bonne raison qu'il est impossible de se connecter a AOL avec LINUX,
mais si j'aime AOL c'est mon probl&egrave;me, c'est mes gouts et je les pr&eacute;f&egrave;res largement aux autres
providers, question de gouts...</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Je peux te poser une question, si NTM trouvait que tout les mecs
qui se mettent en survets sont des nazes et qu'ils doivent plus ecouter leur musique tu le ferais ou tu te dirais
que c'est ton gout et que personne n'a a t'imposer un choix ?</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Si je suis la honte des hackers/phreakers et crackers et bien
c'est tant mieux pour moi parceque j'en ai RIEN A FOUTRE et le fait que tu m'emmerde &ccedil;a me brise le coeur
mais je t'emmerde pas parceque &ccedil;a serait trop d'honneurs pour toi.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>@ plus</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Demogorgon999</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier re&ccedil;ut le 19/06/99:</B></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>(tiens encore une fois lui...lol)</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Je voulais vous dire si le NEWSPC est le meme que je connais alors
son pote <BR>
le hacker il est aussi fort que lui car y a peu de temps je lui ai piqu&eacute; son<BR>
ip avec un truc vieux comme le monde le lien ftp://monIP etc...voil&agrave; voil&agrave; !<BR>
et y a un truc cool c'est une des rares fois que je vois des hacker <BR>
reconnaitre leur faute sans faire passer le gars qui le leur a signal&eacute; comme<BR>
un lamer ou un chieur ! mes f&eacute;licitations !<BR>
Sur ce BON VENT<BR>
amicalement user100192<BR>
PS scusez si mon autre le ton de mon precedent mail vous a paru agressif <BR>
....mais c'etait pas voulu... enfin bref je vous laisse !<BR>
Franchement je croyais que le #PRE avait une utilit&eacute; qqonque snif :-( j'ai <BR>
tap&eacute; 4 lettres en trop .</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>User100192</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Resalut, j'ai eut l'occasion de te parler entre temps (sous le
pseudo de Veinscuts que je squatte de temps en temps...) et de t'echanger quelques mails, donc tu dois te douter
que je vais pas te faire passer pour un chieur loin de l&agrave;. il est normal que j'admette m'etre gour&eacute;
en tapant l'article et avoir oubli&eacute; les arobase si tel est le cas, je suis pas un connard non plus et je
vais pas faire passer pour un chieur un mec qui me signale une faute. En plus c'est carr&eacute;ment mieux, &ccedil;a
me permet de corriger par un erratum dans le num&eacute;ro d'apr&egrave;s.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Quand a NewsPC, il est effectivement encore sur AOL comme je l'avais
devin&eacute; (il m'avait envoy&eacute; un mail de provenance NewsPC@aol.com alors qu'il disait ne plus avoir ce
compte, et la pr&eacute;sence de son site pirat&eacute; prouve le contraire).</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>N'h&eacute;site pas &agrave; nous r&eacute;ecrire, si tu r&eacute;ussis
&agrave; m'avoir avant demain tu pourras carr&eacute;ment te faire publier 3 fois dans le num&eacute;ro.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>P.S: Au fait, merci de n' avoir montr&eacute; la page du courrier
des lecteurs a personne comme Veinscuts te l'avait demand&eacute; : )</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Demogorgon999 et Veinscuts</B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>courrier dat&eacute; du 19/06/99:</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>salut les gars ,<BR>
je souhaite longue vie a votre site <BR>
<BR>
Osny95</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Merci ; )</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Toute l'&eacute;quipe de Oyama666</B></FONT></P>
<P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier re&ccedil;ut le 19/06/99:</B></FONT><FONT COLOR="#0099FF"
FACE="Comic Sans MS"><B><BR>
voila tout se que j'ai a dire:<BR>
&quot;Tout d'abord<BR>
je n'ai pas de r&eacute;el critique a faire a propos de ce magazine qui est vraiment bon a mon gout, un tres bon
mag pour les debutants comme moi, bien expliquer, des programmes interessants(dont j'ai profit&eacute; dans le
n&deg;1 de snapscan) et surtout de bonne rubriques!!et un peu d'humour dans la page de presentation (la BD) qui
change a chaque fois! Pour le moment j'ai aucun critique j'espere que je n'aurait pas a en avoir un jour. lol &quot;
<BR>
LignNet</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Merci pour ton mail, il y a eut des changements comme tu peux le remarquer au niveau des programmes qui ont disparut.Maintenant
pour trouver un programme il suffit de nous demander par mail et on vous file l'url. La version 2 du premier Snapscan
est disponible il devrait plus y avoir de probl&egrave;mes au t&eacute;l&eacute;chargement, on a vir&eacute; les
progs donc il est tr&egrave;s l&eacute;ger. Quand a la BD &ccedil;a serait triste si c'&eacute;tait tout le temps
la meme, non ? En tout cas heureux que &ccedil;a te plaise surtout que par le pass&eacute; on a pas toujours &eacute;t&eacute;
pote hein ? ; )</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Bon salut</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Veinscuts</B></FONT></P>
<P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier re&ccedil;ut le 19/06/99:</B></FONT><FONT COLOR="#FF0000"
FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Je trouve le mag tr&eacute;s bien ,et je remerci veins
pour ses explication dans le but de faire avancer les newbie comme moi ,en esperant que grace a son mag on soit
tous des mitnick dans 5 ans ;lol ,j'aimerais ce pendant mieux comprendre linux et son interet dans les prochains
mag<BR>
<BR>
afterstef.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
Merci, nous sommes l&agrave; pour &ccedil;a, un mag QUE pour les newbies, je pense pas qu'on sera des mitnicks
dans 5 ans mais bien avant lol</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Pour Linux, lis le mag tu vas avoir une surprise, et oui, j'ai
tellement fait chier Demogorgon999 qu'il a enfin commenc&eacute; l'&eacute;criture d'une s&eacute;rie d'article
et de cours sur Linux.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Veinscuts</B></FONT></P>
<P>
<P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Courrier re&ccedil;ut le 20/06/99:</B></FONT></P>
<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B>Salut, je tiens &agrave; te faire remarquer que ton Emag est sensationnel.
Mais pour vraimant que &ccedil;a soit la 8eme merveille du monde. Il manquerait &agrave; mon gout, 2 rubriques.
La prmi&egrave;re &eacute;tant des &eacute;xplications et des liens affin de pouvoir copier les CDs m&ecirc;me
ceux les plus prot&eacute;g&eacute;. Car c'est quant m&ecirc;me l'activit&eacute; principale de nous tous, enfin
pour moi. La deuxi&egrave;me quelques petites recettes des cuisines explosives. On ne sait jamais, &ccedil;a peut
servir peut-&ecirc;tre pour faire petter la gueulle au CIO enfin exuse, &agrave; la mafia. Et oui la mafia &agrave;
un nom, CIO une organisation qui pourait nous apprendre beaucoup de chose dans le domaine de la magouille. Et en
plus c'est LEGALE, m&ecirc;me la Suisse ne facture pas un centimes d'imp&ocirc;ts &agrave; ces criminelles.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>La je saute l'article (tr&egrave;s bien r&eacute;alis&eacute;
avec plans et tout qu'il m'a envoy&eacute;)</B></FONT><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B><BR>
Tu serais cool, si tu pourait m'envoyer tes Emag bien app&eacute;tisssant sur mon E-mail directement. Eh oui, je
suis un peut paresseux. <BR>
Merci d'avance. <BR>
<BR>
=&gt; Etter@vtx.ch</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Salut merci piur ton courrier et ton artcile 'achement bien r&eacute;alis&eacute;,
pour ce qui est des Cd, &ccedil;a doit pouvoir se faire dans un prochain numero (malheureusement pas avnt le n&deg;6
parceque on tient d&eacute;j&agrave; &agrave; peu pr&egrave;s nos sujets jusque l&agrave;) et pour ce qui est des
liens, ouais &ccedil;a doit etre applicable d&egrave;s le prochain num&eacute;ro.</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>Pour la seconde partie, je pr&eacute;cise, nous ne sommes pas
un groupe anarchiste (quelques membres sont satanistes mais pas anarchistes....; ) ) quoi qu'il en soit ton article
est super et ceux qui s'interessent &agrave; la fabrication d'explosifs peuvent en faire la demande &agrave; </B></FONT><FONT
COLOR="#0099FF" FACE="Comic Sans MS"><B>Oyama666@iname.com</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>,
je suis d&eacute;sol&eacute;, si &ccedil;a tenait qu'a moi je l'aurais mis mais les autres ne sont pas d'accord
parceque c'est trop dangereux ; )</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>perso je foutrais bien un explosif dans mon bahut, un peu de sucre...
un peu de... lol</B></FONT></P>
<P><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
F34r F4ctOry</B></FONT></P>

<P><FONT COLOR="#0099FF" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B><BR>
<BR>
</B></FONT><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Bein c'est fini, mais vous aussi vous pouvez
nous &eacute;crire &agrave;: </B></FONT><FONT SIZE="4" COLOR="#0000FF" FACE="Comic Sans MS"><B>Oyama666@iname.com</B></FONT>

</BODY>

</HTML>