<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="6" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Hacking</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>by Demogorgon999</B></FONT><FONT SIZE="4"
COLOR="#FFFFFF" FACE="Comic Sans MS"><B></B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>nuke, smurf</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B></B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
NUKE</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Attention, ne vous m&eacute;prenez pas ceci n'est pas
un cours sur &quot;comment je nuke un gars ?&quot;, mais plutot un cours sur comment fonctionne le nuke.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Tout d'abord je ne vois pas de mal a faire un nuke de
temps en temps quand un mec commence &agrave; faire chier et vous empeche de vous eclater sur le net mais seulement
&agrave; condition de savoir ce que l'on fait.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>C'est bien beau d'appuyer sur un bouton mais que fait-il
ce bouton ?</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Commen&ccedil;ons par un peu de th&eacute;orie:</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Lorsque vous vous connectez &agrave; un serveur, vos
ordinateurs s'&eacute;changent des paquets ping ? pong ! qui leurs permettent de savoir s'ils sont toujours connect&eacute;s
et si la connexion est bonne.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Pour ceux qui vont sur IRC regardez un peu dans la fenetre
&quot;status&quot;</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Ces paquets peuvent etre d&eacute;lib&eacute;remment
envoy&eacute; par la commande &quot;ping ip&quot; sous dos.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Seulement voila, si les ping envoy&eacute;s sont trop
nombreux et trop rapides et que la connexion de l'ordinateur distant est moins bonne que la votre, il plante...</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Donc on peut facilement arriv&eacute; &agrave; la conclusion
que le nuke fonctionne de cette mani&egrave;re, et bien presque seulemnt le nuke non content de ping &agrave; mort
le serveur distant, il essaie de flooder un port (139 en g&eacute;n&eacute;ral)  par des messages que vous choisissez,
ce qui entraine un plantage assur&eacute; du syst&egrave;me.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Seulement voil&agrave; la plupart des ordinateurs sont
patch&eacute;s &agrave; pr&eacute;sent et vous ne pouvez plus ni nuker, ni vous nuker, du moins de cette mani&egrave;re.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Il existe cependant une commande sous dos qui permet,
si l'on ouvre une vingtaine de fenetre, de pinger suffisament rapidement pour que l'odinateur plante, il s'agit
de &quot;ping -t ip&quot; qui ping en continue l'ordinateur distant, en ouvrant plusieurs fenetre si &ccedil;a
connexion est mauvaise il plante lamentablement.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Bon pour le nuke c'est tout, je vais pas parler trois
heures d'une technique de lamerz.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
SMURF (ou loop)</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Moi je ne connaissais que l'appellation &quot;smurf&quot;,
mais Veins m'as dit qu'il avait entendu dans un salon l'appellation &quot;loop&quot; pour la m&ecirc;me technique
donc voila je vous explique comment &ccedil;a marche.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>C'est en fait une sorte de nuke, mais plus pour les lamerz,
ce nuke peut mettre un site hors-d'&eacute;tat plusieurs heures (perso je m'amuse pas &agrave; &ccedil;a, mais
&ccedil;a peut etre drole).</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Meme contrainte, la connexion doit etre meilleur que
pour l'autre ordinateur, mais l&agrave; il faut spoofer l'ip de l'ordinateur et commencer quelques &quot;ping -t
ip&quot; puis se despoofer afin de laisser une boucle s'enchainer, l'ordinateur distant ne comprendras rien et
plantera aussi sec.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B>J'ai entendu des rumeurs selon lesquels le smurf pouvait
entrainer un crash du disque dur, elle ne sont pas fond&eacute;s, en aucun cas le smurf n'entraine une d&eacute;t&eacute;rioration
du disque dur (en tout cas pas plus que l'utilisation de windows qui plante deux fois plus souvent).</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Attention le nuke et le smurf, contrairement &agrave; ce que vous pouvez penser, sont interdits par la loi et punis
de prison et d'une amende carr&eacute;ment excessive.</B></FONT></P>

<P><FONT SIZE="4" COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
Faites gaffe et rappelez vous que le nuke c'est pour les LamerZ.</B></FONT>

</BODY>

</HTML>