<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="6" FACE="Comic Sans MS"><B>Linux</B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="5" FACE="Comic Sans MS"><B>par Demogorgon999</B></FONT><FONT SIZE="6" FACE="Comic Sans MS"><B></B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" FACE="Comic Sans MS"><B>Installation de Linux </B></FONT></P>

<P ALIGN="CENTER"><FONT SIZE="4" FACE="Comic Sans MS"><B></B></FONT></P>
<P><FONT FACE="Comic Sans MS"><B>Bon bien que l'installation de Linux devienne facile avec de l'entrainement, les
premi&egrave;res fois il faut vraiment lutter pour r&eacute;ussir une installation irr&eacute;prochable. </B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Donc je vais vous d&eacute;tailler l'installation de Linux dans ce premier chapitre,
ainsi que les tout premiers pas.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Et &agrave; chaque num&eacute;ro je compl&egrave;terais mon &quot;cours&quot;
de Linux en rajoutant un chapitre mais seulement si vous etes nombreux &agrave; le demander.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Nous allons ici installer la distribution la plus c&eacute;l&egrave;bre: la RedHat
5.2 que vous pourrez trouver chez Micro Application pour 169 francs avec un gros bouquin et plusieurs progs fournit
sur un troisi&egrave;me cd ou n'importe quel Cd de Redhat distribu&eacute; dans les nombreux magazines, elle cohabitera
avec Windows 95/98 sur une partition. Je donne l'exemple pour un disque dur o&ugrave; je donnerai 4 GO &agrave;
Linux mais il s'installe parfaitement sur 2 GO.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Bon on va commencer...</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B></B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B>I&egrave;re partie: Installation de Linux RedHat 5.2</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT FACE="Comic Sans MS"><B>Vous etes donc sous Windows et vous voulez installer Linux ? Bien, vous
faites d&eacute;j&agrave; des progr&egrave;s dans le monde du hacking...</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Bien qu'il soit possible de pirater sous Windows, il est vraiment mieux de le
faire sous Linux pour des raisons de facilit&eacute; dans les commandes.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>D&eacute;marrez donc sous Windows puis suivez les &eacute;tapes d&eacute;crites:</B></FONT></P>

<P><FONT SIZE="4" FACE="Comic Sans MS"><B><BR>
</B></FONT><FONT FACE="Comic Sans MS"><B>Lancez une d&eacute;fragmentation du disque dur (d&eacute;marrer=&gt;programmes=&gt;outils)
et patientez ensuite utilisez le logiciel Fips (sous dos et distribu&eacute; avec la plupart des distributions
de Linux) pour creer une partition (notamment avec les PC dit &quot;impartitionnable&quot; du genre Compaq...),
je vais pas d&eacute;tailler &ccedil;a parceque vous comprendrez facilement, dans notre cas nous allons donner
4 Go &agrave; Linux.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Rebootez le PC avec la disquette de boot donn&eacute;e avec RedHat (ou bootez
&agrave; partir du CD selon le cas) et commencez l'installation de Linux en tapant sur entr&eacute;e.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Choisissez la langue de l'installation ainsi que le type de clavier (pour un Azerty
choisissez &quot;fr-latin1&quot;, ensuite au menu qui vous demande d'o&ugrave; il doit extraire Linux choisissez
Cd-rom.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Choisissez maintenant, &agrave; la demande installation ou mise &agrave; jour,
Installation qui vous proposera l'installation d'une station de travail, d'un serveur ou personnalis&eacute;e.
C'est cette derni&egrave;re proposition que nous allons choisir.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>L'utilitaire de partitionnage Disk Druid vous sera ensuite propos&eacute;, lancez
le.</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>Vous devriez voir deux partitions dans l'utilitaire vu que vous avez cr&eacute;e
une partition avec fips et qu'il y avait la partition Dos (windows).</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>vous allez partitionner la partition de Linux en 4:</B></FONT></P>

<P><FONT FACE="Comic Sans MS"><B>une que vous nommerez </B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>/
</B></FONT><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>et qui aura une taille de 80 Mo</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>une que vous nommerez </B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>/usr</B></FONT><FONT
COLOR="#FFFFFF" FACE="Comic Sans MS"><B> et qui aura une taille d'environ 1000 Mo (dans notre cas 1500)</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>une que vous nommerez </B></FONT><FONT COLOR="#FF0000" FACE="Comic Sans MS"><B>/home</B></FONT><FONT
COLOR="#FFFFFF" FACE="Comic Sans MS"><B> et qui mesurera plusieurs centaines de Mo (dans notre cas 1500)</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>et une partition de swap (pas de nom) qui fera au maximum 127
Mo (dans notre cas 127 Mo)</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>ensuite vous allez formater la partition de swap ainsi que les
autres, mais n'h&eacute;sitez pas &agrave; v&eacute;rifier les mauvais blocs pour &eacute;viter aussi les mauvaises
surprises.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Une fois le formatage termin&eacute; installez les packets qui
vous int&eacute;ressent (dans notre cas TOUS) et commencez l'installation.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>D&egrave;s la fin de l'installation l'ordinateur doit d&eacute;tecter
une souris, et vous afficher un menu avec de nombreuses souris, choisissez la votre (si elle n'a que deux boutons,
choisissez &quot;souris g&eacute;n&eacute;rique&quot; puis &eacute;muler le troisi&egrave;me bouton).</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Choisissez ensuite votre moniteur et votre carte graphique.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Si vous poss&eacute;dez un r&eacute;seau chez vous, configurer
le r&eacute;seu &agrave; l'aide du menu qui suit, sinon sauter cette &eacute;tape.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Configurer l'horloge &agrave; l'aide du menu suivant, ne mettez
&quot;horloge r&eacute;gl&eacute;e sur GMT&quot; que si Linux est votre seul OS, sinon mettez &quot;Europe-Paris&quot;.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>S&eacute;lectionner les services qui d&eacute;marreront automatiquement,
puis configurer votre imprimante.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Enfin choisissez un mot de passe pour le &quot;root&quot; que
vous taperez deux fois et commencez l'installation de LILO.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Rebootez votre pc.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
IInde partie: Configuration de Linux et premi&egrave;res commandes &agrave; connaitre</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
LILO:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>tapez linux</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Linux commencera donc son d&eacute;marrage et vous demanderas
ensuite:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>login:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>pass:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>le pass n'apparait pas pour des questions de s&eacute;curit&eacute;.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Une faute sous Linux est Irr&eacute;cup&eacute;rable, c'est pour
cel&agrave; qu'il faut eviter au maximum de se connecter en tant que root, comme &ccedil;a des restrictions vous
empecherons de faire des conneries qui vous obligerons &agrave; r&eacute;installer Linux.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>pour cr&eacute;er un utilisateur non-root tapez ce qui suit:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>useradd -u 201 pseudonyme</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>passwd pseudonyme</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>saisissez votre mot de passe (si apr&egrave;s l'avoir saisit il
vous indique une erreur, ce n'est pas grave, il s'agit en fait d'un avertissement vous signalant que votre mot
de passe peut etre trouv&eacute; tr&egrave;s facilement &agrave; l'aide d'un crackeur de mots de passe)</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>ressaisissez-le et voil&agrave;, tapez:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>exit</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>et relogger vous sous votre nouveau pseudonyme</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>puis tapez startx. voil&agrave; vous etes dans l'envirronement
graphique de Linux.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Je vous conseille vivement de choisir Afterstep qui est le plus
beau de tous... ;)))</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
<BR>
Quelques commandes de bases:</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
date: affiche la date et l'heure syst&egrave;me.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>who: indique les utilisateurs connect&eacute;s au syst&egrave;me.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>cal: affiche un calendrier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>man: il s'agit des documentations int&eacute;gr&eacute;es au syst&egrave;me.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>cat: affiche le contenu d'un fichier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>ls: &eacute;quivalent du DIR sous DOS.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>pwd: permet de connaitre ler&eacute;pertoire dans lequel on se
trouve.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>cd: sert &agrave; changer de r&eacute;pertoire, il s'utilise de
la m&ecirc;me mani&egrave;re que sous dos (pour revenir &agrave; notre r&eacute;pertoire tapez juste CD).</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>mkdir: cr&eacute;e un r&eacute;pertoire.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>move: d&eacute;place un fichier vers un autre.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>cp: copie un fichier vers un autre.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>rm: permet d'effacer un fichier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>rmdir: permet d'effacer des r&eacute;pertoires.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>chown: permet de modifier le propri&eacute;taire d'un fichier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>chmod: permet de g&eacute;rer les droits d'acc&egrave;s.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>mount: permet de monter un syst&egrave;me de fichier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>umount: permet de d&eacute;monter un syst&egrave;me de fichier.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>rpm: permet d'installer les packages .rpm</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
bon vous n'aurez pas besoin d'autres commandes pour vos premiers pas dans l'univers de Linux.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Apprenez &agrave; les maitriser.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Elles ne s'utilisent pas tels quel mais tapez: nom_de_la_commande
--help</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B>Comme &ccedil;a vous saurez comment utlisier les commandes.</B></FONT></P>

<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><B><BR>
A bientot pour un second &quot;cours&quot; de Linux, et apprendre &agrave; faire votre premi&egrave;re connexion
&agrave; Internet.</B></FONT>

</BODY>

</HTML>