<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>PHREAKING </TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><STRONG><big><big></STRONG><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><STRONG>PHREAKING !!!!!!!!</STRONG></FONT><STRONG></big></big></STRONG></P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><big>Bon, comme j'ai integr&eacute; l'&eacute;quipe de O-Yama666,
cet enfoir&eacute; de Veinscuts m'a demand&eacute; un pti article !! arf !! l'enfoir&eacute; !! ; )) Mais non mon
pote, fais pas la gueule !!! j't'aime bien quand m&ecirc;me!!!</big></EM></FONT></P>
<P>&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><big>Bon vu que cet emag est destin&eacute; aux d&eacute;butants,
on va essayer de faire simple !!! Au sommaire de ce num&eacute;ro : les boxs et les cartes pr&eacute;-pay&eacute;es
!!! ( j'suis d&eacute;gout&eacute;, veins veut pas que je parle de la blue et beige box !! il se les reserve !!
arf ... bah c'est pas grave, il reste beaucoup de choses &agrave; dire )</big></EM></FONT></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P><big><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><U><big>Les boxs :</big></U></EM></FONT></big></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><big>aujourd'hui : la black box, ou l'art de faire &eacute;conomiser
de la tune &agrave; vos potes !! arf ..... ca y est, j'en entends dire : &quot;Ouah l'autre h&eacute; !! il nous
propose du phreaking qui nous permet m&ecirc;me pas de ne pas payer les coms tel !! &quot;&nbsp; Attendez !! c'est
pas fini !!</big></EM></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><big>Bon, j'explique : la black box est un pti montage electronique
qui permet de ne pas faire payer la personne qui vous appelle. Donc, &ccedil;a ne vous sert pas directement, sauf
si vous en refilez &agrave; tous ceux que vous appelez !! Ca y est, vous comprenez mieux ?? = ))</big></EM></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><EM><big>Merde il faut que je vous fasse un dessin du montage !!
arf .. fais chier .... c'est bien parce que c'est vous hein !!</big></EM></FONT></P>
<P>&nbsp;</P>
<P ALIGN="CENTER"><IMG SRC="blackbox.JPG" WIDTH="520" HEIGHT="265" ALIGN="BOTTOM" BORDER="0"></P>
<P>&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Je m'en suis pas si mal sorti quand m&ecirc;me !! Faire
&ccedil;a sous paintbrush, j'suis vraiment tar&eacute; mais bon ... La valeur de la r&eacute;sistance est de&nbsp;&nbsp;&nbsp;
1.8 kohm et D1 est une simple diode &eacute;lectroluminescente. En conclusion, ce montage co&ucirc;te que dalle
!!! Passons maintenant aux avertissements ( arf... bien s&ucirc;r qu'il y en a !! ) :</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>- la premi&egrave;re chose &agrave; savoir, c'est qu'il
ne faut pas rester plus de cinq (ndVeinscuts: QUATRE ) minutes en ligne si vous &ecirc;tes dans une grande ville
comme Paris, Lyon ... En effet, Fuck T&eacute;l&eacute;con poss&egrave;de un pti appareil qui d&eacute;tecte et
enregistre votre num&eacute;ro et celui appel&eacute; !! Si vous &ecirc;tes pas dans une grande ville, vous pouvez
t&eacute;l&eacute;phoner pendant 45 minutes facilement !</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>_ enfin, laissez l'interrupteur ferm&eacute; et d&eacute;crochez
votre appareil lors d'un appel. Suivant qui c'est, ouvrez l'interrupteur. Ca evite de se faire gauler connement
!!!</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Boaf voila c'est tout pour les avertissements ! Amusez vous
bien avec ce petit montage.... = ))</EM></big></FONT></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><U><big><EM>Les cartes pr&eacute;-pay&eacute;es :</EM></big></U></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Vous connaissez les cartes pastel ou kertel ?? Non !?? C'est
des cartes qui permettent de t&eacute;l&eacute;phoner &agrave; partir de n'importe quel t&eacute;l&eacute;phone.
On les recharge en appelant le service et en donnant son n&deg; de CB ( eh oui y a une partie carding dans ce plan
l&agrave; !! ). Le principe c'est de s'en servir pour t&eacute;l&eacute;phoner ou pour se connecter &agrave; internet
et de les recharger gratos...</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>La carte kertel, on l'a trouve &agrave; la FNAC. Vous achetez
la moins ch&egrave;re vu que vous allez la recharger gratos !! Sur la carte vous avez un num&eacute;ro du genre
: 1112 XXXX XXXX. Pour se connecter normalement, il faut faire le 3003, puis donner son num&eacute;ro de carte
et ensuite composer le n&deg; d'appel d&eacute;sir&eacute;. C'est tout con quoi !! Pour se connecter &agrave; internet
via cette carte, il suffit de modifier la configuration de votre connection : &agrave; la place de mettre le n&deg;
de connection au provider, vous mettez : 36513003,,,1112XXXXXXXX,,,n&deg; de tel de votre provider.</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Voila c'est tout !! Le 3651 sert &agrave; ne pas se faire
tarcer et les ,,, sont des temporisations pour la connection.</EM></big></FONT></P>
<P>&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Quelques remarques maintenant :</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>- sous AOL 4.0, kertel ne marche pas car le modem perd la
porteuse (m&ecirc;me AOL &agrave; refuser de me donner la solution !! A croire que mon social ne marche pas !!
arf ... ). En cons&eacute;quence, il faut utiliser une version ant&eacute;rieure ou se connecter via un autre provider
et se connecter &agrave; AOL via TCP/IP ensuite.</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>- kertel a chang&eacute; son mode de rechargement des cartes
!! arf ... les enfoir&eacute;s !! Mais n'ayez pas peur, on peut encore les baiser !! (heureusement d'ailleurs)
En fait, lorsque vous voulez recharger la carte, on vous demande votre nom et votre N&deg; de CB. Le probl&egrave;me
est qu'il faut que le nom que vous donnez soit le m&ecirc;me que celui de la carte !! Donc l'utilisation d'un g&eacute;n&eacute;rateur
de N&deg; de CB ne sert &agrave; rien. Essayez donc de piquer le N&deg; d'une connaissance (tant qu'&agrave; faire
quelqu'un que vous aimez pas !!). De plus, il faut que le compte existe r&eacute;&eacute;llement.</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>- quelques conseils : il faut toujours donner le m&ecirc;me
nom lors du rechargement. Pour vous connecter &agrave; internet via kertel, il faut utiliser un num&eacute;ro local
en 01,02,03 ... car si vous mettez le &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
08 36 06 ... kertel consid&egrave;re que c'est un 08 36 6.... En cons&eacute;quence, le cr&eacute;dit temps est
limit&eacute; car le tarif est plus cher !!!</EM></big></FONT></P>
<P>&nbsp;</P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Voila c'est tout pour ce mois !!! Enjoy with this !!!</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>and Fuck the planet (et surtout Fuck T&eacute;l&eacute;con)
!!!</EM></big></FONT></P>
<P><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM>Amusez vous bien mais ne faites surtout pas de b&eacute;tises
!</EM></big></FONT></P>
<P>&nbsp;</P>
<P ALIGN="RIGHT"><FONT COLOR="#FFFFFF" FACE="Comic Sans MS"><big><EM><big><big>TheBoss</big></big> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</EM></big></FONT>
<P>

</BODY>

</HTML>