<HTML><HEAD><TITLE>MemenTo</TITLE>

<meta name="Author" content="[Shmeit Corp]--">
<META content="text/html; charset=iso-8859-1" http-equiv=Content-Type>
<meta http-equiv="content-language" content="fr">
</HEAD>
<body  background="stars.jpg" bgcolor="#000000" link="#FFFFFF" vlink="#FFFFFF" alink="#00E0FF">
<font color=#EEEEEE face=arial, verdana, courier size=2>

<center>
<h1>"deuxi&egrave;me contact : je l&acirc;che ma rage!"<br></h1><br>
Vous vous appretez &agrave; lire de votre plein gr&eacute; le concentr&eacute; de mes 
pens&eacute;es sur des sujets choisis aux feeling, je tiens &agrave; vous pr&eacute;venir 
que je ne fais aucune concession quant au point de vue que je compte 
expliquer et les arguments que j'utiliserai.  De plus mes propos ne 
sont jamais positif : je suis critique pas enfant de choeur...<br>
  <br>
  <br><hr align="center" width="70%">

<br><br>
Pour les initi&eacute;s de la premi&egrave;re me revoil&agrave; !<br>
Pour les autres : il est encore temps de m'&eacute;squiver.(je vous aurais pr&eacute;venus)<br>
<br></center>

<b><u>L'HISTOIRE</u></b> : en philosophie l'on vous demande de la d&eacute;finir : ouais ... c'est pas terrible, aujourd'hui encore cel&agrave; me paraît difficile. Toujours est-il que l'on vous apprends que l'histoire peut avoir deux sens dont l'un est en fait :" le rassemblement de faits s'&eacute;tant produits, de mani&egrave;re &agrave; en laisser une trace,  et ce en toute objectivit&eacute; ". Je le dis bien haut :<br>
 <center> <font size="+1"><b>"c'est un SCANDALE"</b></font></center>
<br><br>
Bon, fini pour l'intro, maintenant je froisse l'&eacute;go de ceux qui ne sont pas d'accord avec &ccedil;a !<br>
Let's go : d'abord c'est tout simple il ya des gens qui sont pay&eacute;s pour informer les autres chaque 
jours en relatant les faits et rien que les faits or je mets au d&eacute;fi 
quiconque de me trouver un journaliste qui sois 100% objectif. 
Certain me diront :<i>"ouin !! c'est pas vrai les informations sont 
fiables et objectives"</i>...<br><br>Ils sont dans l'erreur totale. 
L'objectivit&eacute; serait peut &ecirc;tre (l&agrave; encore sous conditions) de placer 
une camera &agrave; un endroit et ne rien commenter. Le seul fait de poser des questions 
brise le mot <i>"Objectivit&eacute;"</i>, rien que de reformuler les r&eacute;ponses 
aux questions pos&eacute;es brise <i>l'objectivit&eacute;</i>. Je ne parle m&ecirc;me pas 
des conclusions des journalistes qui ne peuvent-&ecirc;tre que subjective.<br>
<br>
Alors pourquoi des hommes dont le travail consiste &agrave; couvrir une 
p&eacute;riode plus importante seraient-ils plus objectifs que ces premiers ?<br> 
J'affirme au contraire qu'ils sont encore plus subjectifs, car l'on 
ne peut pas retracer tous les faits sans exceptions : des passages 
sont survol&eacute;s voir &eacute;touff&eacute;, ou pire encore purement manipul&eacute; et 
transform&eacute;. <br>
<br>
J'entend d'ici votre indignation c'est pourquoi je vais vous raconter 
une petite "histoire" :
<br>
Imaginez un gars moyen, avec un job moyen et  un cerveau ...euh?...
moyen...<br>
Il ne sais pas faire grands choses, mais il a compris quelque chose, 
les hommes cherchent toujours &agrave; gagner du temps.
Il d&eacute;cide donc de vendre des raccourcis aux autres ou plutôt de se 
faire gr&acirc;cieusement r&eacute;com- penser par "l'Etat" s'il d&eacute;couvre un chemin 
plus rapide pour rejoindre un point A &agrave; un point B.<br>
Aussi un jours il part et finit par arriver ... chez vous!<br><br>
Ce n'est pas ce qu'il cherchait mais c'est plutôt pas mal et puis 
les gens qui habitent l&agrave; ( c'est &agrave; dire vous) sont inconnus 
(tous ceux qui l'accompagne sont du m&ecirc;me avis : "on les connais pas")...<br> 
Alors plutôt que de continuer &agrave; chercher son raccourci, il annonce &agrave; 
"l'Etat" qu'il vient de d&eacute;couvrir non pas un nouveau raccourci mais un
 nouvel endroit! Cet endroit sera baptis&eacute; :<br><br>
<center> <font size="+1"><b>LE NOUVEAU MONDE !</b></font></center><br>

Oui, cette histoire ressemble &eacute;trangement &agrave; un truc qui se seraient 
produit en 1492!
<br>
Et c'est l&agrave; que je veux en venir : dans les livres d'histoire, 
le dictionnaire ou les encyclopedies, si vous cherchez un 
"mec moyen" qui r&eacute;pond au nom de COLOMB vous pouvez lire : 
<i>"D&eacute;couvreur des Am&eacute;riques"</i>.<br>
<b><center><br>AAAAAAAAArrgghhhhh..............COLERE !!!!!!!!!!!!!!!!<br></center></b>
<br> Maintenant, je l&acirc;che ma rage ! Je ne peux pas accepter que l'on 
me dise calmement que l'histoire est objective alors que l'un des 
plus gros mensonges jamais cont&eacute; est encore d'actualit&eacute; alors qu'il 
a d&eacute;j&agrave; plus de 400 ans.<br><br>
Oui moi Kspr, j'accuse Christophe Colomb et tous ceux qui lui ont 
dits (et lui disent aujourd'hui encore) <i>"amen"</i> d'&ecirc;tre les plus grands menteurs et assassins (ou complices) que la Terre ait jamais port&eacute;.<br>
Oui, j'accuse et je prouve que cet homme est le plus sombre cr&eacute;tin, le plus vil imposteur de l'histoire!
<br><br>
<u><b>Contre eux tous j'argumente :<br></b></u>
<br>
1) Ce gars &eacute;tait tellement b&ecirc;te que outre le fait de partir vers 
l'Ouest pour rejoindre les Indes ( ce qui  quand m&ecirc;me pr&eacute;sentait 
les plus petites chances de succ&egrave;s quant &agrave; sa mission que de trouver 
une voie plus rapide pour les Indes) ne s'est m&ecirc;me pas rendu compte 
imm&eacute;diatement que les gens qu'il avait en face de lui n'&eacute;taient pas 
des Indiens !
<br><br>
2) Comment peut on dire d'un homme qui est arriv&eacute;, "b&ecirc;tement",  
sur <b>une terre o&ugrave; VIVAIENT DEJA D'AUTRES HOMMES</b>, 
qu'il a d&eacute;couvert quelque chose ? C'est impensable !<br> Cel&agrave; sous 
entend que si quelqu'un arrivait chez vous pour vous en d&eacute;loger et 
dire qu'il a <i>decouvert</i> un nouvel appartement cel&agrave; serait exact et 
parfaitement normal! C'est une honte que de penser cel&agrave;, de plus 
je suis persuad&eacute; que vous ne le laisseriez pas faire et que vous 
crieriez &agrave; l'injustice.<br>
<br>
3) <i>Grace</i> &agrave; ce type d'individus (les colons), des centaines 
de milliers d'hommes sont morts dans des conditions inhumaines et des 
plus effroyables. Si ces assassins avaient consid&eacute;r&eacute;s les peuples 
qu'ils rencontraient pendant leurs voyages comme des hommes et non 
comme des b&ecirc;tes qu'il serait bon d'exploiter (pour s'enrichir ou augmenter son 
pouvoir (quoique l'un dans l'autre)), l'esclavage ne 
serait m&ecirc;me pas dans le petit Robert &agrave; l'heure actuelle et l'Afrique 
ne serait sans doute pas le continent dont les pays sont les plus 
pauvres du monde (et o&ugrave; des enfants meurent de faim &agrave; chaque minute), 
car l'Afrique poss&eacute;dait d'&eacute;norme richesse qui lui aurait permis 
d'occuper une place importante au niveau plan&eacute;taire !<br>
<br>
Ensuite pour &eacute;toffer mes propos je peux vous dire que, de ce premier 
"petit probl&egrave;me d'interpretation historique" est n&eacute; <i><b>l'ESCLAVAGE</b></i> ! 
<br><br>
<i><u>RAPPEL</u></i> : La traite des noirs commence au 16e si&egrave;cle et 
s'acheve officiellement en 1815 mais s'ach&egrave;vera en r&eacute;alit&eacute; &agrave; la fin 
du 19e soit environs 400ans...<br>
<br>
<i><u>QUESTION</u></i> : Combien de morts ? Morts de faim, d'&eacute;puisement 
ou sous les coups d'un "maître" ?<br>
Vous n'en avez aucune id&eacute;e, mais comment cel&agrave; se fait-il ? 
Les historiens sont objectifs, l'auraient -ils "oubli&eacute;" ou le sort 
d'homme noir ne valait il pas la peine il y a 100 ans ?<br>

<br>Par contre les Historiens ont r&eacute;ussis &agrave; &eacute;valuer &agrave; 3 million 
le nombre de Juifs mort durant la 2nde Guerre Mondiale (se 
seraient ils soudain r&eacute;concilier avec les maths ?). <br>
<br>
Jusqu'&agrave; l'ann&eacute;e derni&egrave;re l'anniversaire de l'abolition de l'esclavage 
restait "oubli&eacute;" de tous et subitement on se rappelle que cel&agrave; fais 
150ans (d&eacute;j&agrave; ....:(   ?), mais cette ann&eacute;e par contre le 151&egrave;me 
n'a int&eacute;rress&eacute; qu'une faible minorit&eacute; (noire) ; alors que le nombre de 
plaque comm&eacute;morative et autres manifestation sont l&eacute;gions en m&eacute;moire 
des d&eacute;port&eacute;s Juifs!
<br><br>

Comme ils disent:<br> <br>
<center><b>"On me dit d'oublier l'esclavage, mais j'ai LA HAINE 
comme Kassovitz,<br>
On ne demande pas aux Juifs d'oublier Auschwitz !"</b><br>
<font size="-2"><i>(All rights reserved etc...)</i></font></center>
<br><br>
Alors pour tout cel&agrave; je dis : <b>NON</b>, l'histoire n'est pas objective et 
surtout <b>NON</b>, Christophe Bouffon n'a pas d&eacute;couverts les 
Am&eacute;riques : il a fait massacr&eacute; ceux qu'il nommait les Indiens et 
a contribu&eacute; au plus grand massacre au monde.<br>
<br>
N.B. : A tous les plaisantins qui voudraient me faire dire ce que 
je n'ai absolument pas dit &agrave; savoir que je n'aime pas les Juifs, 
"allez chiez ! , &ccedil;&agrave; ira mieux !" car ce n'est pas vrai !
<br><br>
<br>
<center>
  <br>
  <br>
Je d&eacute;dicasse cette Chronikz au peuple qui &agrave; le plus souffert d'&ecirc;tre<br> 
diff&eacute;rent et qui n'a jamais cess&eacute; de croire en de meilleurs jours.
</center>
</font>