<HTML><HEAD><TITLE>MemenTo</TITLE>

<meta name="Author" content="[Shmeit Corp]--">
<META content="text/html; charset=iso-8859-1" http-equiv=Content-Type>
<meta http-equiv="content-language" content="fr">
</HEAD>
<body  background="stars.jpg" bgcolor="#000000" link="#FFFFFF" vlink="#FFFFFF" alink="#00E0FF">
<font color=#EEEEEE face=arial, verdana, courier size=2>
<center><h1>Cours de Crack <br><font size="-2">(1ere Partie)</font></h1><br></center>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><br><b>Notre objectif:</b> tout vous expliquer de A &agrave; Z pour que vous 
puissiez comprendre comment fonctionne le Cracking. Il va falloir que vous
lisiez bien tout attentivement de fa&ccedil;on &agrave; bien comprendre le cours...</p></font>
<br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><b><h3>Qu'est ce qu'un crack ?</h3></b>
Un crack, est un ch'tit programme qui va
modifier certains octets &agrave; certains emplacements du fichier
cible de fa&ccedil;on &agrave; jouer &agrave; votre jeux pr&eacute;f&eacute;r&eacute; sans CD par
exemple.
Mais bon, passons aux choses s&eacute;rieuses,
pour le crack qui suit, certaines fonctions ne seront pas
expliqu&eacute;es du fait de leurs compl&eacute;xit&eacute;es pour les d&eacute;butants.
(tout les bons cracker l'ont &eacute;t&eacute;s un jour ;)</font><p></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Pour faire votre premier crack, on
a choisi un programme super fastoche &agrave; cracker pour vous
montrer un truc super classique, le saut conditionnel ;))<br>
Comme son nom l'indique, un saut conditionnel, est un passage du 
programme en assembleur qui fait que, si une condition est remplie ou non,
un " saut "vers la suite du programme d'effectue ou non.<br>
Par exemple, une barre de d&eacute;filement s'active <i>a condition
que</i> vous cliquiez avec le bouton de gauche de la souris...Ainsi, le bouton
droit n'aura aucun effet...</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Voici le prog choisi; <strong>Start Clean
v1.2</strong></font> (cliquez <a href="startclean.zip">ici</a>)<br>
Ce programme sert &agrave; supprimer les raccourcis qui ne menent nul part
dans le menu D&eacute;marrer.<br>
</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Tout d'abord, <font color="Aqua">il faut un logiciel, qui
s'appelle un d&eacute;sassembleur</font>. Comme son nom l'indique, il sert &agrave;
d&eacute;sassembler un fichier de fa&ccedil;on &agrave; le rendre lisible et plus
tard compr&eacute;hensible. Pour ma part, j'utilise WinDasm 8.9 facile
&agrave; trouver sur le net :) </font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial"><font color="Aqua">Il faut aussi se qu'on appelle un &eacute;diteur
h&eacute;xad&eacute;cimal</font>. Comme son nom l'indique aussi, il sert &agrave; faire
apparaitre un fichier sous forme h&eacute;xad&eacute;cimal pour pouvoir
remplacer un octet par un autre, de fa&ccedil;on a pouvoir quand m&ecirc;me
executer le prog apr&egrave;s modification(s) pr&eacute;cise(s). Mon
pr&eacute;fer&eacute; est HexWorks 3.X, mais il y a ausi WinHex 8.3 dont le
crack est fourni sur le site ;)...N'importe quel &eacute;diteur hexadecimal
fera l'affaire :)</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Enfin, il vous faudra dans tous les cas (enfin
presque) un cerveau r&eacute;veill&eacute; et en &eacute;tat de marche ;)</font></p>
<br>
<br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><strong><h3>Bon, passons au crack</h3></strong>
D'abord, lancez StartClean. Au d&eacute;marrage,
une fen&ecirc;tre s'affiche pour pouvoir s'enregistrer. Mais le bl&egrave;m
c'est que vouz avez peut &ecirc;tre pas que ca &agrave; faire d'envoyer des
tunes, d'ou le crack ;)</font><p></p>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Donc, pour pouvoir voir le programme de
fa&ccedil;on lisible, il faut l'ouvrir avec un d&eacute;sassembleur :)</font></p>
<font color=#EEEEEE face=arial, verdana, courier size=2><p>Avant tout, <font color="Aqua">faite une copie de StartClean.exe</font><br>
<font face="Arial"><font color="Aqua">Lancez WinDasm</font>...</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Comme c'est le premier lancement de WinDasm, il faut choisir la fonte par default que l'on va utiliser...Faites :<br>
<font color="Aqua">Disassembler =&gt;Font... =&gt; Select Font =&gt;...</font> <br>
Et pour sauvegarder la fonte choisie, faite :<br>
<font color="Aqua"> Disassembler =&gt; Font =&gt; Save Default Font</font>.</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Allez cherchez ensuite la copie du fichier
executable STARTCLN.EXE de la fa&ccedil;on suivante :<br>
<font color="Aqua">Disassembler =&gt; Open File to Disassemble...</font>;<br>
double-cliquer sur la copie de <font color="Aqua">startcln.exe</font></font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><h3>Ouch!</h3>
Ben ouais, c'est ca l'assembleur ;)<br>
Ce sont de petites instructions qui s'enchaînent pour former un tout, un programme.</font><p></p>
<font color=#EEEEEE face=arial, verdana, courier size=2><p>L'assembleur est le language de programmation le plus bas. Quand vous programmez que se soit en
Delphi ou en C, tout est traduit en assembleur pour que votre prog soit compr&eacute;hensible par l' ordinateur, car ne l'oublions
pas l'assembleur, c'est le language machine par exellence. Ses avantages r&eacute;sident dans le fait qu'il est tout de suite compris
par la machine, ainsi, un programme, m&ecirc;me &eacute;crit en C sera ex&eacute;cut&eacute; moins rapidement que s'il avait &eacute;t&eacute; fait en
assembleur ( de quelques dixi&egrave;mes de secondes, mais bon... ).</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Ok, vous devez peut-&ecirc;tre vous dire "
bord&egrave;l c'est quoi ce truc, je quitte &ccedil;a et je retourne
t&eacute;l&eacute;charger des cracks tous faits!"
Si c'est ce que vous vous dites, alors quittez ce tutorial, 
et vous serez oblig&eacute; d'attendre sur le net que les cracks sortent,
et surtout, vous ratterez le plus important, la satisfaction
personnelle et le monde superbe qu'est l'assembleur.</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Par contre si vous vous dites "
bord&egrave;l c'est quoi ce truc, c'est chelou mais j'ai quand m&ecirc;me
envie de savoir comment on s'y prend pour cracker" ; alors
la suite de ce tutorial est pour vous ;))</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Bon, ce qui apparait &agrave; l'&eacute;cran, s'appelle
un <em><strong>listing</strong></em>. C'est l&agrave; dessus que l'ont
va &eacute;tudier.</font></p>
<center><img src="description.gif" alt="DESCRIPTION"></center>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">R&eacute;capitulons. En d&eacute;marrant Start Clean,
une option nous propose de vous enregistrer. Allez-y et entrez un
truc bidon puis faite Ok. Si &ccedil;a marche, c'est que vous avez un
m&eacute;ga-bol du fait qu'il y des possibilit&eacute;es quasiment infines !
Sinon le prog vous affiche " Incorrect code !". Un saut
conditionnel est donc pr&eacute;sent :)) Dans la boîte de dialogue en
question o&ugrave; l'on doit entrer son code et-tout, il y a deux
cellules de saisie. Celle du nom et celle du code ;) L'une
s'appelle "name", et l'autre "code"</font></p>
<br>
<br>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><h3>C'est &agrave; ce moment l&agrave; que l'on va faire un ch'tit peut d'assembleur...</h3>
Revenez a WinDasm.<br>
Avant de lancer une recherche sur un mot, <b>on va se placer directement &agrave; l'entr&eacute;e
du prog</b>, car ce qu'il y a avant on s'en fou un peut ;) Pour ca, faites:
<font color="Aqua"> Goto =&gt; Goto Code Start..</font>.</font><p></p>
</font><p></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial"><b>Lancez ensuite une recherche automatique sur
le mot "name&quot</b>; ( ne rentrez pas les guïllemets ), car
il fait partie de la boîte de dialogue se chargeant de la saisie
du code. On pourrait aussi rechercher " code "...<br>
Pour faire cette recherche, faites: <font color="Aqua">Search =&gt; Find Text..  </font></font></p><font face="Arial">

<center><img src="search.gif"></center>
<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">Et l&agrave;, vous allez forcement tomber sur
quelque chose. Cependant, il se peut qu'il y ait plusieurs fois ce mot
dans le programme...donc, par mesure de prudence, faites <font color="Aqua">"Suivant"</font><br>
Vous verrez alors que vous arrivez a d'autre endroit du programme...Alors, que choisir ??<br><br>
Revenez au debut du code (<font color="Aqua"> Goto =&gt; Goto Code Start..</font>).
Refaite une recherche et arretez vous a la seconde occurance  de " name "
(qui doit etre trouv&eacute;e a la ligne 375), car elle se trouve &agrave; un endroit particuli&egrave;rement interressant.
Mais alors pourquoi cet endroit est t-il si interessant ???</font></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Parce que si l'on observe bien cette petite
partie (ce qu'il y a avant et apres...), on remarque que l'indication
<font  color="teal" face="Arial">"*Reference To: ADVAPI32. RegCreateKey, Ord: 00C6h
"</font>est affich&eacute;e.<br>
Cette indication de fonction indique que Start Clean va inscrire un truc dans la base de
registre de Windows, sans doute votre nom et code...<b><i>a condition que</i></b> votre code soit bon :)
</p></font>
Voyons voir ce listing...<br><br>
<center><img src="allcode.gif" alt="AllCode"></center>

<p><font color=#EEEEEE face=arial, verdana, courier size=2>
L'instruction que l'on recherche est un saut conditionnel. En assembleur, ca se traduit par :<br>
<b><font color="Yellow">JNE, JNZ</font></b>... qui sont des sauts appel&eacute; de "non egalit&eacute;"...<br>
<b><font color="Yellow">JE, JZ</font></b>.... qui sont des saut qui s'effectue en cas d'"egalit&eacute;"...<br><br>
<i>Egalit&eacute;</i> signifie ici "deux valeur identique"... Lorsque que le programme va comparez votre code
avec le vrai, il va indiquez si il sont "egaux" ou non...<br>
Si le saut est de forme <font color="Yellow">JE</font>, alors on dira que "le saut se fait <b>si</b> les codes sont &eacute;gaux".<br>
Si le saut est de la forme <font color="Yellow">JNE</font>, alors on diras que "le saut se fait <b>si</b> les codes ne sont pas egaux"...<br>
<br>
Il existe un type de saut appel&eacute; <i>inconditionnel</i>, c'est a dire que le saut s'effectue sans conditions...<br> 
Ce saut s'ecrit <b><font color="Yellow">JMP</font></b> en assembleur, mais cela ne nous serviras pas pour ce tutorial...<br>
<br>
Donc, pour revenir a StartClean, il va falloir qu'on trouve tout les <i>sauts</i> qu'il y a dans 
le bout de code ci dessus, puis qu'on analyse ou est-ce qu'il nous font sauter...<br>
<br>
On est chanceux, ici il n'y a qu'un seul saut qui est a l'adresse <font color="Yellow">004011EB</font>, et qui est situ&eacute; juste apres
un test (Un TEST est l'instruction qui determine si une valeur est egale a zero...).<br>
On a donc :
<center><img src="good.gif"></center><br>
L'instruction <font color="Yellow">JNE 00401271</font> signifie : "Sauter a l'adresse 00401271 si la valeur test&eacute;e n'est pas egale a zero."<br>
Il y a fort a parier que la valeur testee soit le numero de serie que vous avez rentrer au pif.<br>
<br>Il faut bien comprendre que souvent, un numero de serie est considere comme valide lorsque la valeur du test est egale a zero.
Autrement, dans le cas ou le test n'est pas egale a zero, alors ce numero est reconnu comme incorrecte...
C'est un peu comme le courant electrique : 0=ouvert et 1=fermer...Compris ? <br><br>
Donc, "Sauter a l'adresse 00401271 si la valeur test&eacute;e n'est pas egale a zero." siginfie que si le code est mauvais, 
on va "sauter" tout ce qu'il y a entre l'adresse 004011EB (l'endroit d'o&ugrave; l'on saute)
et l'adresse 00401271 (l'endroit ou le saut nous amene...).<br><br>
Regardez sur le listing...concretement, le saut va passer au dessus de toutes la partie du programme qui inscrit
notre nom et notre code dans la base de registre...<br><br>

Par contre, <i>si le code est bon, le saut ne
s'effectue pas</i> et le programme va continuer son listing en
passant par <font  color="teal" face="Arial">" *
Reference To: ADVAPI32.RegCreateKey "</font> et
</font><font  color="teal" face="Arial">" * Reference To: ADVAPI32.RegCloseKey "</font>
qui represente la proc&eacute;dure de cr&eacute;ation de votre code perso dans la base de
registre de Windows 9x. Cette &eacute;tape est <strong>importante</strong>
&agrave; comprendre et si vous ne l'avez pas comprise relisez la plus
attentivement...</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Donc, il va falloir que l'on modifie le saut <font color="Yellow">jne 00401271</font><br>
Dans ce cas de figure, il faut faire ce que l'on appelle "<em>nopper</em>"
une valeur :)<br>
Mais avant, un p'tit cour sur l'h&eacute;xad&eacute;cimal s'impose :))</p></font>
<br><br>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><h3>L 'h&eacute;xad&eacute;cimal </h3></font><p></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>D'abord oubliez la fa&ccedil;on dons vous avez
appris &agrave; compter. Parce qu' en h&eacute;xa, on compte le la fa&ccedil;on
suivante :<br><br>
1 2 3 4 5 6 7 8 9 A B C D E F
<br><br>
Par exemple 15 en d&eacute;cimal s' ecrit F en
h&eacute;xad&eacute;cimal. Mais pouquoi dit'on h&eacute;xad&eacute;cimal ? Tout
simplement parce qu' apr&egrave;s les neufs premier chiffres il y &agrave;
six lettres, 6 d'o&ugrave; h&eacute;xa, comme un h&eacute;xagone a six cot&eacute;s ;)
Sinon pour ce qui est des conversions &eacute;tout, nous verons ca dans
un autre tutorial ;)</p></font><br>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><h5>Que veut dire <em>nopper</em> une valeur ?</h5>
<em>Nopper</em> une valeur, veut dire que l'on va remplacer une valeur par un 90 en h&eacute;xad&eacute;cimal,
ce qui correspond &agrave; un <strong>no opperation </strong>.L'instruction <strong>nop
</strong>en assembleur est un peu bizarre, puisqu'elle ne sert &agrave;
rien. Sauf dans certains cas pour faire perdre du temps CPU en
encombrant ses entr&eacute;es/sorties.</font><p></p>

Voici une petite liste qui vous indique la valeur Hexadecimale de quelque instruction Assembleur.<br>
<br>
<table align="center" bgcolor=#000000 border=1 bordercolordark=#000000>
<tr><td><font color="White"> NOP </font></td><td><font color="Silver"> 90 </font></td></tr>
<tr><td><font color="White"> JNE </font></td><td><font color="Silver"> 75 ou 0F85xxx </font></td></tr>
<tr><td><font color="White"> JE </font></td><td><font color="Silver"> 74 ou 0F84xxx </font></td></tr>
<tr><td><font color="White"> JMP </font></td><td><font color="Silver"> EB ou E9 </font></td></tr>
<tr><td><font color="White"> XOR </font></td><td><font color="Silver"> 33 </font></td></tr>
<tr><td><font color="White"> RET </font></td><td><font color="Silver"> C3 </font></td></tr>
</table>
<br>Il existe encore beaucoup d'autres instruction, mais qui sont peu interessantes a notre stade ;)<br>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Regardez la valeur " <font color="Fuchsia">0F8580000000</font> " se trouvant &agrave; la gauche du "jne" dans le listing.<br>
C'est en fait sa valeur en assembleur convertie en h&eacute;xad&eacute;cimal.
<font color="Fuchsia">0F85</font> c'est <font color="Yellow">JNE</font> et 80000000 c'est le bloc memoire ou l'on saute...
Un bloc m&eacute;moire, si vous ne savez pas, c'est un peut comme un petit carr&eacute; de m&eacute;moire
&eacute;l&eacute;ctronique qui va contenir une information. Par exemple si vous collez un
post-it avec &eacute;crit dessus " ach&egrave;te du pain pour ce soir
"sur un porte, et ben la porte c'est le bloc m&eacute;moire et le
post-it l'information ;)</p></font>


<font color=#EEEEEE face=arial, verdana, courier size=2><p><h5>Comment <em>nopper</em> le saut conditionnel ?</h5>
Il suffit d' ouvrir le fichier STARTCLN.EXE avec votre &eacute;diteur
h&eacute;xadecimal, de lancer une recherche automatique sur la valeur
<font color="fuchsia" face="Arial">" 0F 85 80 00 00 00 "</font>
(qui represente le JNE 00401271 en hexadecimal)... Une
fois cette valeur trouv&eacute;e, vous la remplacer par <font
 color="fuchsia" face="Arial">" 90 90 90 90 90 90 "</font>
, puis vous enregistrer les modifications (n'oubliez pas de faire une sauvegarde
du fichier d'origine au pr&eacute;alable, au cas ou vous vous tromperiez...(on ne sait jamais).
</font><p></p>

<font color=#EEEEEE face=arial, verdana, courier size=2><p>Maintenant, lancer le programme ainsi modifie...<br>
Quoi ? La boite de dialogue d'enregistrement est toujours pr&eacute;sente ? 
Normal puisque le programme n'a pas encore enregistrer votre code dans la base de
registre de Windows 9x. il faut donc cliquer sur " REGISTER
" et rentrer un nom, un code bidon, puis cliquer sur Ok.<br> Et
l&agrave; ca marche! Car le saut "jne" n'existe plus,
donc le prog continue tranquilement sont listing en passant par
les <font color="Teal" face="Arial">" * Reference
To: ADVAPI32.RegCreateKeyExA "</font> et <font
color="Teal" face="Arial">" * Reference To: ADVAPI32.
RegCloseKey "</font>.
Le prog est donc complet et illimit&eacute;. Vous
pourrez aussi observer qu'il &agrave; inscrit un code personnel qu'il
s'est auto-g&eacute;n&eacute;rer dans la base de registre de Windows9x ;))<br>
Miracle ? Non, assembleur ;)))</p></font>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><font face="Arial">PS: j'dit pas ca pour vous d&eacute;couragez,
mais pour un cracker cons&eacute;quant, un tel raisonnement,
observations et crack comprit dans ce type de s&eacute;curit&eacute; ne prend
que deux &agrave; trois minutes et encore... Alors entrainez vous bien
et vous verrez, c'est pas si compliquer que &ccedil;a en &agrave; l'air ;)</font></p>
<br><br>

<font color=#EEEEEE face=arial, verdana, courier size=2><p><h3>Ch'tites astuces pour bien commencer &agrave; cracker :)</h3>
- Lire pleins de tutoriaux fait sur de petit progs et les comprendres<br>
- Faut pas se prendre la t&ecirc;te et laisser son &eacute;sprit logique tourner seul, ca donne plus
d'endurance<br>
- Faire une pause de 5 minutes minimum toutes les heures, quand on commence &agrave; cracker, c'est
mieux<br>
- Faire ses devoirs avant ;) , car cracker, surtout pour la premi&egrave;re fois prend du temps<br>
- S'acheter un p'tit bouquin sur l'assembleur. Pour moi la r&eacute;ference, c'est " L' assembleur
" de Bernard Fabrot, &eacute;ditions Marabout, env: 50 balles :)<br>
- Ne pas s'auto proclamer bon crackeur parce qu'on &agrave; cracker 1 ou 2 progs<br>
- Avoir un bon &eacute;cran, car pour le listing, c'est primordial<br>
- Ne pas rester tout le temps dans le d&eacute;sassembleur et naviguer de fa&ccedil;on &eacute;quilibr&eacute; entre ce
dernier et l'editeur h&eacute;xa (N'&eacute;sitez pas &agrave; faire pleins d'&eacute;ssais)<br>
- D&eacute;sassemblez un fichier d'origine et le m&ecirc;me ficher mais cracker pour comparer 
et comprendre les modif' qui ont &eacute;t&eacute;s faites </font><p></p>

<center>
<br><br>
  <br>
</center>
</font></font></font></font></font></font></font></font></font></font></font></font></font></font></body>
</html>
