
	 _                        _             _                 _                  
	| |                      | |           | |               | |                 
	| | _____ _ __ _ __   ___| |   __ _  __| |_   _____ _ __ | |_ _   _ _ __ ___ 
	| |/ / _ \ '__| '_ \ / _ \ |  / _` |/ _` \ \ / / _ \ '_ \| __| | | | '__/ _ \
	|   <  __/ |  | | | |  __/ | | (_| | (_| |\ V /  __/ | | | |_| |_| | | |  __/
	|_|\_\___|_|  |_| |_|\___|_|  \__,_|\__,_| \_/ \___|_| |_|\__|\__,_|_|  \___|
                                                                             



    -- [ Aventures dans le kernel : A la recherche du processus perdu

Ah, l'exploration de contrées sauvages, les indigènes parlant des
dialectes inconnus, les ponts de singe s'élançant de bord en bord
à travers de vertigineux précipices... Non, ca n'est pas de la
publicité pour le prochain Indiana Jones. Juste de quoi vous mettre
l'eau à la bouche pour l'article qui suit.

Partir à l'aventure dans la jungle des structures du noyau de Windows
(XP nosp en l'occurence), c'est toute une expédition. Quelques 
cartes commencent à être disponibles, et la Terra Incognita se
remplit peu à peu. Mais c'est loin de donner envie à un homme
civilisé d'y mettre le pied. Après de multiples recoupements et des
heures d'errance, je suis parvenu à mettre au clair un petit guide
de survie indiquant de fidèles repères pour s'orienter.

Laissez-vous emporter par cette invitation au voyage. Préparez vos
sacs et vos rations de survie !
En route, Junior.
Indiana, père. Je préfère Indiana !



AVANT DE SE METTRE EN ROUTE

	. installer windbg
	. installer les symboles
	. configurer pour crash dump
	. copier appli et driver
	. faire un write
	. récupérer le crashdump
	. lancer windbg et ouvrir le crashdump


PROCESSOR CONTROL REGION

	"Par FS tu entreras, la région de contrôle tu trouveras"

Par où attaquer ? Comme dans l'userland, le point d'entrée dans le
labyrinthe des structures du noyau est FS:0. FS pointe sur le
Processor Control Region (KPCR). Cette structure se trouve à
l'adresse 0xFFDFF000. Bien que très stable, pour éviter de hardcoder
cette adresse, on la retrouve en FS:0x1C. 



APERCU DES STRUCTURES

Le KPCR contient une structure NT_TIB à l'offset zéro. Il contient
des informations sur l'état de l'exécution dans le kernel : kernel
stack, kernel exception. Pour mémoire, dans l'userland un thread
est caractérisé par une structure Thread environment Block (TEB) qui
commence lui-aussi par un TIB. Le champ Self du nt_tib contient
l'adresse du tib dans l'userland, c'est à dire le TEB du thread qui
s'exécutait lorsqu'a eu le passage dans le noyau. Ca va, pas perdu ?

nt!_KPCR
   +0x000 NtTib            : _NT_TIB
	   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD
	   +0x004 StackBase        : Ptr32 Void
	   +0x008 StackLimit       : Ptr32 Void
	   +0x00c SubSystemTib     : Ptr32 Void
	   +0x010 FiberData        : Ptr32 Void
	   +0x010 Version          : Uint4B
	   +0x014 ArbitraryUserPointer : Ptr32 Void
	   +0x018 Self             : Ptr32 _NT_TIB
   +0x01c SelfPcr          : Ptr32 _KPCR
   +0x020 Prcb             : Ptr32 _KPRCB
   +0x024 Irql             : UChar
   +0x028 IRR              : Uint4B
   +0x02c IrrActive        : Uint4B
   +0x030 IDR              : Uint4B
   +0x034 KdVersionBlock   : Ptr32 Void
   +0x038 IDT              : Ptr32 _KIDTENTRY
   +0x03c GDT              : Ptr32 _KGDTENTRY
   +0x040 TSS              : Ptr32 _KTSS
   +0x044 MajorVersion     : Uint2B
   +0x046 MinorVersion     : Uint2B
   +0x048 SetMember        : Uint4B
   +0x04c StallScaleFactor : Uint4B
   +0x050 DebugActive      : UChar
   +0x051 Number           : UChar
   +0x052 Spare0           : UChar
   +0x053 SecondLevelCacheAssociativity : UChar
   +0x054 VdmAlert         : Uint4B
   +0x058 KernelReserved   : [14] Uint4B
   +0x090 SecondLevelCacheSize : Uint4B
   +0x094 HalReserved      : [16] Uint4B
   +0x0d4 InterruptMode    : Uint4B
   +0x0d8 Spare1           : UChar
   +0x0dc KernelReserved2  : [17] Uint4B
   +0x120 PrcbData         : _KPRCB



EXAMEN DES VALEURS

Comme prévu, le champ SelfPcr à l'offset 0x1C contient l'adresse
linéaire du KPCR, parfait pour cesser d'utiliser FS lors des accès.
Le PRCB, nous y reviendrons au chapitre suivant. 

Le champ KdVersionblock contient un pointeur vers une structure
sur laquelle nous reviendrons plus tard, le _KDDEBUGGER_DATA64.
Entre autre chose, nous trouvons un flag pour détecter un débug
mode, ainsi que l'adresse de l'IDT et de la GDT.

kd> dt _kpcr 0xffdff000
nt!_KPCR
   +0x000 NtTib            : _NT_TIB
	   +0x000 ExceptionList    : 0xfa463b64 
	   +0x004 StackBase        : 0xfa463df0 
	   +0x008 StackLimit       : 0xfa45f000 
	   +0x00c SubSystemTib     : (null) 
	   +0x010 FiberData        : (null) 
	   +0x010 Version          : 0
	   +0x014 ArbitraryUserPointer : (null) 
	   +0x018 Self             : 0x7ffde000
   +0x01c SelfPcr          : 0xffdff000 
   +0x020 Prcb             : 0xffdff120 
   +0x024 Irql             : 0 ''
   +0x028 IRR              : 0
   +0x02c IrrActive        : 0
   +0x030 IDR              : 0xffffffff
   +0x034 KdVersionBlock   : 0x80537d38 
   +0x038 IDT              : 0x8003f400 
   +0x03c GDT              : 0x8003f000 
   +0x040 TSS              : 0x80042000 
   +0x044 MajorVersion     : 1
   +0x046 MinorVersion     : 1
   +0x048 SetMember        : 1
   +0x04c StallScaleFactor : 0xbfc
   +0x050 DebugActive      : 0 ''
   +0x051 Number           : 0 ''
   +0x052 Spare0           : 0 ''
   +0x053 SecondLevelCacheAssociativity : 0x8 ''
   +0x054 VdmAlert         : 0
   +0x058 KernelReserved   : [14] 0
   +0x090 SecondLevelCacheSize : 0x80000
   +0x094 HalReserved      : [16] 0
   +0x0d4 InterruptMode    : 0
   +0x0d8 Spare1           : 0 ''
   +0x0dc KernelReserved2  : [17] 0
   +0x120 PrcbData         : _KPRCB

Dans le TIB, on remarque que les premiers pointeurs désignent un
emplacement dans le noyau (supérieurs à F0000000) alors que le
champ Self pointe sur un emplacement dans l'userland, ce qui
confirme le fait qu'il désigne le TIB du thread userland.



LE _KDDEBUGGER_DATA64

Cette structure contient surtout quelques variables non exportées
par ntoskrnl. Du coup, les voici faciles à trouver. Faciles, mais
c'est pas gagné pour autant. La structure semble plus être alignée
sur 64bits que 32 à ce que j'ai pu en voir dans mon crash dump.
Une valeur sûre est l'offset 0x078 désignant PsActiveProcessHead,
c'est à dire pointant sur la _LIST_ENTRY du champ ActiveProcessLinks
de l'eprocess du premier processus créé, à savoir System. Voir le
chapitre sur les processus pour plus de détail.

_KDDEBUGGER_DATA32 
+0x000	DBGKD_DEBUG_DATA_HEADER64 	Header

+	ULONG 	KernBase
+	ULONG 	BreakpointWithStatus

+	ULONG 	SavedContext

+	USHORT 	ThCallbackStack
+	USHORT 	NextCallback
+	USHORT 	FramePointer
+	USHORT 	PaeEnabled:1
+	ULONG 	KiCallUserMode
+	ULONG 	KeUserCallbackDispatcher

+0x070	PLIST_ENTRY 	PsLoadedModuleList
+0x078	PLIST_ENTRY 	PsActiveProcessHead
+	ULONG 	PspCidTable

+	ULONG 	ExpSystemResourcesList
+	ULONG 	ExpPagedPoolDescriptor
+	ULONG 	ExpNumberOfPagedPools

+	ULONG 	KeTimeIncrement
+	ULONG 	KeBugCheckCallbackListHead
+	ULONG 	KiBugcheckData

+	ULONG 	IopErrorLogListHead

+	ULONG 	ObpRootDirectoryObject
+	ULONG 	ObpTypeObjectType

+	ULONG 	MmSystemCacheStart
+	ULONG 	MmSystemCacheEnd
+	ULONG 	MmSystemCacheWs

+	ULONG 	MmPfnDatabase
+	ULONG 	MmSystemPtesStart
+	ULONG 	MmSystemPtesEnd
+	ULONG 	MmSubsectionBase
+	ULONG 	MmNumberOfPagingFiles

+	ULONG 	MmLowestPhysicalPage
+	ULONG 	MmHighestPhysicalPage
+	ULONG 	MmNumberOfPhysicalPages

+	ULONG 	MmMaximumNonPagedPoolInBytes
+	ULONG 	MmNonPagedSystemStart
+	ULONG 	MmNonPagedPoolStart
+	ULONG 	MmNonPagedPoolEnd

+	ULONG 	MmPagedPoolStart
+	ULONG 	MmPagedPoolEnd
+	ULONG 	MmPagedPoolInformation
+	ULONG 	MmPageSize

+	ULONG 	MmSizeOfPagedPoolInBytes

+	ULONG 	MmTotalCommitLimit
+	ULONG 	MmTotalCommittedPages
+	ULONG 	MmSharedCommit
+	ULONG 	MmDriverCommit
+	ULONG 	MmProcessCommit
+	ULONG 	MmPagedPoolCommit
+	ULONG 	MmExtendedCommit

+	ULONG 	MmZeroedPageListHead
+	ULONG 	MmFreePageListHead
+	ULONG 	MmStandbyPageListHead
+	ULONG 	MmModifiedPageListHead
+	ULONG 	MmModifiedNoWritePageListHead
+	ULONG 	MmAvailablePages
+	ULONG 	MmResidentAvailablePages

+	ULONG 	PoolTrackTable
+	ULONG 	NonPagedPoolDescriptor

+	ULONG 	MmHighestUserAddress
+	ULONG 	MmSystemRangeStart
+	ULONG 	MmUserProbeAddress

+	ULONG 	KdPrintCircularBuffer
+	ULONG 	KdPrintCircularBufferEnd
+	ULONG 	KdPrintWritePointer
+	ULONG 	KdPrintRolloverCount

+	ULONG 	MmLoadedUserImageList
	DWORD_PTR NtBuildLab;
	 DWORD_PTR KiNormalSystemCall;

	DWORD_PTR KiProcessorBlock;
	DWORD_PTR MmUnloadedDrivers;
	DWORD_PTR MmLastUnloadedDriver;
	DWORD_PTR MmTriageActionTaken;
	DWORD_PTR MmSpecialPoolTag;
	DWORD_PTR KernelVerifier;
	DWORD_PTR MmVerifierData;
	DWORD_PTR MmAllocatedNonPagedPool;
	DWORD_PTR MmPeakCommitment;
	DWORD_PTR MmTotalCommitLimitMaximum;
	DWORD_PTR CmNtCSDVersion;

	DWORD_PTR MmPhysicalMemoryBlock;
	DWORD_PTR MmSessionBase;
	DWORD_PTR MmSessionSize;
	DWORD_PTR MmSystemParentTablePage;


80545b28 : PsLoadedModuleList
 0x80547b58 : PsActiveProcessHead
Public Attributes
LIST_ENTRY64 List ULONG OwnerTag ULONG Size 

DBGKD_DEBUG_DATA_HEADER64 Header ULONG64 KernBase ULONG64
BreakpointWithStatus ULONG64 SavedContext USHORT ThCallbackStack
USHORT NextCallback USHORT FramePointer USHORT PaeEnabled:1 ULONG64
KiCallUserMode ULONG64 KeUserCallbackDispatcher ULONG64
PsLoadedModuleList ULONG64 PsActiveProcessHead ULONG64 PspCidTable
ULONG64 ExpSystemResourcesList ULONG64 ExpPagedPoolDescriptor
ULONG64 ExpNumberOfPagedPools ULONG64 KeTimeIncrement ULONG64
KeBugCheckCallbackListHead ULONG64 KiBugcheckData ULONG64
IopErrorLogListHead ULONG64 ObpRootDirectoryObject ULONG64
ObpTypeObjectType ULONG64 MmSystemCacheStart ULONG64 MmSystemCacheEnd
ULONG64 MmSystemCacheWs ULONG64 MmPfnDatabase ULONG64 MmSystemPtesStart
ULONG64 MmSystemPtesEnd ULONG64 MmSubsectionBase ULONG64
MmNumberOfPagingFiles ULONG64 MmLowestPhysicalPage ULONG64
MmHighestPhysicalPage ULONG64 MmNumberOfPhysicalPages ULONG64
MmMaximumNonPagedPoolInBytes ULONG64 MmNonPagedSystemStart ULONG64
MmNonPagedPoolStart ULONG64 MmNonPagedPoolEnd ULONG64 MmPagedPoolStart
ULONG64 MmPagedPoolEnd ULONG64 MmPagedPoolInformation ULONG64
MmPageSize ULONG64 MmSizeOfPagedPoolInBytes ULONG64 MmTotalCommitLimit
ULONG64 MmTotalCommittedPages ULONG64 MmSharedCommit ULONG64
MmDriverCommit ULONG64 MmProcessCommit ULONG64 MmPagedPoolCommit
ULONG64 MmExtendedCommit ULONG64 MmZeroedPageListHead ULONG64
MmFreePageListHead ULONG64 MmStandbyPageListHead ULONG64 MmModifiedPageListHead
ULONG64 MmModifiedNoWritePageListHead ULONG64 MmAvailablePages ULONG64
MmResidentAvailablePages ULONG64 PoolTrackTable ULONG64 NonPagedPoolDescriptor
ULONG64 MmHighestUserAddress ULONG64 MmSystemRangeStart ULONG64 MmUserProbeAddress
ULONG64 KdPrintCircularBuffer ULONG64 KdPrintCircularBufferEnd ULONG64
KdPrintWritePointer ULONG64 KdPrintRolloverCount ULONG64 MmLoadedUserImageList
ULONG64 NtBuildLab ULONG64 KiNormalSystemCall ULONG64 KiProcessorBlock ULONG64
MmUnloadedDrivers ULONG64 MmLastUnloadedDriver ULONG64 MmTriageActionTaken ULONG64
MmSpecialPoolTag ULONG64 KernelVerifier ULONG64 MmVerifierData ULONG64
MmAllocatedNonPagedPool ULONG64 MmPeakCommitment ULONG64 MmTotalCommitLimitMaximum
ULONG64 CmNtCSDVersion ULONG64 MmPhysicalMemoryBlock ULONG64 MmSessionBase ULONG64
MmSessionSize ULONG64 MmSystemParentTablePage 

PROCESSOR CONTROL BLOCK

Le KPRCB fait suite au KPCR. On trouve fréquemment des références
à fs:0x124, ce qui désigne en fait le champ CurrentThread du KPRCB.
Pour être parfaitement rigoureux, il faudrait obtenir l'adresse du
KPRCB au moyen de KPCR:Prcb. Mais les deux structures se touchant
il est inutile d'en passer par là.

Il contient des pointeurs utiles sur le thread en cours, le prochain
prévu pour exécution et un pointeur vers l'idle thread. On trouve
également la vitesse du processeur et le fabricant du processeur,
ca n'est pas très utile mais c'est là ! Il y a des conteurs de temps,
des informations sur les DPC, et le contexte du processeur.



APERCU DES STRUCTURES

   +0x000 MinorVersion     : Uint2B
   +0x002 MajorVersion     : Uint2B
   +0x004 CurrentThread    : Ptr32 _KTHREAD
   +0x008 NextThread       : Ptr32 _KTHREAD
   +0x00c IdleThread       : Ptr32 _KTHREAD
   +0x010 Number           : Char
   +0x011 Reserved         : Char
   +0x012 BuildType        : Uint2B
   +0x014 SetMember        : Uint4B
   +0x018 CpuType          : Char
   +0x019 CpuID            : Char
   +0x01a CpuStep          : Uint2B
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] Uint4B
   +0x37c HalReserved      : [16] Uint4B
   +0x3bc PrcbPad0         : [92] UChar
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8] UChar
   +0x4a0 NpxThread        : Ptr32 _KTHREAD
   +0x4a4 InterruptCount   : Uint4B
   +0x4a8 KernelTime       : Uint4B
   +0x4ac UserTime         : Uint4B
   +0x4b0 DpcTime          : Uint4B
   +0x4b4 DebugDpcTime     : Uint4B
   +0x4b8 InterruptTime    : Uint4B
   +0x4bc AdjustDpcThreshold : Uint4B
   +0x4c0 PageColor        : Uint4B
   +0x4c4 SkipTick         : Uint4B
   +0x4c8 MultiThreadSetBusy : UChar
   +0x4c9 Spare2           : [3] UChar
   +0x4cc ParentNode       : Ptr32 _KNODE
   +0x4d0 MultiThreadProcessorSet : Uint4B
   +0x4d4 MultiThreadSetMaster : Ptr32 _KPRCB
   +0x4d8 ThreadStartCount : [2] Uint4B
   +0x4e0 CcFastReadNoWait : Uint4B
   +0x4e4 CcFastReadWait   : Uint4B
   +0x4e8 CcFastReadNotPossible : Uint4B
   +0x4ec CcCopyReadNoWait : Uint4B
   +0x4f0 CcCopyReadWait   : Uint4B
   +0x4f4 CcCopyReadNoWaitMiss : Uint4B
   +0x4f8 KeAlignmentFixupCount : Uint4B
   +0x4fc KeContextSwitches : Uint4B
   +0x500 KeDcacheFlushCount : Uint4B
   +0x504 KeExceptionDispatchCount : Uint4B
   +0x508 KeFirstLevelTbFills : Uint4B
   +0x50c KeFloatingEmulationCount : Uint4B
   +0x510 KeIcacheFlushCount : Uint4B
   +0x514 KeSecondLevelTbFills : Uint4B
   +0x518 KeSystemCalls    : Uint4B
   +0x51c SpareCounter0    : [1] Uint4B
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : Uint4B
   +0x7a4 ReverseStall     : Uint4B
   +0x7a8 IpiFrame         : Ptr32 Void
   +0x7ac PrcbPad2         : [52] UChar
   +0x7e0 CurrentPacket    : [3] Ptr32 Void
   +0x7ec TargetSet        : Uint4B
   +0x7f0 WorkerRoutine    : Ptr32    
   +0x7f4 IpiFrozen        : Uint4B
   +0x7f8 PrcbPad3         : [40] UChar
   +0x820 RequestSummary   : Uint4B
   +0x824 SignalDone       : Ptr32 _KPRCB
   +0x828 PrcbPad4         : [56] UChar
   +0x860 DpcListHead      : _LIST_ENTRY
   +0x868 DpcStack         : Ptr32 Void
   +0x86c DpcCount         : Uint4B
   +0x870 DpcQueueDepth    : Uint4B
   +0x874 DpcRoutineActive : Uint4B
   +0x878 DpcInterruptRequested : Uint4B
   +0x87c DpcLastCount     : Uint4B
   +0x880 DpcRequestRate   : Uint4B
   +0x884 MaximumDpcQueueDepth : Uint4B
   +0x888 MinimumDpcRate   : Uint4B
   +0x88c QuantumEnd       : Uint4B
   +0x890 PrcbPad5         : [16] UChar
   +0x8a0 DpcLock          : Uint4B
   +0x8a4 PrcbPad6         : [60] UChar
   +0x8e0 ChainedInterruptList : Ptr32 Void
   +0x8e4 LookasideIrpFloat : Int4B
   +0x8e8 SpareFields0     : [6] Uint4B
   +0x900 VendorString     : [13] UChar
   +0x90d InitialApicId    : UChar
   +0x90e LogicalProcessorsPerPhysicalProcessor : UChar
   +0x910 MHz              : Uint4B
   +0x914 FeatureBits      : Uint4B
   +0x918 UpdateSignature  : _LARGE_INTEGER
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE




EXAMEN DES VALEURS

Pour le moment, nous allons utiliser l'adresse du thread actuel
pour trouver l'objet noyau gérant les threads.

kd> dt _kprcb 0xffdff120
ntdll!_KPRCB
   +0x000 MinorVersion     : 1
   +0x002 MajorVersion     : 1
   +0x004 CurrentThread    : 0xffbde200 
   +0x008 NextThread       : (null) 
   +0x00c IdleThread       : 0x805443e0 
   +0x010 Number           : 0 ''
   +0x011 Reserved         : 0 ''
   +0x012 BuildType        : 2
   +0x014 SetMember        : 1
   +0x018 CpuType          : 15 ''
   +0x019 CpuID            : 1 ''
   +0x01a CpuStep          : 0x208
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] 0
   +0x37c HalReserved      : [16] 0
   +0x3bc PrcbPad0         : [92]  ""
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8]  ""
   +0x4a0 NpxThread        : 0xffbde200 
   +0x4a4 InterruptCount   : 0xf4b9
   +0x4a8 KernelTime       : 0x56d8
   +0x4ac UserTime         : 0x13b
   +0x4b0 DpcTime          : 0x87
   +0x4b4 DebugDpcTime     : 0
   +0x4b8 InterruptTime    : 0x35c
   +0x4bc AdjustDpcThreshold : 0x14
   +0x4c0 PageColor        : 0
   +0x4c4 SkipTick         : 0
   +0x4c8 MultiThreadSetBusy : 0 ''
   +0x4c9 Spare2           : [3]  ""
   +0x4cc ParentNode       : 0x80544a80 
   +0x4d0 MultiThreadProcessorSet : 1
   +0x4d4 MultiThreadSetMaster : (null) 
   +0x4d8 ThreadStartCount : [2] 0
   +0x4e0 CcFastReadNoWait : 0
   +0x4e4 CcFastReadWait   : 0
   +0x4e8 CcFastReadNotPossible : 0
   +0x4ec CcCopyReadNoWait : 0
   +0x4f0 CcCopyReadWait   : 0
   +0x4f4 CcCopyReadNoWaitMiss : 0
   +0x4f8 KeAlignmentFixupCount : 0
   +0x4fc KeContextSwitches : 0x29f15
   +0x500 KeDcacheFlushCount : 0
   +0x504 KeExceptionDispatchCount : 0x5ed
   +0x508 KeFirstLevelTbFills : 0
   +0x50c KeFloatingEmulationCount : 0
   +0x510 KeIcacheFlushCount : 0
   +0x514 KeSecondLevelTbFills : 0
   +0x518 KeSystemCalls    : 0x3cfc0e
   +0x51c SpareCounter0    : [1] 0
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : 0
   +0x7a4 ReverseStall     : 0
   +0x7a8 IpiFrame         : (null) 
   +0x7ac PrcbPad2         : [52]  ""
   +0x7e0 CurrentPacket    : [3] (null) 
   +0x7ec TargetSet        : 0
   +0x7f0 WorkerRoutine    : (null) 
   +0x7f4 IpiFrozen        : 0
   +0x7f8 PrcbPad3         : [40]  ""
   +0x820 RequestSummary   : 0
   +0x824 SignalDone       : (null) 
   +0x828 PrcbPad4         : [56]  ""
   +0x860 DpcListHead      : _LIST_ENTRY [ 0xffdff980 - 0xffdff980 ]
   +0x868 DpcStack         : 0xfc8db000 
   +0x86c DpcCount         : 0x9cd4
   +0x870 DpcQueueDepth    : 0
   +0x874 DpcRoutineActive : 0
   +0x878 DpcInterruptRequested : 0
   +0x87c DpcLastCount     : 0x9cd3
   +0x880 DpcRequestRate   : 0
   +0x884 MaximumDpcQueueDepth : 1
   +0x888 MinimumDpcRate   : 3
   +0x88c QuantumEnd       : 0
   +0x890 PrcbPad5         : [16]  ""
   +0x8a0 DpcLock          : 0
   +0x8a4 PrcbPad6         : [60]  ""
   +0x8e0 ChainedInterruptList : (null) 
   +0x8e4 LookasideIrpFloat : 1369
   +0x8e8 SpareFields0     : [6] 0
   +0x900 VendorString     : [13]  "GenuineIntel"
   +0x90d InitialApicId    : 0 ''
   +0x90e LogicalProcessorsPerPhysicalProcessor : 0x2 ''
   +0x910 MHz              : 0xbf8
   +0x914 FeatureBits      : 0x73fff
   +0x918 UpdateSignature  : _LARGE_INTEGER 0x0
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE





LES THREADS
Un thread est représenté dans le noyau par un objet divisé en
deux parties. Le Kernel Thread et l'Executive Thread se répartissent
les informations. Les deux structures se touchent comme le KPCR et
le KPRCB. En fait, on considère que l'objet ethread contient et
débute par le kthread. 



APERCU DES STRUCTURES

L'ethread contient les numéros d'identifications du thread et de son
processus, ainsi que les adresses de début dans le kernel et dans
l'userland.

Le kthread pointe sur le TEB de l'userland, contient une list_entry
reliant tous les threads d'un même processus, et permet de remonter
sur l'objet représentant son processus parent.

ntdll!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x1c0 CreateTime       : _LARGE_INTEGER
   +0x1c0 NestedFaultCount : Pos 0, 2 Bits
   +0x1c0 ApcNeeded        : Pos 2, 1 Bit
   +0x1c8 ExitTime         : _LARGE_INTEGER
   +0x1c8 LpcReplyChain    : _LIST_ENTRY
   +0x1c8 KeyedWaitChain   : _LIST_ENTRY
   +0x1d0 ExitStatus       : Int4B
   +0x1d0 OfsChain         : Ptr32 Void
   +0x1d4 PostBlockList    : _LIST_ENTRY
   +0x1dc TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x1dc ReaperLink       : Ptr32 _ETHREAD
   +0x1dc KeyedWaitValue   : Ptr32 Void
   +0x1e0 ActiveTimerListLock : Uint4B
   +0x1e4 ActiveTimerListHead : _LIST_ENTRY
   +0x1ec Cid              : _CLIENT_ID
   	+0x1ec UniqueProcess    : Ptr32 Void
   	+0x1f0 UniqueThread     : Ptr32 Void
   +0x1f4 LpcReplySemaphore : _KSEMAPHORE
   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
   +0x208 LpcReplyMessage  : Ptr32 Void
   +0x208 LpcWaitingOnPort : Ptr32 Void
   +0x20c ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
   +0x210 IrpList          : _LIST_ENTRY
   +0x218 TopLevelIrp      : Uint4B
   +0x21c DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x220 ThreadsProcess   : Ptr32 _EPROCESS
   +0x224 StartAddress     : Ptr32 Void
   +0x228 Win32StartAddress : Ptr32 Void
   +0x228 LpcReceivedMessageId : Uint4B
   +0x22c ThreadListEntry  : _LIST_ENTRY
   +0x234 RundownProtect   : _EX_RUNDOWN_REF
   +0x238 ThreadLock       : _EX_PUSH_LOCK
   +0x23c LpcReplyMessageId : Uint4B
   +0x240 ReadClusterSize  : Uint4B
   +0x244 GrantedAccess    : Uint4B
   +0x248 CrossThreadFlags : Uint4B
   +0x248 Terminated       : Pos 0, 1 Bit
   +0x248 DeadThread       : Pos 1, 1 Bit
   +0x248 HideFromDebugger : Pos 2, 1 Bit
   +0x248 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x248 SystemThread     : Pos 4, 1 Bit
   +0x248 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x248 BreakOnTermination : Pos 6, 1 Bit
   +0x248 SkipCreationMsg  : Pos 7, 1 Bit
   +0x248 SkipTerminationMsg : Pos 8, 1 Bit
   +0x24c SameThreadPassiveFlags : Uint4B
   +0x24c ActiveExWorker   : Pos 0, 1 Bit
   +0x24c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x24c MemoryMaker      : Pos 2, 1 Bit
   +0x250 SameThreadApcFlags : Uint4B
   +0x250 LpcReceivedMsgIdValid : Pos 0, 1 Bit
   +0x250 LpcExitThreadCalled : Pos 1, 1 Bit
   +0x250 AddressSpaceOwner : Pos 2, 1 Bit
   +0x254 ForwardClusterOnly : UChar
   +0x255 DisablePageFaultClustering : UChar



ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 MutantListHead   : _LIST_ENTRY
   +0x018 InitialStack     : Ptr32 Void
   +0x01c StackLimit       : Ptr32 Void
   +0x020 Teb              : Ptr32 Void
   +0x024 TlsArray         : Ptr32 Void
   +0x028 KernelStack      : Ptr32 Void
   +0x02c DebugActive      : UChar
   +0x02d State            : UChar
   +0x02e Alerted          : [2] UChar
   +0x030 Iopl             : UChar
   +0x031 NpxState         : UChar
   +0x032 Saturation       : Char
   +0x033 Priority         : Char
   +0x034 ApcState         : _KAPC_STATE
   	+0x034 ApcListHead      : [2] _LIST_ENTRY
   	+0x044 Process          : Ptr32 _KPROCESS
   	+0x048 KernelApcInProgress : UChar
   	+0x049 KernelApcPending : UChar
   	+0x04a UserApcPending   : UChar
   +0x04c ContextSwitches  : Uint4B
   +0x050 IdleSwapBlock    : UChar
   +0x051 Spare0           : [3] UChar
   +0x054 WaitStatus       : Int4B
   +0x058 WaitIrql         : UChar
   +0x059 WaitMode         : Char
   +0x05a WaitNext         : UChar
   +0x05b WaitReason       : UChar
   +0x05c WaitBlockList    : Ptr32 _KWAIT_BLOCK
   +0x060 WaitListEntry    : _LIST_ENTRY
   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x068 WaitTime         : Uint4B
   +0x06c BasePriority     : Char
   +0x06d DecrementCount   : UChar
   +0x06e PriorityDecrement : Char
   +0x06f Quantum          : Char
   +0x070 WaitBlock        : [4] _KWAIT_BLOCK
   +0x0d0 LegoData         : Ptr32 Void
   +0x0d4 KernelApcDisable : Uint4B
   +0x0d8 UserAffinity     : Uint4B
   +0x0dc SystemAffinityActive : UChar
   +0x0dd PowerState       : UChar
   +0x0de NpxIrql          : UChar
   +0x0df InitialNode      : UChar
   +0x0e0 ServiceTable     : Ptr32 Void
   +0x0e4 Queue            : Ptr32 _KQUEUE
   +0x0e8 ApcQueueLock     : Uint4B
   +0x0f0 Timer            : _KTIMER
   +0x118 QueueListEntry   : _LIST_ENTRY
   +0x120 SoftAffinity     : Uint4B
   +0x124 Affinity         : Uint4B
   +0x128 Preempted        : UChar
   +0x129 ProcessReadyQueue : UChar
   +0x12a KernelStackResident : UChar
   +0x12b NextProcessor    : UChar
   +0x12c CallbackStack    : Ptr32 Void
   +0x130 Win32Thread      : Ptr32 Void
   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME
   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
   +0x140 PreviousMode     : Char
   +0x141 EnableStackSwap  : UChar
   +0x142 LargeStack       : UChar
   +0x143 ResourceIndex    : UChar
   +0x144 KernelTime       : Uint4B
   +0x148 UserTime         : Uint4B
   +0x14c SavedApcState    : _KAPC_STATE
   +0x164 Alertable        : UChar
   +0x165 ApcStateIndex    : UChar
   +0x166 ApcQueueable     : UChar
   +0x167 AutoAlignment    : UChar
   +0x168 StackBase        : Ptr32 Void
   +0x16c SuspendApc       : _KAPC
   +0x19c SuspendSemaphore : _KSEMAPHORE
   +0x1b0 ThreadListEntry  : _LIST_ENTRY
   +0x1b8 FreezeCount      : Char
   +0x1b9 SuspendCount     : Char
   +0x1ba IdealProcessor   : UChar
   +0x1bb DisableBoost     : UChar



EXAMEN DES VALEURS
La valeur du thread id sera utilisée par notre programme d'exemple,
ainsi que le pointeur sur le processus parent contenu dans l'ApcState
du kthread.

kd> dt _ethread 0xffbde200
ntdll!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x1c0 CreateTime       : _LARGE_INTEGER 0xe2ad554`925e4760
   +0x1c0 NestedFaultCount : 0y00
   +0x1c0 ApcNeeded        : 0y0
   +0x1c8 ExitTime         : _LARGE_INTEGER 0xffbde3c8`ffbde3c8
   +0x1c8 LpcReplyChain    : _LIST_ENTRY [ 0xffbde3c8 - 0xffbde3c8 ]
   +0x1c8 KeyedWaitChain   : _LIST_ENTRY [ 0xffbde3c8 - 0xffbde3c8 ]
   +0x1d0 ExitStatus       : 0
   +0x1d0 OfsChain         : (null) 
   +0x1d4 PostBlockList    : _LIST_ENTRY [ 0xffbde3d4 - 0xffbde3d4 ]
   +0x1dc TerminationPort  : 0xe1522610 
   +0x1dc ReaperLink       : 0xe1522610 
   +0x1dc KeyedWaitValue   : 0xe1522610 
   +0x1e0 ActiveTimerListLock : 0
   +0x1e4 ActiveTimerListHead : _LIST_ENTRY [ 0xffbde3e4 - 0xffbde3e4 ]
   +0x1ec Cid              : _CLIENT_ID
 	+0x1ec UniqueProcess    : 0x00000538
   	+0x1f0 UniqueThread     : 0x000003e8
     +0x1f4 LpcReplySemaphore : _KSEMAPHORE
   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
   +0x208 LpcReplyMessage  : (null) 
   +0x208 LpcWaitingOnPort : (null) 
   +0x20c ImpersonationInfo : (null) 
   +0x210 IrpList          : _LIST_ENTRY [ 0xffb48288 - 0xffb48288 ]
   +0x218 TopLevelIrp      : 0
   +0x21c DeviceToVerify   : (null) 
   +0x220 ThreadsProcess   : 0x80d08da8 
   +0x224 StartAddress     : 0x77e5eb41 
   +0x228 Win32StartAddress : 0x00402440 
   +0x228 LpcReceivedMessageId : 0x402440
   +0x22c ThreadListEntry  : _LIST_ENTRY [ 0x80d08f38 - 0x80d08f38 ]
   +0x234 RundownProtect   : _EX_RUNDOWN_REF
   +0x238 ThreadLock       : _EX_PUSH_LOCK
   +0x23c LpcReplyMessageId : 0
   +0x240 ReadClusterSize  : 7
   +0x244 GrantedAccess    : 0x1f03ff
   +0x248 CrossThreadFlags : 0
   +0x248 Terminated       : 0y0
   +0x248 DeadThread       : 0y0
   +0x248 HideFromDebugger : 0y0
   +0x248 ActiveImpersonationInfo : 0y0
   +0x248 SystemThread     : 0y0
   +0x248 HardErrorsAreDisabled : 0y0
   +0x248 BreakOnTermination : 0y0
   +0x248 SkipCreationMsg  : 0y0
   +0x248 SkipTerminationMsg : 0y0
   +0x24c SameThreadPassiveFlags : 0
   +0x24c ActiveExWorker   : 0y0
   +0x24c ExWorkerCanWaitUser : 0y0
   +0x24c MemoryMaker      : 0y0
   +0x250 SameThreadApcFlags : 0
   +0x250 LpcReceivedMsgIdValid : 0y0
   +0x250 LpcExitThreadCalled : 0y0
   +0x250 AddressSpaceOwner : 0y0
   +0x254 ForwardClusterOnly : 0 ''
   +0x255 DisablePageFaultClustering : 0 ''

kd> dt _kthread 0xffbde200
ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 MutantListHead   : _LIST_ENTRY [ 0xffbde210 - 0xffbde210 ]
   +0x018 InitialStack     : 0xfa464000 
   +0x01c StackLimit       : 0xfa45f000 
   +0x020 Teb              : 0x7ffde000 
   +0x024 TlsArray         : (null) 
   +0x028 KernelStack      : 0xfa463c20 
   +0x02c DebugActive      : 0 ''
   +0x02d State            : 0x2 ''
   +0x02e Alerted          : [2]  ""
   +0x030 Iopl             : 0 ''
   +0x031 NpxState         : 0 ''
   +0x032 Saturation       : 0 ''
   +0x033 Priority         : 12 ''
   +0x034 ApcState         : _KAPC_STATE
   	+0x034 ApcListHead      : [2] _LIST_ENTRY [ 0xffbde234 - 0xffbde234 ]
   	+0x044 Process          : 0x80d08da8 
   	+0x048 KernelApcInProgress : 0 ''
   	+0x049 KernelApcPending : 0 ''
   	+0x04a UserApcPending   : 0 ''
   +0x04c ContextSwitches  : 0x25e
   +0x050 IdleSwapBlock    : 0 ''
   +0x051 Spare0           : [3]  ""
   +0x054 WaitStatus       : 0
   +0x058 WaitIrql         : 0 ''
   +0x059 WaitMode         : 1 ''
   +0x05a WaitNext         : 0 ''
   +0x05b WaitReason       : 0xd ''
   +0x05c WaitBlockList    : 0xffbde270 
   +0x060 WaitListEntry    : _LIST_ENTRY [ 0x805454e0 - 0x805454e0 ]
   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x068 WaitTime         : 0x5813
   +0x06c BasePriority     : 8 ''
   +0x06d DecrementCount   : 0x10 ''
   +0x06e PriorityDecrement : 2 ''
   +0x06f Quantum          : 1 ''
   +0x070 WaitBlock        : [4] _KWAIT_BLOCK
   +0x0d0 LegoData         : (null) 
   +0x0d4 KernelApcDisable : 0
   +0x0d8 UserAffinity     : 1
   +0x0dc SystemAffinityActive : 0 ''
   +0x0dd PowerState       : 0 ''
   +0x0de NpxIrql          : 0 ''
   +0x0df InitialNode      : 0 ''
   +0x0e0 ServiceTable     : 0x80544bc0 
   +0x0e4 Queue            : (null) 
   +0x0e8 ApcQueueLock     : 0
   +0x0f0 Timer            : _KTIMER
   +0x118 QueueListEntry   : _LIST_ENTRY [ 0x0 - 0x0 ]
   +0x120 SoftAffinity     : 1
   +0x124 Affinity         : 1
   +0x128 Preempted        : 0 ''
   +0x129 ProcessReadyQueue : 0 ''
   +0x12a KernelStackResident : 0x1 ''
   +0x12b NextProcessor    : 0 ''
   +0x12c CallbackStack    : (null) 
   +0x130 Win32Thread      : 0xe1a61e58 
   +0x134 TrapFrame        : 0xfa463d64 
   +0x138 ApcStatePointer  : [2] 0xffbde234 
   +0x140 PreviousMode     : 1 ''
   +0x141 EnableStackSwap  : 0x1 ''
   +0x142 LargeStack       : 0x1 ''
   +0x143 ResourceIndex    : 0 ''
   +0x144 KernelTime       : 0xa
   +0x148 UserTime         : 0
   +0x14c SavedApcState    : _KAPC_STATE
   +0x164 Alertable        : 0 ''
   +0x165 ApcStateIndex    : 0 ''
   +0x166 ApcQueueable     : 0x1 ''
   +0x167 AutoAlignment    : 0 ''
   +0x168 StackBase        : 0xfa464000 
   +0x16c SuspendApc       : _KAPC
   +0x19c SuspendSemaphore : _KSEMAPHORE
   +0x1b0 ThreadListEntry  : _LIST_ENTRY [ 0x80d08df8 - 0x80d08df8 ]
   +0x1b8 FreezeCount      : 0 ''
   +0x1b9 SuspendCount     : 0 ''
   +0x1ba IdealProcessor   : 0 ''
   +0x1bb DisableBoost     : 0 ''




LES PROCESSUS

Comme l'objet noyau du thread, le processus est divisé en parties
executive et kernel. On y trouve des valeurs qui vont confirmer
ce qu'on sait déjà : le pid doit correspondre au pid trouvé dans
le thread, sinon il y a une couille quelque part.



APERCU DES STRUCTURES

L'eprocess contient u e list_entry reliant les processus actifs
entre eux. On y trouve le pid ainsi que celui du processus père,
et un pointeur vers la table des handles. On a un pointeur vers
le teb userland, le nom du fichier exécutable, le nombre de
threads du processus. Et enfin des numeros de versions du sous-systeme
windows. Le kprocess contient surtout une list_entry permettant
de faire le tour des threads d'un processus, ainsi que la priorité
d'exécution du processus.

ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x06c ProcessLock      : _EX_PUSH_LOCK
   +0x070 CreateTime       : _LARGE_INTEGER
   +0x078 ExitTime         : _LARGE_INTEGER
   +0x080 RundownProtect   : _EX_RUNDOWN_REF
   +0x084 UniqueProcessId  : Ptr32 Void
   +0x088 ActiveProcessLinks : _LIST_ENTRY
   +0x090 QuotaUsage       : [3] Uint4B
   +0x09c QuotaPeak        : [3] Uint4B
   +0x0a8 CommitCharge     : Uint4B
   +0x0ac PeakVirtualSize  : Uint4B
   +0x0b0 VirtualSize      : Uint4B
   +0x0b4 SessionProcessLinks : _LIST_ENTRY
   +0x0bc DebugPort        : Ptr32 Void
   +0x0c0 ExceptionPort    : Ptr32 Void
   +0x0c4 ObjectTable      : Ptr32 _HANDLE_TABLE
   +0x0c8 Token            : _EX_FAST_REF
   +0x0cc WorkingSetLock   : _FAST_MUTEX
   +0x0ec WorkingSetPage   : Uint4B
   +0x0f0 AddressCreationLock : _FAST_MUTEX
   +0x110 HyperSpaceLock   : Uint4B
   +0x114 ForkInProgress   : Ptr32 _ETHREAD
   +0x118 HardwareTrigger  : Uint4B
   +0x11c VadRoot          : Ptr32 Void
   +0x120 VadHint          : Ptr32 Void
   +0x124 CloneRoot        : Ptr32 Void
   +0x128 NumberOfPrivatePages : Uint4B
   +0x12c NumberOfLockedPages : Uint4B
   +0x130 Win32Process     : Ptr32 Void
   +0x134 Job              : Ptr32 _EJOB
   +0x138 SectionObject    : Ptr32 Void
   +0x13c SectionBaseAddress : Ptr32 Void
   +0x140 QuotaBlock       : Ptr32 _EPROCESS_QUOTA_BLOCK
   +0x144 WorkingSetWatch  : Ptr32 _PAGEFAULT_HISTORY
   +0x148 Win32WindowStation : Ptr32 Void
   +0x14c InheritedFromUniqueProcessId : Ptr32 Void
   +0x150 LdtInformation   : Ptr32 Void
   +0x154 VadFreeHint      : Ptr32 Void
   +0x158 VdmObjects       : Ptr32 Void
   +0x15c DeviceMap        : Ptr32 Void
   +0x160 PhysicalVadList  : _LIST_ENTRY
   +0x168 PageDirectoryPte : _HARDWARE_PTE_X86
   +0x168 Filler           : Uint8B
   +0x170 Session          : Ptr32 Void
   +0x174 ImageFileName    : [16] UChar
   +0x184 JobLinks         : _LIST_ENTRY
   +0x18c LockedPagesList  : Ptr32 Void
   +0x190 ThreadListHead   : _LIST_ENTRY
   +0x198 SecurityPort     : Ptr32 Void
   +0x19c PaeTop           : Ptr32 Void
   +0x1a0 ActiveThreads    : Uint4B
   +0x1a4 GrantedAccess    : Uint4B
   +0x1a8 DefaultHardErrorProcessing : Uint4B
   +0x1ac LastThreadExitStatus : Int4B
   +0x1b0 Peb              : Ptr32 _PEB
   +0x1b4 PrefetchTrace    : _EX_FAST_REF
   +0x1b8 ReadOperationCount : _LARGE_INTEGER
   +0x1c0 WriteOperationCount : _LARGE_INTEGER
   +0x1c8 OtherOperationCount : _LARGE_INTEGER
   +0x1d0 ReadTransferCount : _LARGE_INTEGER
   +0x1d8 WriteTransferCount : _LARGE_INTEGER
   +0x1e0 OtherTransferCount : _LARGE_INTEGER
   +0x1e8 CommitChargeLimit : Uint4B
   +0x1ec CommitChargePeak : Uint4B
   +0x1f0 AweInfo          : Ptr32 Void
   +0x1f4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1f8 Vm               : _MMSUPPORT
   +0x238 LastFaultCount   : Uint4B
   +0x23c ModifiedPageCount : Uint4B
   +0x240 NumberOfVads     : Uint4B
   +0x244 JobStatus        : Uint4B
   +0x248 Flags            : Uint4B
   +0x248 CreateReported   : Pos 0, 1 Bit
   +0x248 NoDebugInherit   : Pos 1, 1 Bit
   +0x248 ProcessExiting   : Pos 2, 1 Bit
   +0x248 ProcessDelete    : Pos 3, 1 Bit
   +0x248 Wow64SplitPages  : Pos 4, 1 Bit
   +0x248 VmDeleted        : Pos 5, 1 Bit
   +0x248 OutswapEnabled   : Pos 6, 1 Bit
   +0x248 Outswapped       : Pos 7, 1 Bit
   +0x248 ForkFailed       : Pos 8, 1 Bit
   +0x248 HasPhysicalVad   : Pos 9, 1 Bit
   +0x248 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x248 SetTimerResolution : Pos 12, 1 Bit
   +0x248 BreakOnTermination : Pos 13, 1 Bit
   +0x248 SessionCreationUnderway : Pos 14, 1 Bit
   +0x248 WriteWatch       : Pos 15, 1 Bit
   +0x248 ProcessInSession : Pos 16, 1 Bit
   +0x248 OverrideAddressSpace : Pos 17, 1 Bit
   +0x248 HasAddressSpace  : Pos 18, 1 Bit
   +0x248 LaunchPrefetched : Pos 19, 1 Bit
   +0x248 InjectInpageErrors : Pos 20, 1 Bit
   +0x248 Unused           : Pos 21, 11 Bits
   +0x24c ExitStatus       : Int4B
   +0x250 NextPageColor    : Uint2B
   +0x252 SubSystemMinorVersion : UChar
   +0x253 SubSystemMajorVersion : UChar
   +0x252 SubSystemVersion : Uint2B
   +0x254 PriorityClass    : UChar
   +0x255 WorkingSetAcquiredUnsafe : UChar


ntdll!_KPROCESS
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 ProfileListHead  : _LIST_ENTRY
   +0x018 DirectoryTableBase : [2] Uint4B
   +0x020 LdtDescriptor    : _KGDTENTRY
   +0x028 Int21Descriptor  : _KIDTENTRY
   +0x030 IopmOffset       : Uint2B
   +0x032 Iopl             : UChar
   +0x033 Unused           : UChar
   +0x034 ActiveProcessors : Uint4B
   +0x038 KernelTime       : Uint4B
   +0x03c UserTime         : Uint4B
   +0x040 ReadyListHead    : _LIST_ENTRY
   +0x048 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x04c VdmTrapcHandler  : Ptr32 Void
   +0x050 ThreadListHead   : _LIST_ENTRY
   +0x058 ProcessLock      : Uint4B
   +0x05c Affinity         : Uint4B
   +0x060 StackCount       : Uint2B
   +0x062 BasePriority     : Char
   +0x063 ThreadQuantum    : Char
   +0x064 AutoAlignment    : UChar
   +0x065 State            : UChar
   +0x066 ThreadSeed       : UChar
   +0x067 DisableBoost     : UChar
   +0x068 PowerState       : UChar
   +0x069 DisableQuantum   : UChar
   +0x06a IdealNode        : UChar
   +0x06b Spare            : UChar







EXAMEN DES VALEURS

Pour notre programme d'exemple, nous récupèrerons le pid dans
l'eprocess, puis passerons de processus en processus au moyen de
la list_entry, et pour chacun descendrons dans les threads.

kd> dt _eprocess 0x80d08da8
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x06c ProcessLock      : _EX_PUSH_LOCK
   +0x070 CreateTime       : _LARGE_INTEGER 0x1c55aaa`924bc8ec
   +0x078 ExitTime         : _LARGE_INTEGER 0x0
   +0x080 RundownProtect   : _EX_RUNDOWN_REF
   +0x084 UniqueProcessId  : 0x00000538 
   +0x088 ActiveProcessLinks : _LIST_ENTRY [ 0x80547b58 - 0xffbc2e30 ]
   +0x090 QuotaUsage       : [3] 0x690
   +0x09c QuotaPeak        : [3] 0x7d8
   +0x0a8 CommitCharge     : 0x92
   +0x0ac PeakVirtualSize  : 0xff1000
   +0x0b0 VirtualSize      : 0xff1000
   +0x0b4 SessionProcessLinks : _LIST_ENTRY [ 0xfc9f3014 - 0xffbc2e5c ]
   +0x0bc DebugPort        : (null) 
   +0x0c0 ExceptionPort    : 0xe15773d0 
   +0x0c4 ObjectTable      : 0xe19329b0     //Table des handles
   +0x0c8 Token            : _EX_FAST_REF
   +0x0cc WorkingSetLock   : _FAST_MUTEX
   +0x0ec WorkingSetPage   : 0x44f1
   +0x0f0 AddressCreationLock : _FAST_MUTEX
   +0x110 HyperSpaceLock   : 0
   +0x114 ForkInProgress   : (null) 
   +0x118 HardwareTrigger  : 0
   +0x11c VadRoot          : 0x80da7640 
   +0x120 VadHint          : 0x80da8bc0 
   +0x124 CloneRoot        : (null) 
   +0x128 NumberOfPrivatePages : 0x59
   +0x12c NumberOfLockedPages : 1
   +0x130 Win32Process     : 0xe15b79d8 
   +0x134 Job              : (null) 
   +0x138 SectionObject    : 0xe10ca540 
   +0x13c SectionBaseAddress : 0x00400000 
   +0x140 QuotaBlock       : 0x80cec468 
   +0x144 WorkingSetWatch  : (null) 
   +0x148 Win32WindowStation : 0x0000002c 
   +0x14c InheritedFromUniqueProcessId : 0x000007dc 
   +0x150 LdtInformation   : (null) 
   +0x154 VadFreeHint      : (null) 
   +0x158 VdmObjects       : (null) 
   +0x15c DeviceMap        : 0xe18ae440 
   +0x160 PhysicalVadList  : _LIST_ENTRY [ 0x80d08f08 - 0x80d08f08 ]
   +0x168 PageDirectoryPte : _HARDWARE_PTE_X86
   +0x168 Filler           : 0
   +0x170 Session          : 0xfc9f3000 
   +0x174 ImageFileName    : [16]  "appli.exe"
   +0x184 JobLinks         : _LIST_ENTRY [ 0x0 - 0x0 ]
   +0x18c LockedPagesList  : (null) 
   +0x190 ThreadListHead   : _LIST_ENTRY [ 0xffbde42c - 0xffbde42c ]
   +0x198 SecurityPort     : (null) 
   +0x19c PaeTop           : (null) 
   +0x1a0 ActiveThreads    : 1
   +0x1a4 GrantedAccess    : 0x1f0fff
   +0x1a8 DefaultHardErrorProcessing : 0x8000
   +0x1ac LastThreadExitStatus : 0
   +0x1b0 Peb              : 0x7ffdf000 
   +0x1b4 PrefetchTrace    : _EX_FAST_REF
   +0x1b8 ReadOperationCount : _LARGE_INTEGER 0x2
   +0x1c0 WriteOperationCount : _LARGE_INTEGER 0x2
   +0x1c8 OtherOperationCount : _LARGE_INTEGER 0x98
   +0x1d0 ReadTransferCount : _LARGE_INTEGER 0x20ae
   +0x1d8 WriteTransferCount : _LARGE_INTEGER 0x48
   +0x1e0 OtherTransferCount : _LARGE_INTEGER 0x1175e
   +0x1e8 CommitChargeLimit : 0
   +0x1ec CommitChargePeak : 0x92
   +0x1f0 AweInfo          : (null) 
   +0x1f4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1f8 Vm               : _MMSUPPORT
   +0x238 LastFaultCount   : 0
   +0x23c ModifiedPageCount : 0
   +0x240 NumberOfVads     : 0x2a
   +0x244 JobStatus        : 0
   +0x248 Flags            : 0xd0800
   +0x248 CreateReported   : 0y0
   +0x248 NoDebugInherit   : 0y0
   +0x248 ProcessExiting   : 0y0
   +0x248 ProcessDelete    : 0y0
   +0x248 Wow64SplitPages  : 0y0
   +0x248 VmDeleted        : 0y0
   +0x248 OutswapEnabled   : 0y0
   +0x248 Outswapped       : 0y0
   +0x248 ForkFailed       : 0y0
   +0x248 HasPhysicalVad   : 0y0
   +0x248 AddressSpaceInitialized : 0y10
   +0x248 SetTimerResolution : 0y0
   +0x248 BreakOnTermination : 0y0
   +0x248 SessionCreationUnderway : 0y0
   +0x248 WriteWatch       : 0y0
   +0x248 ProcessInSession : 0y1
   +0x248 OverrideAddressSpace : 0y0
   +0x248 HasAddressSpace  : 0y1
   +0x248 LaunchPrefetched : 0y1
   +0x248 InjectInpageErrors : 0y0
   +0x248 Unused           : 0y00000000000 (0)
   +0x24c ExitStatus       : 259
   +0x250 NextPageColor    : 0xb463
   +0x252 SubSystemMinorVersion : 0 ''
   +0x253 SubSystemMajorVersion : 0x4 ''
   +0x252 SubSystemVersion : 0x400
   +0x254 PriorityClass    : 0x2 ''
   +0x255 WorkingSetAcquiredUnsafe : 0 ''

kd> dt _kprocess 0x80d08da8
ntdll!_KPROCESS
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 ProfileListHead  : _LIST_ENTRY [ 0x80d08db8 - 0x80d08db8 ]
   +0x018 DirectoryTableBase : [2] 0x17de000
   +0x020 LdtDescriptor    : _KGDTENTRY
   +0x028 Int21Descriptor  : _KIDTENTRY
   +0x030 IopmOffset       : 0x20ac
   +0x032 Iopl             : 0 ''
   +0x033 Unused           : 0 ''
   +0x034 ActiveProcessors : 0
   +0x038 KernelTime       : 9
   +0x03c UserTime         : 1
   +0x040 ReadyListHead    : _LIST_ENTRY [ 0x80d08de8 - 0x80d08de8 ]
   +0x048 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x04c VdmTrapcHandler  : (null) 
   +0x050 ThreadListHead   : _LIST_ENTRY [ 0xffbde3b0 - 0xffbde3b0 ]
   +0x058 ProcessLock      : 0
   +0x05c Affinity         : 1
   +0x060 StackCount       : 1
   +0x062 BasePriority     : 8 ''
   +0x063 ThreadQuantum    : 18 ''
   +0x064 AutoAlignment    : 0 ''
   +0x065 State            : 0 ''
   +0x066 ThreadSeed       : 0 ''
   +0x067 DisableBoost     : 0 ''
   +0x068 PowerState       : 0 ''
   +0x069 DisableQuantum   : 0 ''
   +0x06a IdealNode        : 0 ''
   +0x06b Spare            : 0 ''




DE PROC' EN PROC'

Après avoir regardé l'enchainement des structures depuis le PCR
jusqu'aux processus, nous sommes capables de nous ballader dans tout
ca. Juste un petit rappel sur les list_entry. Le champ flink de
eprocess -> ActiveprocessLinks ne pointe pas sur le eprocess suivant,
mais sur l'ActiveProcessLinks de l'eprocess suivant. Il faut ajuster
