<html>
<head>
	<title>AlTeRnAtIvE I --> Carding par Kallipse</title>
</head>
<body bgcolor="Black" text="Lime">

<font face="Artistik" size="+3"><div align="center">Mouvement  Galaad</div>
<div align="center">! AlTeRnAtIvE !</div>
<div align="center">__________________________</div>
<div align="center"><--------Le CaRdInG--------></div>
<div align="center"><-------par KaLLiPsE-------></div>
<div align="center">$$$chirichan@usa.net$$$$</div>
<div align="center">$$$$17/11/98$$$$$</div></font><br>
<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div><br>
&nbsp;&nbsp;Je pense qu'au moins une fois, tout le monde a eu envie d'avoir acc&egrave;s
&agrave; un site payant (xxx, mp3, jeux, ...), et peut-&ecirc;tre m&ecirc;me d'acheter un 
CD, un modem par le net, sans l&acirc;cher le moindre sous.<br><br>
&nbsp;&nbsp;Pour &ccedil;a, il y a plusieurs solutions, et en voici une:<br><br>
<b><i><u>I)On va commencer par la premi&egrave;re &eacute;tape qui consiste &agrave; obtenir un N°
de carte de cr&eacute;dit valide sous cette forme:</u></i></b><br><br>
&nbsp;&nbsp;4XXX - XXXX - XXXX - XXXX = VisaCard<br>
&nbsp;&nbsp;5XXX - XXXX - XXXX - XXXX = MasterCard<br>
&nbsp;&nbsp;6XXX - XXXX - XXXX - XXXX = DiscoveryCard<br><br>
et la date de validit&eacute;&nbsp;:
<pre>                         XX/XX
                         |   |
                        mois |
                           ann&eacute;e</pre><br>
						   
ce sont les &eacute;l&eacute;ments les plus importants pour les paiements par internet<br><br>
&nbsp;&nbsp;<b><i><u>1&egrave;re solution)</u></i></b> &Agrave; partir de votre propre carte de cr&eacute;dit ou de celle d'un
pote vous devez obtenir une s&eacute;rie de N° valides. Pour cel&agrave;, il faut vous 
munir de logiciels tels que "<i>Credit Wizard v1.1</i>", "<i>BeaZly Card Generator
1.0</i>", ou "<i>ChaSeR's Credit Card Generator</i>", personnellement je pr&eacute;f&egrave;re 
le 1er, le but de l'op&eacute;ration est d'extrapoler votre N° de carte pour
en obtenir d'autres, et vous ne gardez que les N° dont la s&eacute;rie "d"
est inf&eacute;rieure a votre s&eacute;rie "d", ces N° &eacute;tant inf&eacute;rieures &agrave; votre 
carte, la date de validit&eacute; est donc inf&eacute;rieure ou &eacute;gale &agrave; la votre.<br><br>
<font face="" size="-2"><i>fig.2 (les N° sont juste &agrave; titre d'exemple)</i></font><br><br>
<pre>
  "a"    "b"    "c"    "d"
   |      |      |      |
1) XXXX - XXXX - XXXX - 4587 votre N° de carte de cr&eacute;dit

2) XXXX - XXXX - XXXX - 7892 N° au dessus du votre N° donc &agrave; rejeter

3) XXXX - XXXX - XXXX - 2145 N° en dessous du votre, donc &agrave;

4) XXXX - XXXX - XXXX - 1927N° en dessous du votre, donc &agrave; conserver!

5) XXXX - XXXX - XXXX - 9874 N° au dessus du votre N° donc &agrave; rejeter

6) XXXX - XXXX - XXXX - 4146N° en dessous du votre, donc &agrave; conserver!

7) XXXX - XXXX - XXXX - 4599 N° au dessus du votre N° donc &agrave; rejeter

8) XXXX - XXXX - XXXX - 5478 N° au dessus du votre N° donc &agrave; rejeter

9) XXXX - XXXX - XXXX - 9988 N° au dessus du votre N° donc &agrave; rejeter</pre>

&nbsp;&nbsp;Maintenant qu'on a des N° int&eacute;ressants on ne s&eacute;lectionne que le N° le 
plus proche qui est "6)", la date limite de votre carte est 
04/99, pour trouver la date de la carte "6", on va dans un site XXX
&agrave; acc&egrave;s gratuit o&ugrave; ils verifient si vous &ecirc;tes adulte par 
v&eacute;rification de votre carte de cr&eacute;dit (donc pas de paiement) !
on prend les chiffres de la carte "6" et pour la date  de validit&eacute; on 
prend d'abord votre date &agrave; vous 04/99, puis 03/99, puis 02/99, 01/99,
12/98, ... jusqu'&agrave; ce que la carte soit accept&eacute;e, quand c'est fait, 
presque tout est possible&nbsp;!<br><br>
&nbsp;&nbsp;<b><i><u>II)</u></i></b> Maintenant il y a deux choix, sois vous "achetez" des services en
ligne et dans ce cas il faut juste &ecirc;tre prudent de ne pas laisser de 
donn&eacute;es qui permettraient de remonter jusqu'&agrave; vous, pour ce qui est 
d'acheter par internet des produits que l'on re&ccedil;oit par la poste tels 
que telephone portable (h&eacute;, h&eacute;, c'est l'application qui a servi de 
test), il y a certaines choses a pr&eacute;voir que l'on va aborder &eacute;lement 
par &eacute;lement.<br><br> 
&nbsp;&nbsp;&nbsp;&nbsp;<b><i><u>1) La bo&icirc;te postale</u></i></b><br>
Pour recevoir quelque chose que l'on a command&eacute; par le Net, et sans 
se trahir en laissant ses coordonn&eacute;es postales l'id&eacute;al est la bo&icirc;te
postale, pour cel&agrave; il faut un R.I.B. (pour les neuneu c'est un relev&eacute;
d'indentit&eacute; banquaire), et 500frs pour louer la bo&icirc;te.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b><i><u>a) Le RIB</u></i></b><br>
Pour faire un bon RIB, y a pas besoin de grand chose: un logiciel tel
que "HackViewBank" pour g&eacute;nerer ce fameux RIB, un &eacute;diteur de 
textes pour recopier les donn&eacute;es que nous donne le logiciel pr&eacute;c&eacute;dant
ajoutez-y des coordonn&eacute;es trouv&eacute;es dans le botin et c'est bon vous 
n'avez plus qu'&agrave; imprimer sur papier (un conseil&nbsp;: si vous avez la 
possibilit&eacute; de vous procurer par un autre moyen un RIB c'est mieux
parce que l&agrave; au moins &ccedil;a correspondra &agrave; quelqu'un r&eacute;ellement, ceci est 
plus qu'un conseil).<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b><i><u>b)Les 500 balles</u></i></b><br>
Pour les 500 balles ben vous vous debrouillez, je suis fauch&eacute;, je 
vous donnerais un conseil qui les vaut bien, vous avez int&eacute;r&ecirc;t 
&agrave; ce que l'objet que vous commandez co&ucirc;te plus de 500frs, sinon dans
l'affaire vous &ecirc;tes perdant!<br><br>
&nbsp;&nbsp;&nbsp;&nbsp;<b><i><u>2)</u></i></b>Pour ce qui est de la commande par internet, il faut la faire dans 
un CyberCaf&eacute; autrement c'est le meilleur moyen de se faire pincer.
Sur certains sites, quand vous d&eacute;passez un montant &eacute;lev&eacute;, on vous
demande de faxer une pi&egrave;ce d'ID, dans ce cas on zappe ces sites, il y en
a d'autres qui ne sont pas du tout regardants a la d&eacute;pense ;-)<br><br>
&nbsp;&nbsp;&nbsp;&nbsp;<b><i><u>3)La ReceptioN du colis&nbsp;!</u></i></b><br>
C'est Noël! le paquet vient d'arriver, faut aller le chercher mais 
attention, faut v&eacute;rifier qu'il n'y a que la (le) receptioniste
et l&agrave; vous envoyez quelqu'un d'autre que vous (car la r&eacute;ceptioniste ne 
reconna&icirc;tra pas la personne, comme &ccedil;a si les 22 guettent pour chopper
en flag la personne qui ouvre la bo&icirc;te, la personne peut trouver un 
baratin pour s'en sortir, mais &ccedil;a c'est si les flics sont l&agrave;).<br><br>
&nbsp;&nbsp;H&eacute; voil&agrave; c'est long mais il faut, car ce n'est pas sans risques et si on veut
s'acheter un startac pour 500 balles c'est un bon moyen!<br><br>
&nbsp;&nbsp;Je pr&eacute;cise que le contenu de cet article est &agrave; but informatif 
uniquement et je d&eacute;cline toutes responsabilit&eacute;s quand &agrave; un mauvais 
usage de ce document. [8;-)<br><br>
<font face="" size="-1"><b>Hack, Crack, Phreak : Good for Health, bad for education.<br>
KaLLiPsE<br>
Mouvement Galaad (<a href="http://galaad.deserens.org">http://galaad.deserens.org</a>).</b></font><br><br>
<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div>
</body>
</html>
