
<html>
<head>
<title>ccc</title>
</head>
<body bgcolor="#224016" text="#FFFFFF" link="#CCCCCC" vlink="#CCCCCC" alink="#FF0066" >
<center>
<br>
<table width="600" border="0"><td>
<p align="left"><a href="trash.htm"><img src="previous.gif" border="0"></a></p></td>
<td><p align="right"><a href="catas.html"><img src="next.gif" border="0"></a></p></td></table>

<br>
<table width="600"><td>
<font color="#637F59" face=verdana, arial>
<h2>CONTRE-ESPIONNAGE ELECTRONIQUE</h2>
</font><BR>
<font face=verdana, arial size=2>
<P>Auteur : Robert Cervant  brain@ausi.com</P>

<P>&nbsp;</P>
<P> Manuel pratique de Contre-Espionnage Electronique pour AMATEUR :</P>

<P>Le principe de ce petit manuel pratique en mati&egrave;re de contre-ing&eacute;rence &eacute;lectronique, &agrave; pour unique but d'apport&eacute; les bases n&eacute;cessaires pour d&eacute;jou&eacute; les principaux syst&egrave;mes d'&eacute;coutes clandestines pouvant &ecirc;tre mit en pratique par des espions industriels, d&eacute;tectives priv&eacute;es, membres de services de s&eacute;curit&eacute; priv&eacute;es, sectes, organisations criminels divers, dealers de drogues, pirates et hackers et en g&eacute;n&eacute;ral tous individus ayant les connaissances minimum de l'usage de mat&eacute;riels sp&eacute;ciaux.</P>

<P>Ce manuel pourra donc apport&eacute; &agrave; toute personne souhaitant prot&eacute;ger sa vie priv&eacute;e et professionnel, les nombreuses m&eacute;thodes employ&eacute; dans l'univers du renseignement &eacute;lectronique.</P>

<P>=O=</P>

<P>100.000 gadgets &eacute;lectronique d'espionnage, c'est le nombre incroyable de ces mat&eacute;riaux "sp&eacute;ciaux" vendu durant la seul ann&eacute;e 1996 par une soci&eacute;t&eacute; fran&ccedil;aise!</P>

<P>Autant dire pour vous et moi que l'ont soit un simple citoyen lambda ou une personne ayant une activit&eacute; professionnel sensible, pouvont &ecirc;tre victime d'une &eacute;coute clandestine.</P>

<P>Il n'est pas rare de voir dans la presse, des affaires faisant objet de l'utilisation de micros-espions, &eacute;coutes t&eacute;l&eacute;phoniques etc ..</P>

<P>Mais pour pouvoir lutter contre cela, faut il encore avoir une parfaite connaissance des moyens pouvant &ecirc;tre mit en oeuvre !</P>

<P>=O=</P>

<P>MICRO-RADIO MINIATURE VHF et UHF :</P>

<P>&nbsp;</P>
<P>Bug d'ambiance et t&eacute;l&eacute;phonique / &eacute;coute de locaux - &eacute;coute t&eacute;l&eacute;phonique :</P>

<P>&nbsp;</P>
<P>Le Micro-&eacute;metteur sans Quartz FM nomm&eacute; BUG dans le jargon des professionnels, et surment le plus utilis&eacute; en mati&egrave;re de syst&egrave;me d'&eacute;coute &eacute;lectronique.</P>

<P>Il s’agit en g&eacute;n&eacute;ral d'un petit cube de couleur noir de quelques centim&egrave;tres, dont le contenue est un &eacute;metteur radio de tr&egrave;s faible puissance (quelques mini Watt 70 &agrave; 100mW) dot&eacute; d'une antenne de 50cm au maximum et fonctionnant dans les bandes de fr&eacute;quences suivant :</P>

<P>88-108 Mhz, 115-130 Mhz, 140-160 Mhz, 395-410 Mhz (en France)</P>

<P>En g&eacute;n&eacute;ral ce type de micro-&eacute;metteur n'est que tr&egrave;s rarement utilis&eacute; par des professionnels des &eacute;coutes clandestines, ce type de mat&eacute;riel &eacute;tant plus usit&eacute; par de simple particulier (mari jaloux, amateur de gadgets "sp&eacute;ciaux", bidouilleurs..).</P>

<P>Une m&eacute;thode simple pour les d&eacute;tect&eacute;s, consiste &agrave; utilis&eacute; un banal poste de radio FM pour ceux de la gamme 88-108 Mhz.</P>

<P>Pour les autres, un vulgaire r&eacute;cepteur multi-bande appel&eacute; aussi "scanner" suffira largement &agrave; leurs d&eacute;tection ou bien sinon un "fr&eacute;quencem&egrave;tre" (bien connu des radioamateurs). Enfin ces types de micros-&eacute;metteurs n'&eacute;tant que tr&egrave;s rarement stable en fr&eacute;quence, sont peut fiable en mati&egrave;re d'&eacute;coute s&eacute;rieuse et donc facilement rep&eacute;rable.</P>

<P>Inutile donc d'aller achet&eacute; en Belgique ou en Angleterre, un appareil de d&eacute;tection pouvant vous &ecirc;tres vendu plusieurs centaines de francs ! ( 1000 Fr. en moyenne).</P>

<P>&nbsp;</P>
<P>Passons d&eacute;sorm&eacute; &agrave; des types de Micros-&eacute;metteurs un peut plus s&eacute;rieux .. &agrave; Quartz !</P>

<P>Il s’agit l&agrave;, de mat&eacute;riels que l'ont classe dans la cat&eacute;gorie "Semi-professionnel" :</P>

<P>Ce type de micro-&eacute;metteur bien que pratiquement identique aux autres ci-dessus, ont la particularit&eacute; d'&ecirc;tre beaucoup plus stable en fr&eacute;quence gr&acirc;ce &agrave; un quartz.</P>

<P>Celui-ci &eacute;vitant que la fr&eacute;quence de l'&eacute;metteur ne soit pas stable, ce qui est extr&ecirc;mement important pour avoir une bonne r&eacute;ception du signal.</P>

<P>La r&eacute;ception de ce type de micros-&eacute;metteurs se fait avec un scanner ou bien sinon par le biais d'un petit r&eacute;cepteur miniature comportant 2 ou 3 canaux (fr&eacute;quences).</P>

<P>Certains mod&egrave;les utilisent la bande VHF haute dans les bandes 150-180 Mhz, mais pour une meilleur r&eacute;ception ainsi que pour plus de discr&eacute;tion, ont les trouvent bien souvent dans la gamme UHF :</P>

<P>395-410 Mhz, 430-450 Mhz, 480-500 Mhz et plus haut dans les 900 Mhz.</P>

<P>Tout comme les micros-&eacute;metteurs Amateurs, ils peuvent avoir l'apparence d'un cube, d'un stylo, d'une calculatrice, d'une crotte de chien ( Si si !!), d'un r&eacute;veil, d'une borne de sortie de secours (pour la surveillance de locaux industriels), d'un pistolet ( la CIA durant la guerre froide avait &eacute;quiper les armes de certains agents de micros-&eacute;metteurs ULTRA miniature), dans un clavier d'ordinateur, une prise gigogne t&eacute;l&eacute;phonique ou bien mural, un poste de t&eacute;l&eacute;vision, une montre, un bouton de veste, dans une semelle de chaussure, une tringle &agrave; rideau, une cha&icirc;ne HI-FI, un poste t&eacute;l&eacute;phonique fixe ou sans fils, un portable cellulaire GSM etc .. Tous les endroits sont bon pour y placer un micro-espion ! ! !</P>

<P>Tout d&eacute;pend de la possibilit&eacute; pour le poseur d'&eacute;coute de placer son mat&eacute;riel ainsi que de l'urgence et du niveau de priorit&eacute; de l'op&eacute;ration !</P>

<P>Mais soyons r&eacute;aliste ! Le micro-&eacute;metteur cach&eacute; dans le stylo ou autres sont des cas extr&ecirc;mement rare dans la pratique !</P>

<P>Car les professionnels, d&eacute;tectives, services de s&eacute;curit&eacute; priv&eacute;e (et public), trafiquant de drogue etc.. Utilisent des bug en forme de cube ou de rectangle classique.</P>

<P>N'oublions pas que plus le micro-&eacute;metteur est miniaturis&eacute;, plus sa port&eacute; est faible ! ! !</P>

<P>&nbsp;</P>
<P>Le probl&egrave;me n&eacute;anmoins de leurs d&eacute;tections est ici un peu plus compliquer ..</P>

<P>En g&eacute;n&eacute;rale, un bon r&eacute;cepteur scanner &agrave; bande continue en couverture exemple : 150 Khz &agrave;  1650 Mhz (soit 1.650 Ghz), et suffisant pour leurs d&eacute;tection, mais il est pr&eacute;f&eacute;rable d'utilis&eacute; aussi un bon fr&eacute;quencem&egrave;tre afin d'&ecirc;tre sur de pouvoir les localis&eacute;s. Un &eacute;metteur-r&eacute;cepteur radioamateur peut aussi faire l'affaire en cas de besoin, ou bien sinon parfois m&ecirc;me un poste de t&eacute;l&eacute;vision !</P>

<P>Dans tous les cas encore une fois, il est inutile d'achet&eacute; un d&eacute;tecteur !</P>

<P>Car les d&eacute;tecteurs ne sont bien souvent que de vulgaire r&eacute;cepteurs multi-bandes !</P>

<P>Donc attention aux arnaques du march&eacute; juteux des mat&eacute;riels de contre-espionnage &eacute;lectronique.</P>

<P>&nbsp;</P>
<P>Enfin voila la partie la plus sensible, puisqu'il s’agit l&agrave; des syst&egrave;mes d'&eacute;coutes &eacute;lectroniques utilis&eacute; par les agents des Services Secrets (CIA, DGSE, BND..)</P>

<P>je ne rentrerai pas trop dans le d&eacute;tail faute d'informations suffisante sur le sujet, n&eacute;anmoins il y &agrave; deux choses &agrave; retenir :</P>

<P>1) les services secrets font beaucoup appel aux basses fr&eacute;quences , c'est &agrave; dire &agrave; des micros-&eacute;metteurs fonctionnant dans les bandes 30-50 Khz, 100-150 Khz, 250-350 Khz etc.. Bien souvent en AM au lieu de la FM traditionnel.</P>

<P>Ces micros-&eacute;metteurs sont souvent auto-aliment&eacute; par le courant &eacute;lectrique 220V ou bien sinon par une ligne t&eacute;l&eacute;phonique ! (ou une batterie = rare) </P>

<P>Ils peuvent aussi &ecirc;tre dot&eacute; d'un d&eacute;clenchement par t&eacute;l&eacute;commande, afin d'&ecirc;tre coup&eacute; durant une inspection de routine (c'est le cas pour de nombreuses Ambassades).</P>

<P>2) L'&eacute;mission des micros-&eacute;metteurs est CRYPTE ! (sur le principe de l'inversion de fr&eacute;quence parfois).</P>

<P>enfin je pourrait cit&eacute; aussi qu'il font appel &agrave; de tr&egrave;s haute fr&eacute;quences en UHF : 1500 Mhz, 1800 Mhz .. pour leurs bug UHF.</P>

<P>Mais entres nous, il est peut probable que vous et moi faisions l'objet d'&eacute;coute de la DGSE un jour ..</P>

<P>Leur d&eacute;tection peut &ecirc;tre n&eacute;anmoins fait par l'utilisation de r&eacute;cepteur scanner haut de gamme ! Pouvant &ecirc;tre capable d'intercept&eacute; des fr&eacute;quences dans la bande des 1 Ghz et plus. En ce qui concerne par contre les tr&egrave;s basse fr&eacute;quence (VLF,LF,HF), l'utilisation d'un r&eacute;cepteur D&eacute;cam&eacute;trique pourra &ecirc;tre utile. Nous retrouverons aussi encore une fois l'usage d'un fr&eacute;quencem&egrave;tre, ainsi que d'un testeur &eacute;lectrique ou autres appareils de mesure complexe..</P>

<P>=O=</P>

<P>ECOUTE FILAIRE :</P>

<P>&nbsp;</P>
<P>Apr&egrave;s avoir abord&eacute; les &eacute;coutes par micros-&eacute;metteurs radio, nous allons donc &eacute;tudier un peu le principe des &eacute;coutes clandestines filaires.</P>

<P>Autant dire qu'il est extr&ecirc;mement rare de voir des particuliers utilis&eacute; ce genre de syst&egrave;me d'&eacute;coute !</P>

<P>Seul des professionnels ont acc&eacute; en g&eacute;n&eacute;ral &agrave; ce type de mat&eacute;riel pointu et tr&egrave;s complexe &agrave; mettre en oeuvre.</P>

<P>Le principe semble &agrave; priori relativement simple pourtant .. Il suffit de faire pass&eacute; un c&acirc;ble audio &agrave; forte imp&eacute;dance (pour une bonne r&eacute;ception du signal BF) le long d'un mur par exemple, en le fixant dans la m&ecirc;me gaine que les c&acirc;bles &eacute;lectriques ou t&eacute;l&eacute;phoniques. D'un c&ocirc;t&eacute; un micro miniature ce trouvant dans le domicile de la victime et de l'autre dans un appartement sur le m&ecirc;me palier, un r&eacute;cepteur de signaux basse fr&eacute;quence BF.</P>

<P>La distance de l'&eacute;coute pouvant &ecirc;tre de 100 M ! Il est conseiller dans ce cas d'utilis&eacute; des Amplificateurs de signaux le long du c&acirc;ble ou plus souvent des c&acirc;bles !</P>

<P>Car lorsque des organisations comme les Services Secrets utilisent cet m&eacute;thode (courante et r&eacute;guli&egrave;rement), il n'est pas rare que soit install&eacute; une dizaines de micros ! !</P>

<P>Le tout connect&eacute; &agrave; une batteries de magn&eacute;tophones et de casques d'&eacute;coutes.</P>

<P>Le seul moyen pour vous de pouvoir d&eacute;tect&eacute; ce type de syst&egrave;me, &eacute;tant de v&eacute;rifier vos gaines &eacute;lectriques et t&eacute;l&eacute;phoniques.</P>

<P>Il existe aussi une autre m&eacute;thode d'&eacute;coute d'ambiance dont le principe et encore plus simple ..</P>

<P>Il s’agit tout simplement au service secret de louer l'appartement juste &agrave; c&ocirc;t&eacute; de celui de la victime et de perc&eacute; dans les murs quelques trous de la grosseur d'une t&ecirc;te d'&eacute;pingle ! ! En prenant soins de s’arr&ecirc;ter juste &agrave; la lisi&egrave;re du papier peint de la victime afin d'y installer des micros ou bien sinon un syst&egrave;me de vision optique sub-miniature relier &agrave; un camescope ou magn&eacute;toscope.</P>

<P>Pour la victime, il est quasi impossible de d&eacute;tect&eacute; ce type d'&eacute;coute ! !</P>

<P>Seul une soci&eacute;t&eacute; EXPERTE en contre-espionnage &eacute;lectronique pourra avoir les moyens techniques de rep&eacute;rait le syst&egrave;me (prix moyen pour un particulier 9000 Fr. &agrave; plus de 15000 Fr., pour une soci&eacute;t&eacute; 50.000 Fr et plus !).</P>

<P>N&eacute;anmoins le co&ucirc;t d'une telle installation (mat&eacute;riels et personnels) par un service secret, le r&eacute;serve pour des cas d'espionnage extr&ecirc;mement important !</P>

<P>=O=</P>

<P>&nbsp;</P>
<P>DERIVATION TELEPHONIQUE : </P>

<P>&nbsp;</P>
<P>A la base une d&eacute;rivation t&eacute;l&eacute;phonique est tr&egrave;s facile &agrave; mettre en oeuvre, que cela soit le fait d'un simple individu ou d'un service secret..</P>

<P>Dans le cas d'une &eacute;coute par d&eacute;rivation par un service secret, il sera impossible pour vous de le d&eacute;tect&eacute;, car la d&eacute;rivation sera fait directement au central t&eacute;l&eacute;phonique le plus proche.</P>

<P>Mais si cela est le fait d'un service secret &eacute;tranger sur un citoyen du territoire fran&ccedil;ais, les agents secrets n'auront pas d'autres solutions que de devoir acc&eacute;d&eacute; soit &agrave; votre ligne t&eacute;l&eacute;phonique via le sous-r&eacute;partiteur d'&eacute;tage pour un b&acirc;timent ou bien sinon celui de quartier pour un pavillon.</P>

<P>En g&eacute;n&eacute;ral, le fait de placer un magn&eacute;tophone sur la ligne de la victime dans le sous-r&eacute;partiteur, et valable pour une op&eacute;ration ponctuel de quelques heures uniquement.</P>

<P>Mais si cela doit durait plusieurs semaines, il n'y aura pas d'autre choix que d'installer un micro-&eacute;metteur auto-aliment&eacute; par la ligne t&eacute;l&eacute;phonique de la victime dont la r&eacute;ception des signaux, s’effectuera sur un r&eacute;cepteur scanner relier &agrave; un magn&eacute;tophone devant &ecirc;tre relev&eacute; plusieurs fois par semaines ou bien sinon pour plus de s&eacute;curit&eacute; &agrave; un &eacute;metteur VHF ou UHF de forte puissance utilis&eacute; comme "relais" , l'&eacute;mission de l'&eacute;metteur dans un v&eacute;hicule par exemple &eacute;tant interceptable &agrave; plusieurs kilom&egrave;tre !</P>

<P>Dans ce cas, bien que l'&eacute;mission puisse &ecirc;tre d&eacute;tect&eacute; par le service de contre-espionnage local, il ne pourront pas n&eacute;anmoins trouver les commanditaires de l'op&eacute;ration !</P>

<P>Il est encore possible d'&eacute;tudier d'autres sch&eacute;mas d'op&eacute;ration.. du m&ecirc;me type.</P>

<P>Mais encore une fois, ne soyons pas parano&iuml;aque !</P>

<P>Dans la pratique, vous aurait surment plus &agrave; faire &agrave; un fraudeur du t&eacute;l&eacute;phone ou bien &agrave; un espion amateur.. Une simple surveillance du sous-r&eacute;partiteur durant quelques heures de votre part, devrait vous permettrais de trouver votre "espion".</P>

<P>Dans le cas contraire, une surveillance discr&egrave;te de la police ou de la gendarmerie devrait &ecirc;tre efficace. </P>

<P>Une seul erreur &agrave; ne pas faire : ne pas t&eacute;l&eacute;phon&eacute; de chez vous !</P>

<P>&nbsp;</P>
<P>=O=</P>

<P>SYSTEME COMINT :</P>

<P>&nbsp;</P>
<P>Interception radio &agrave; longue port&eacute;e : T&eacute;l&eacute;phonique et de r&eacute;seaux de radiocommunications.</P>

<P>Ironie des m&eacute;thodes d'&eacute;coutes clandestines, une des plus faciles &agrave; mettre en oeuvre et celle de l'interception hertzienne.</P>

<P>Pour cela un service secret ou bien un espion amateur, n'aura qu'&agrave; utilisait un simple r&eacute;cepteur SCANNER et/ou DECAMETRIQUE pour l'op&eacute;ration !</P>

<P>Les r&eacute;cepteurs de type scanner couvrant en g&eacute;n&eacute;ral une tr&egrave;s large gammes de bandes de fr&eacute;quences aussi bien VHF qu' UHF ! (30 Mhz &agrave; 1 Ghz ).</P>

<P>Ainsi il est tr&egrave;s facile d'intercept&eacute; le trafic radio de nombreuses administrations !</P>

<P>Police nationale, Arm&eacute;e, Pompiers etc ..</P>

<P>Mais dans notre cas, nous allons abord&eacute; les risques d'&eacute;coute des t&eacute;l&eacute;phones sans fils (TSF), des radiot&eacute;l&eacute;phones cellulaires (analogique), des radio-messageries (Pagers).</P>

<P>Il y &agrave; des cas ou il est inutile pour un agent secret ou un espion amateur d'&ecirc;tre oblig&eacute; de jouer au poseur de micros ..</P>

<P>Le simple fait, que la victime soit utilisatrice d'un TSF, et un v&eacute;ritable jeu d'enfant pour eux !</P>

<P>Ainsi ils leurs suffit de programmer dans le scanner, les fr&eacute;quences des t&eacute;l&eacute;phones sans fils agr&eacute;e ou non , pour avoir &agrave; loisir la possibilit&eacute; d'&eacute;cout&eacute; toutes les communications de la victime et m&ecirc;me de d&eacute;cod&eacute; les num&eacute;ros de t&eacute;l&eacute;phones (DTMF) via un petit bo&icirc;tier (de la grosseur d'un pager!) ou bien sinon en utilisant un logiciel informatique ad doc (Wintone etc..).</P>

<P>Ils peuvent aussi relier le scanner &agrave; un magn&eacute;tophone d&ocirc;t&eacute; d'un syst&egrave;me VOX, ce qui mettra le magn&eacute;tophone en route au seul son de la voix ! (&eacute;conomie de bande !).</P>

<P>Dans le cas, ou la victime serait prudente et utiliserait un syst&egrave;me de cryptophonie de type inversion de fr&eacute;quence, il n'y aura pas de probl&egrave;me particulier aux espions pour la r&eacute;ception si leur r&eacute;cepteur scanner et d&ocirc;t&eacute; de la d&eacute;modulation BLU.</P>

<P>La seul parade &agrave; ce type d'&eacute;coute &eacute;tant d'utilis&eacute; un poste t&eacute;l&eacute;phonique fixe !</P>

<P>Tout en esp&eacute;rant, que ne soit pas installer un micro-espion sur la ligne ou bien une d&eacute;rivation ..</P>

<P>&nbsp;</P>
<P>Et les radiot&eacute;l&eacute;phones cellulaires .. Ceci est un vieille exemple car ne concernant que les portables Analogique !</P>

<P>Il y a n&eacute;anmoins encore en service quelques t&eacute;l&eacute;phones cellulaires de voitures de type Radiocom 2000 et SFR en service (pour combien de temps?).</P>

<P>Durant les ann&eacute;es 1980 just'en 1993 +/-, le r&eacute;seau t&eacute;l&eacute;phonique cellulaire &eacute;tait en analogique, ce qui donn&eacute; la possibilit&eacute; &agrave; de nombreux espions amateurs, dealers de drogue etc.. d'avoir acc&eacute; tr&egrave;s facilement &agrave; tous les t&eacute;l&eacute;phones cellulaires !</P>

<P>N&eacute;anmoins, il &eacute;tait difficile de traquer le cellulaire d' une victime de d&eacute;finie, car celle-ci changeant de fr&eacute;quence radio r&eacute;guli&egrave;rement selon la zone de couverture de l'&eacute;metteur cellulaire.</P>

<P>Seul les services secrets pouvait se permettre de traquer une personne gr&acirc;ce &agrave; l'aide de France Telecom.</P>

<P>L'unique parade &agrave; l'&eacute;poque &eacute;tait d'utilis&eacute; un module de cryptophonie relier au cellulaire, mais dont l'utilisation en France &eacute;tait interdit au citoyen lambda.</P>

<P>Aujourd'hui avec l'arriv&eacute;e du cellulaire num&eacute;rique de type GSM, les gens sont persuad&eacute; en g&eacute;n&eacute;ral que leurs conversations sont crypt&eacute; et donc impossible &agrave; intercept&eacute; !</P>

<P>Hors cela est FAUX !  Il suffit de voir au USA, il n'est pas du tout un probl&egrave;me d'intercept&eacute; les cellulaires GSM !</P>

<P>Et bien que notre syst&egrave;me soit un peu diff&eacute;rent, cela ne pause dans la pratique en fait aucun probl&egrave;me pour un service secret et prochainement (d'ici 2 &agrave; 5 ans) pour les espions amateurs, pirates et hackers, truands.</P>

<P>&nbsp;</P>
<P>Quant au PAGER, idem que pour les TSF et Cellulaire analogique !</P>

<P>&nbsp;</P>
<P>Un espion amateur n'aura qu'&agrave; utiliser un scanner relier &agrave; un petit d&eacute;codeur POCSAG ou bien &agrave; un ordinateur d&ocirc;t&eacute; d'un logiciel de type POC32, pour pouvoir lire en direct tous les messages des TATOO, EXPRESSO etc .. </P>

<P>L'unique parade contre ce type d'interception, &eacute;tant d'utilis&eacute; un code secret pour communiqu&eacute;.</P>

<P>D'ailleurs les services secrets et les trafiquants de drogues ainsi que les terroristes utilisent souvent un code secret lors de l'usage de radio-messagerie !</P>

<P>&nbsp;</P>
<P>=O=</P>

<P>ATTENTION :</P>

<P>Ce petit manuel pratique n'a &eacute;tait fait que pour ce pr&eacute;munir contre les tentatives d'espionnage &eacute;lectroniques. </P>

<P>En aucun cas celui-ci ne doit &ecirc;tre consid&eacute;r&eacute; comme &eacute;tant un manuel de formation en &eacute;coute clandestine !</P>

<P>L'objet de ce manuel n'&eacute;tant pas d’incit&eacute; le lecteur &agrave; mettre en oeuvre les m&eacute;thodes expliqu&eacute; qui sont toutes illicites en France.</P>

<P>=O=</P>

<P>INFORMATION :</P>

<P>Ce manuel de contre-espionnage &eacute;lectronique n'&eacute;tant pas exausif, il est possible d'avoir de plus ample information sur le sujet en consultant Internet et les journaux sp&eacute;cialis&eacute; en s&eacute;curit&eacute;.</P>

<P>=O=</P>
<P>&nbsp;</P>
<FONT SIZE=2><P><IMG SRC="crcf.gif" WIDTH=439 HEIGHT=359></P>
</FONT><P>CHAOS.RADIO.CLUB.FRANCE  C.R.C.F</P>
<br></td></table>
<br>
<table width="600" border="0"><td>
<p align="left"><a href="trash.htm"><img src="previous.gif" border="0"></a></p></td>
<td><p align="right"><a href="catas.html"><img src="next.gif" border="0"></a></p></td></table>

<br><table width=600>
<hr width="80%" size="2"><br><font face="verdana" size="2">
CRYPTEL 1999: Distribution autorisée et conseillée d'ailleurs !
Citez juste les AUTEURS et les SOURCES par simple politesse :)<br><br></font>
<hr width="80%" size="2"><br></table></center></BODY></HTML>
