<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Document sans titre</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#FFFFFF" link="#FFFFFF" vlink="#FFFFFF" alink="#FFFFFF">
<div align="center">
  <h1>Accueil</h1>
  <p>&nbsp;</p>
  <p align="left">Bienvenue dans cette premi&egrave;re zine de la &quot;Hack Team L&quot;. Programmation,
    webmastering, graphisme et autres seront abord&eacute;s dans cette zine. <br>
    Avant toute chose, pourquoi ce nom ? Pourquoi la Hack Team L ?? <br>
    Tout a commenc&eacute; il y a de cela un, voir deux an, quand je debutait dans le
    domaine de l'underground. Moi et mes amis, qui tatait pas mal aussi de leurs
    cot&eacute;, nous avions le projet amitieux que de monter une team underground.
    Nous avons alors cherch&eacute; des jeux de mot avec hack, en cours de phisique,
    fran&ccedil;ais, math et surtout, en latin ! Hackademie... Deja pris. RadioHacktif...
    deja pris, et, en voyant mon pote d&eacute;sesp&egrave;r&eacute;, je lui ai dit qu'il ferai mieu
    de ce boire un p'tit jus d'orange ou un ch'tit actimel... actimel ? Hacktimel
    ? Hack-ti-Mail ? Hack-TEAM-L ! Et voila, sans le savoir nous avion trouv&eacute;
    le nom de notre team ! Mais il se trouve que certain d'entre mes pote on
    d&eacute;m&eacute;nag&eacute;s et/ou ce sont d&eacute;sinteress&eacute; de ce projet. <br>
    La team 	a donc &eacute;t&eacute; inexistante pendant un voir deux ans, bien que toujours
    pr&eacute;sente dans ma tete. Puis un beau jour, je me suis cal&eacute; sur le forum d'elbossoso
    et ai recontr&eacute; d@rk qui montait une team, la d@rk tokay. En lisant leurs
    premi&egrave;re zine plus qu'interessante, il etait dit qu'il recherchait un programmeur
    dou&eacute;, j'ai postul&eacute; et il m'a pris ! Puis au bout d'un certain temp =&gt; chute
    de la team a cause de l'inactivit&eacute; de certain membres... <br>
    Pourquoi pas resortir du placard mon vieux projet de team et monter ma propre
    team ? <br>
    Et apres quelques temps de recherche de personne dou&eacute;s en programmation et/ou
    securit&eacute; informatique et/ou graphisme, nous revoila, plus fort que jamais,
    prets a tout casser !</p>
  <p align="left">&nbsp; </p>
</div>
</body>
</html>
