<html>
<head>
	<title>AlTeRnAtIvE n&#176;1 // Mouvement Galaad Underground // HTML Ezine</title>
</head>
<body bgcolor="Black" text="Gray" link="Maroon" vlink="Maroon" alink="Maroon">

<table align="center" cellspacing="2" cellpadding="2" border="0">
<tr>
    <td><font color="red">
<pre>
              ,       ,
             /(       ))
             \ \__   / |        
            /- _ `-/  '      
            (/\/ \ \   /\       
            / /   | `    \
            >O O   )      |      
            `-^--'`<     '            
            (_.)  _ )    /                           
            `.___/`    /        
              `-----' /                       
 <----.     __ / __   \                           
 <----|====O)))==) \) /===========             
 <----'    `--' `.__,' \
              |         |      
               \       /              
           ____( (_   / \______
         ,'  ,----'   |        \
         `--{__________)       \/</pre></font></td>
    
	<td><font face="" color="Lime"><font size="+4"><font face="Artistik">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; %&#164;$&pound;*&#181;!#"~`<br>
	&nbsp;&nbsp;&nbsp;| AlTeRnAtIvE |<br>
	`~"#!&#181;*&pound;$&#164;%
	</font></font></font></td>
</tr>
</table>

<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div><br>
<div align="center"><font color="Aqua"><font size="+1"><font face="Ashley Inline">&nbsp;EdItO<br>
~~~~~</font></font></font></div><br><br>
&nbsp;&nbsp; Bon, allez, j'me lance dans un essai d'éditorial. (de toutes façons,
c'est le genre de trucs qui m'horripile et que je ne lis jamais)&nbsp;:<br>
&nbsp;&nbsp;Galaad est né le dimanche 26 avril 1998. Pourquoi créer un
nouveau groupe, alors qu'il en existe déjà une multitude ?<br>
Expression d'un ras-le bol ? Non...<br>
Défit envers les "vieux" du hack ? Non...<br>
Décision prise après une soirée bien arrosée ? Non...<br>
&nbsp;&nbsp;Galaad voulait en fait (et veut toujours) rénover la scène francophone.
Galaad est un groupe ouvert, tolérant, un groupe jeune, animé d'une
volonté de changements.<br>
&nbsp;&nbsp;Pourquoi garder la vieille habitude, datant de l'époque où
l'informatique était américaine, de ne pas mettre d'accents ?<br>
&nbsp;&nbsp;Pourquoi écrire systématiquement des E-Zines en version texte alors
que le HTML s'est imposé comme un langage universel de mise en page
et, surtout, pas (enfin pas encore) sous l'emprise de Bill Gates (j'me
demande bien pourquoi j'ai mis des majuscules à ce nom ???)<br>
&nbsp;&nbsp;M'enfin bon, on ne va pas tout casser non plus, et surtout pas
sacrifier à la bonne vieille tradition du "disclaimer" que je
traduirais bien par le "J'y-Suis-Pour-Rien" :<br>
&nbsp;&nbsp;Toutes les informations contenues dans ce document sont (par
définition) à but strictement informatif. Personne ne vous incite à
les utiliser dans quelque sens que ce soit... <br>
&nbsp;&nbsp;Celà dit, bonne lecture ! <P align="right">Le_Magicien</p><br>
&nbsp;&nbsp;Arf!! Pour cette premi&egrave;re fois on a d&eacute;cid&eacute; de faire l'intro &agrave;
deux, pour que ce soit plus r&eacute;glo. Bon, n'&eacute;tant pas tr&egrave;s dou&eacute; pour ce type de
r&eacute;daction, on va essayer de faire un effort.<br>
Tout d'abord, il est vrai qu'on a pris un max de retard sur la sortie de <u>AlTeRnAtIvE</u>. Pkoi?
Tout simplement &agrave; cause de notre boulot, de certains membres pas actifs qu'il a fallu vaquer (m&eacute;nage),
d'un design assez sp&eacute;cial pour ce zine qu'il a fallu organiser, de plusieurs
projets en m&ecirc;me temps et qu'on a pas 536 mains, de la difficult&eacute; de faire de l'originalit&eacute; de nos jours,
d'un site et d'une mailing-list &agrave; s'occuper, etc...<br>
J'esp&egrave;re en tout k que ce premier num&eacute;ro va vous plaire ; on y a pass&eacute; du temps.
Certes, ce n'est peut &ecirc;tre pas formidable mais on a fait ce qu'on a pu et on esp&egrave;re pouvoir
faire mieux la prochaine fois, avec plus de "main-d'oeuvre"...<br>
Il y a besoin d'un certain nombre de police pour lire ce zine. Elles ne sont pas indispensables mais
bon.... Vous les trouverez dans le fichier .zip. N'oubliez pas de les mettre dans le bon r&eacute;pertoire! D'ailleurs, ce ne sont pas
des polices rares donc il se peut bien que vous les ayez d&eacute;j&agrave;.<br>
Ah oui, j'oubliais&nbsp;!! On va essayer de sortir un no de <u>AlTeRnAtIvE</u> au minimum tous les trimestres,
et plus souvent si on nous le permet.<br>
Vive l'Oasis et le Coca au guronzan!! :))<br>
{PS : bien jou&eacute; &agrave; SoBeIt qui est l'un de nos premiers membres et qu'a pas &eacute;t&eacute; foutu
de nous balancer un article &agrave; temps!}<br>
<p align="right">La_Crapule</p><br>

<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div><br>
<div align="center"><font color="Aqua"><font size="+1"><font face="Ashley Inline">&nbsp;SoMmAiRe<br>
~~~~~~~~</font></font></font></div><br><br>
<table align="center" cellspacing="2" cellpadding="2" border="0">
<tr>
    <td><b>N&#176;</B></td>
    <td><b>Titre</B></td>
    <td><b>Auteur</b></td>
</tr>
<tr>
    <td>1</td>
    <td><a href="tipsph.html">Tips Phreaking ;)</a></td>
    <td>La_Crapule</td>
</tr>
<tr>
    <td>2</td>
    <td><a href="carding.html">Le Carding</a></td>
    <td>Kallipse</td>
</tr>
<tr>
    <td>3</td>
    <td><a href="blackbox.html">La Black-Box</a></td>
    <td>SKeud</td>
</tr>
<tr>
    <td>4</td>
    <td><a href="iso.html">Proc&eacute;d&eacute;s anti-copiage</a></td>
    <td>Damocles</td>
</tr>
<tr>
    <td>5</td>
    <td><a href="rapport.html">Rapport de sécurité publique</a></td>
    <td>CyberbobJr</td>
</tr>
<tr>
    <td>6</td>
    <td><a href="emulation.html">L'Emulation</a></td>
    <td>SKeud</td>
</tr>
<tr>
    <td>7</td>
    <td><a href="Prog-CDT.html">Programmer un Cheval De Troie</a></td>
    <td>Le_Magicien</td>
</tr>
<tr>
    <td>8</td>
    <td><a href="ircident.html">Comment changer d'identité sur IRC</a></td>
    <td>La_Crapule</td>
</tr>
<tr>
	<td>9</td>
	<td><a href="virii.html">Virii</a></td>
	<td>DDWay</td>
</tr>
<tr>
	<td>10</td>
	<td><a href="p54-09.html">Détection d'OS distante par prise d'empreinte de pile TCP/IP</a></td>
	<td>ArHuman</td></tr>
</table><br>
<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div><br>

<div align="center"><font color="Aqua"><font size="+1"><font face="Ashley Inline">&nbsp;Remerciements<br>
~~~~~~~~~~~</font></font></font></div><br><br>

&nbsp;&nbsp;Bon, pour ma part, je tiens &agrave; faire un &eacute;norme "grettz" &agrave; NoRace,
NeurO, et AlexM qui m'ont soutenu durant mes ann&eacute;es "newbie".<br>
Je tiens aussi a remercier Monty, XAlien (qui a  r&eacute;c&eacute;ment &eacute;t&eacute; bust&eacute; :(( ), L'Homme Providentiel, Hugs2000, -°BRäBz°-,
JobiWan, Gadjoman, [boubou], BadBlood, Wo|verine, DarkEvil & ]master[, Emmanuel Jud (HNT),
Damien Bancal (Taz) et tous ceux que j'oublie mais qui nous ont aid&eacute;s, soutenus depuis
la cr&eacute;ation de Galaad.<br>
Un hello aussi &agrave; Blorp, retir&eacute; de la sc&egrave;ne fran&ccedil;aise, `KeNjI`, &eacute;diteur
de [orgasm], GaRgL, du Meeting 2600, Jalil, hacker au Maroc, et jff & Klone1 qui m'on envoy&eacute; balad&eacute;
le jour o&ugrave; je leur ai demand&eacute; de l'aide!!  ;))<br>
Merci &agrave; vous tous!!!!!!!!<br>
La_Crapule<br><br>
<div align="center"><img src="ligne.gif" width=540 height=4 border=0 alt=""></div><br>

Mouvement Galaad Underground<br>
<b><font size="-2"><a href="http://galaad.deserens.org">http://galaad.deserens.org</a><br>
<a href="mailto:galaad_mouvement@bigfoot.com">galaad_mouvement@bigfoot.com</a><br>
IRCNet #galaad<br>
AlTeRnAtIvE n&#176;1 ; mars 1999</font></b><br>
<font size="-2">"Ah celui l&agrave;, oui, il a une belle t&ecirc;te de vainqueur!"</font><br>
<hr>
</body>
</html>
