<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [fr] (Win98; I) [Netscape]">
   <meta name="Author" content="GIREL François">
   <title>3D13_01</title>
</head>
<body text="#000000" bgcolor="#FFCC00" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<h1>
<font face="Times New Roman,Times"><font color="#3333FF">3</font></font><font face="Arial,Helvetica"><font color="#FF0000">D</font></font><font face="Haettenschweiler"><font color="#00CC00">1</font><font color="#000000">3</font></font></h1>

<hr WIDTH="100%">
<center>LUNDI 20 AVRIL 1999
<br>ISSUE #1</center>

<hr WIDTH="100%">
<br>Salut &agrave; tous,
<br>je vous pr&eacute;sente <b>3D13</b>, un nouvel e-zine.
<br>Pourquoi j'ai utilis&eacute; le format HTML pour ma page ? c'est parce
que l'e-zine est mieux pr&eacute;sent&eacute; et permet d'&ecirc;tre port&eacute;
sur le maximum de plateformes, les caract&egrave;res passent aussi bien
sous windows que sous linux et en plus, &ccedil;a me permettra de mettre
des images, qui seront certainnement plus compr&eacute;hensibles que des
sch&eacute;mas faits en ASCII-art :-)
<br>Je suis sur que ce mag' vous plaira, car nous parlerons de tout. J'&eacute;sp&egrave;re
que je serais le plus clair possible, en tout cas pour les newbies. Je
n'ais rien contre les newbies : "Les newbies sont les elites de demain".
<br>Je vais essayer d'&ecirc;tre le plus cr&eacute;atif possible, j'&eacute;viterais
donc de reprendre les article d'autres e-zines (et si jamais &ccedil;a
arrive, je demanderais l'avis de l'auteur et je ne mettrait pas mon nom
dessus, comme pour l'exemple de crack de The yAcC), la seule chose que
je "repomperais" sera la source de programmes en C ou autre langage quand
c'est pas moi qui l'aurait fait (ex.: Satan, Juggernaut, &agrave; venir),
mais je vous dirais o&ugrave; je l'ais prit.
<br>J'ai pas envie de faire un disclamer car je sait tr&egrave;s bien ce
que je fait et si je me fait choper, eh ben tant pis pour moi !
<div align=right>3D13</div>

<hr WIDTH="100%">
<center>
<h2>
<u><font face="Times New Roman,Times"><font color="#3333FF">SOM</font></font><font face="Arial,Helvetica"><font color="#FF0000">MA</font></font><font face="Haettenschweiler"><font color="#009900">IR</font>E</font></u></h2></center>

<center><table BORDER=2 CELLSPACING=2 CELLPADDING=2 COLS=2 WIDTH="75%" BGCOLOR="#FFCC00" >
<tr>
<td>
<center><b><font size=+1>Nom de l'article</font></b></center>
</td>

<td>
<center><b><font size=+1>Auteur</font></b></center>
</td>
</tr>

<tr>
<td><a href="#1">Pourquoi je suis un cracker et un hacker ?</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#2">Initiation au TCP/IP</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#3">Initiation au Turbo Pascal</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#4">Initiation au cracking</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#6">Le SE (Social Engeenering)</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#7">Attaque d'un sitez, ma m&eacute;thode, sans SE</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#8">Failles de s&eacute;curit&eacute;</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#9">Le nucl&eacute;aire</a></td>

<td>
<center>3D13</center>
</td>
</tr>

<tr>
<td><a href="#10">Le mot de la faim</a></td>

<td>
<center>3D13</center>
</td>
</tr>
</table></center>

<p>
<hr WIDTH="100%">
<h3>
<a NAME="1"></a><u>Pourquoi je suis un cracker et un hacker? pourquoi j'&eacute;cris
cet e-zine ? qui je suis ?</u></h3>
Je hack pour une seule et bonne raison, prouver aux autres que je suis
plus malin qu'eux. Si je cracke des sites, c'est non pas pour le d&eacute;truire,
ce qu'il ne faut jamais faire (sauf si c'est un site x&eacute;nophobe,
p&eacute;dophile, n&eacute;crophile, secte, ...), mais par "jeu", il n'y
a vraiment que &ccedil;a qui m'amuse. Par exemple, la page internet de
votre universit&eacute;, franchement, tout le monde veut se la faire!,
changer la photo de l'&eacute;cole par une madame l&eacute;g&egrave;rement
v&ecirc;tue !, modifier le contenu, ... &agrave; vous d'avoir de l'imagination.
<br>Si j'&eacute;crit cet e-zine, c'est pour diffuser mes id&eacute;es
(qui ne sont pas parfois tr&egrave;s claires), envoyer un max de monde
en prison, et rendre au maximum les gens aussi dingue que moi !!! que d'innovations,
mais si tu ne veux pas devenir fou, NE LIS PAS LA SUITE.
<br>Moi, je suis un informaticien fou, le genre de mec qui pr&eacute;f&egrave;re
un ordinateur &agrave; une femme, vous voyez ce que je veux dire ?
<br>Je m'int&eacute;resse tr&egrave;s nettement &agrave; la s&eacute;curit&eacute;
informatique ;-), donc, en diffusant un maximum de failles, vous les exploiterez
et moi, j'aurais du boulot, vous saisissez ?, vous fa&icirc;tes les conneries,
et moi, je doit vous trouver, super comme jeu.
<br>J'aime pas bien les &eacute;checs, mais l&agrave;, quand on fait echec
et mat, on est tr&egrave;s mal.
<br>
<hr WIDTH="100%">
<h3>
<a NAME="2"></a><u>Initiation au TCP/IP</u></h3>
Transmission Control Protocol / Internet Protocol
<br>Le protocole TCP est celui qui est le plus employ&eacute; sur internet,
il permet aux machines de communiquer entre-elles, s'il a du succ&egrave;s,
c'est parce qu'il est un protocole de transfert fiable (mais plus lent
que l'IPX/SPX). Ses transmissions sont bass&eacute;es sur la transmission
d'un flux. Mais il se peu que les donn&eacute;es arrivent incorrectement
: dans le cas d'un livraison non-fiable, il se peut que les donn&eacute;es
arrivent dans un &eacute;tat critique. Par exemple, les donn&eacute;es
re&ccedil;ues peuvent &ecirc;tre illisibles par gzip, winzip, ...
<br>Une fois que le circuit est ouvert, les donn&eacute;es peuvent voyager
simultan&eacute;ment dans les deux sens (client/serveur), c'est le type
de transmission appell&eacute; "full-duplex". Ainsi, quand il y a un transfert
de fichier en cours, le client peut envoyer un message d'erreur au serveur.
<br>Pour tout bloc correctement re&ccedil;u, le client envoye un message
au serveur, indiquant que le transfert &agrave; &eacute;t&eacute; correctement
termin&eacute;. Sinon, deux &eacute;venements peuvent se produire :
<dl>
<li>
Le serveur re&ccedil;oit une ou plusieurs erreurs</li>

<li>
Le serveur ne re&ccedil;oit rien</li>
</dl>
Sauf cas d'erreur fatale, quand le serveur re&ccedil;oit une erreur, il
essaye de renvoyer une nouvelle fois les donn&eacute;es.
<p>Le protocole IP assure la livraison des paquets pour les protocoles
de la suite TCP/IP.
<p>Nous allons voir maintenant une petite liste de ports, pour cracker
un sitez, il faut avant tout trouver le bon port, c'est pour cela que vous
aurez besoin d'un scanner de ports :
<br>&nbsp;
<center><table BORDER COLS=2 WIDTH="60%" >
<tr>
<td><i>Service ou application</i></td>

<td><i>Port</i></td>
</tr>

<tr>
<td>FTP (File Transfert Protocol)</td>

<td>21</td>
</tr>

<tr>
<td>Telnet</td>

<td>23</td>
</tr>

<tr>
<td>SMTP (Simple Mail Transfert Protocol)</td>

<td>25</td>
</tr>

<tr>
<td>Gopher</td>

<td>70</td>
</tr>

<tr>
<td>finger</td>

<td>79</td>
</tr>

<tr>
<td>HTTP (Hypertext Transfert Protocol)</td>

<td>80</td>
</tr>

<tr>
<td>NNTP (Network News Transfert Protocol)</td>

<td>119</td>
</tr>
</table></center>
Si vous souhaitez obtenir une liste d&eacute;taill&eacute;e des assignations
de tous les ports, visitez la page : <a href="ftp://ftp.isi.edu/in-notes/iana/assignements/port-numbers">ftp://ftp.isi.edu/in-notes/iana/assignements/port-numbers</a>
<p>Telnet est une application tr&egrave;s r&eacute;pandue, elle doit normalement
&ecirc;tre inclue avec votre OS (Unix, Microsoft, VAX,...), elle n'est
pas graphique, il s'agit d'un application qui tourne en mode texte, mais
qui reste tr&egrave;s populaire. Si un jour un lamer vous enoye un mail-bomb,
vous pourrez supprimer tous ses messages en 10 secondes, je pense que je
consacrerais un peu plus tard un article entier sur telnet.
<p>TCP/IP contitue le fondement d'internet. TCP/IP est un ensemble complexe
de protocoles, dont certains sont invisibles pour l'utilisateur.
<p>J'ai un peu repris une partie du livre "S&eacute;curit&eacute; optimale",
aux &eacute;ditions S&amp;SM (<a href="http://www.ssm.fr">http://www.ssm.fr</a>),
pour vous donner des informations correctes, claires et pr&eacute;cises.
Si vous voulez en savoir plus sur le TCP/IP, vous pouvez lire l'ouvrage
Le Macmillan TCP/IP de Karanjit S. Siyan, S&amp;SM.
<br>
<hr WIDTH="100%">
<h3>
<a NAME="3"></a><u>Initiation au Turbo Pascal</u></h3>
Nous allons commencer facilement, &agrave; cr&eacute;er des tous petits
programmes de merde, mais il faut bien commencer par &ccedil;a, ensuite,
&agrave; l'avenir de cet e-zine, je pense qu'on programmera un petit jeu
sympa (il faudra tuer un agent de la DST!)...
<br>Au d&eacute;but (je me met &agrave; votre place pour mieux expliquer),
quand j'ai commenc&eacute; &agrave; programm&eacute; en turbo pascal (&ccedil;a
devait &ecirc;tre en CM2 ou en 6e, je sais plus, et vous vous en foutez),
j'avais lu un bouquin, j'avais compris quelques trucs, mais c'&eacute;tait
pas terrible, j'ai donc relu le livre 3 ou 4 fois, et j'ai commenc&eacute;
&agrave; modifier quelques programmes et enfin, &agrave; cr&eacute;er les
miens, donc si vous voulez vraiment apprendre le turbo pascal (compilateur
DOS disponible en t&eacute;l&eacute;chargement sur mon site), il faudra
faire pareil, "c'est en forgeant que l'on devient forgeron".
<br>Un programme pascal est structur&eacute;, si vous avez d&eacute;j&agrave;
fait du basic, OUBLIEZ TOUT!, sinon, si vous connaissez d&eacute;j&agrave;
un autre langage structur&eacute; (C pour ne citer que lui), &ccedil;a
sera bon. Autrement, si vous n'avez jamais fait de programmation, &ccedil;a
sera un peu plus dur que pour les autres, mais avec de la patience et de
l'acharnement, tu devrais y arriver, tu devras acqu&eacute;rir une certainne
logique (t'en fait pas, j'&eacute;tais pas tr&egrave;s fort en maths).
<br>Le programme le plus simple que l'on puisse faire en pascal est :
<pre>PROGRAM simple;</pre>

<pre>BEGIN</pre>

<pre>END.</pre>
Au contraire du C, le pascal ne fait pas la diff&eacute;rence entre majuscules
et minuscules, si j'ai &eacute;crit les mots program, begin ou end en majuscule,
c'est uniquement pour un probl&egrave;me de lisibili&eacute;.
<br>Le mot simple est un identificateur, il poss&egrave;de quelques r&egrave;gles
tr&egrave;s simples, qui sont chiantes &agrave; relire si on connait d&eacute;j&agrave;
:
<br>- IL NE DOIT PAS COMMENCER PAR UN CHIFFRE : 0,1,2,3,4,5,6,7,8 ou 9
<br>- IL NE DOIT PAS CONTENIR DE CARACTERES SPECIAUX : &amp;&eacute;&egrave;~"#'{([-`\^&ccedil;&agrave;@)]&deg;=+}^&uml;$&pound;&curren;&ugrave;%*&micro;,
....
<br>- IL NE DOIT PAS CONTENIR D'ESPACES
<br>- REMPLACEZ LES ESPACE PAR LE CARACTERE UNDELINE _
<p>Exemples d'identificateurs valides :
<br>simple, dur, la_vie_est_dure, elephant, ...
<br>Exemples d'idetificateurs invalides :
<br>1chien, &eacute;l&eacute;phant, la vie en rose, jean&amp;jacques, ...
<p>Apr&egrave;s le mot cl&eacute; program, nous avons mis l'identificateur
"simple", et termin&eacute; par un ;
<br>on met des point-virgules partout, sauf devant les mot-cl&eacute;s
(exceptions : program, procedure, function, uses, et quelques autres que
je n'ais pas tout de suite en t&ecirc;te, ...)
<br>le end final, et seulement lui, se termine par un point.
<br>Maintenant, on va &eacute;crire une petite phrase tout simple, en respectant
la tradition "Hello, world!" :
<br>&nbsp;
<pre>PROGRAM Hello;</pre>

<pre>BEGIN</pre>

<pre>&nbsp; WriteLn('Hello, world!');</pre>

<pre>END.</pre>
Maintenant, je vais l'expliquer en d&eacute;tail : j'ai &eacute;crit WriteLn,
mais j'aurais tr&egrave;s bien put aussi &eacute;crire writeln ou WRITELN,
ok ? Ensuite, je met le texte entre parenth&egrave;ses et apostrophes,
et si jamais j'avais une apostrophe dans mon texte, je devrais en mettre
deux &agrave; la suite : WriteLn('aujourd''hui');, et je finis par un ;
<br>Comme un exemple vaut toujours mieux qu'un long discours, je continue
:
<pre>PROGRAM LePrenom;</pre>

<pre>VAR</pre>

<pre>&nbsp; prenom : string[30];</pre>

<pre>BEGIN</pre>

<pre>&nbsp; WriteLn('Salut, quel est ton pr&eacute;nom ?');</pre>

<pre>&nbsp; ReadLn(prenom);</pre>

<pre>&nbsp; Writeln('Bonjour, ',prenom);</pre>

<pre>END.</pre>
Pourquoi j'ai &eacute;crit LePrenom devant programme et pas tout simplement
Prenom ? c'est vrai qu'en C &ccedil;a aurait march&eacute; car il fait
la diff&eacute;rence minuscules/majuscules, &ccedil;a aurait donc &eacute;t&eacute;
deux identificateurs diff&eacute;rents, mais pas ici. Var sert &agrave;
d&eacute;clarer les variables, comme le pascal est un langage structur&eacute;,
on doit d&eacute;clarer ses variables avant. Ici, string indique une chaine
de caract&egrave;re ne pouvant pas d&eacute;passer 30 lettre. Si je n'aurais
pas mis [30] apr&egrave;s string, la limite aurait &eacute;t&eacute; de
255 caract&egrave;res,
<br>ReadLn demande de taper la variable et de terminer la saisie avec entr&eacute;e,
pour s&eacute;parer le texte de la variable, on met l'apostophe pour finir
le texte, une virgule, puis, la variable et on referme la parenth&egrave;se
avec son ;
<br>Maintenant, pour finir, je vais vous montrer un programme que va calculer
2 nombres rentr&eacute;s au clavier :
<pre>PROGRAM Nombres;</pre>

<pre>VAR</pre>

<pre>&nbsp; nombre1, nombre2, somme : integer;</pre>

<pre>BEGIN</pre>

<pre>&nbsp; WriteLn('Bonjour, ceci est l'exmple d'un programme simple de calcul...');</pre>

<pre>&nbsp; WriteLn;</pre>

<pre>&nbsp; WriteLn('Veuillez taper un 1e nombre :');</pre>

<pre>&nbsp; ReadLn(nombre1);</pre>

<pre>&nbsp; WriteLn('Veuillez taper un 2e nombre :');</pre>

<pre>&nbsp; ReadLn(nombre2);</pre>

<pre>&nbsp; WriteLn;</pre>

<pre>&nbsp; somme:=nombre1+nombre2;</pre>

<pre>&nbsp; WriteLn('somme de ces nombres : ',somme);</pre>

<pre>END.</pre>
Les variables nombre1, nombre2 et somme sont d&eacute;finies en tant qu'integer,
nombres entiers. De t&ecirc;te, la limite que l'on puisse rentrer est &agrave;
peu pr&egrave;s -32 000 et 32 000, sinon, le programme execute une erreur.
Il permet de calculer des nombres, c'est pour &ccedil;a qu'on aurait pas
mis string ici, il y aurait eu une erreur avant la compilation. Ensuite,
vous pouvez mettre un point-virgule directement apr&egrave;s WriteLn; ce
que saute une ligne automatiquement. Enfin, la ligne la plus int&eacute;ressante
est sans doute somme:=nombre1+nombre2; le := joue le r&ocirc;le d'affectateur,
la somme des deux nombres est affect&eacute; &agrave; la variable somme.
<br>Maitenant, essayez de faire cet exercice, et voyez si le compilateur
ne fait pas d'erreurs, sinon, chercher, c'est comme &ccedil;a que l'on
apprend, moi, j'ai commenc&eacute; par lire un gros bouquin et apr&egrave;s,
je faisait &ccedil;a sur le tas, &ccedil;a m'a permis de faire des jeux
pas trop mal.
<br>Exercice : Le programme demande le nom de la personne, lui demande
d'introduite deux nombres &agrave; soustraire et lui rend la r&eacute;ponse
: "<i>Nom_du_type</i>, tu veux savoit le r&eacute;sultat de <i>nb1</i>
- <i>nb2</i>, eh ben c'est <i>somme</i>"
<br>Les noms mis en <i>italique</i> sont des variables que nous avons d&eacute;j&agrave;
rencontr&eacute;. R&eacute;ponse dans le prochain num&eacute;ro.
<br>
<hr WIDTH="100%">
<h3>
<a NAME="4"></a><u>Initiation au cracking</u></h3>
Il faut avoir un minimum de connaissances en assembleur, connaitre le plus
de fonctions possibles, poss&eacute;der des programmes tels que Win32DASM,
SoftICE (dommage qu'il plante votre PC assez souvent), Turbo debugger (pratique
des fois) et un &eacute;diteur hexad&eacute;cimal pour effectuer les modifications.
Vous n'aurez pas d'exemples pratiques pour aujourd'hui, avalez donc d&eacute;j&agrave;
la th&eacute;orie, il faut passer par l&agrave;.
<br>Bon, par quoi je vais commencer ? d'abord, cracker un programme n'est
pas r&eacute;serv&eacute; aux Yaankees du net ou de la programmation, certes,
il vaut mieux savoir bien programmer. Aussi, si vous voulez cracker du
Visual Basic, arr&ecirc;tez vous ici car c'est un langage qui compil&eacute;
hyper-mal les programmes et donc, le code fait sans arr&ecirc;t appel &agrave;
ces *&ugrave;*^$&uml;%$ de DLL (vbrunxxx, vbxxxxx, ....), et en plus, la
majorit&eacute; des programmes faits en VB sont merdiques, et l'auteur
ne sait pas progarmmer (ou pas beaucoup), on ne pourras rien faire de ce
langage.
<br>Il va donc falloir d&eacute;compiler le programme, c'est &agrave; dire,
le remettre sous sa forme de code source, mais il y a un probl&egrave;me,
si on a &eacute;crit et compil&eacute; son programe avec turbo pascal,
on ne verra pas la source en turbo pascal, mais en assembleur, car le programme
est d&eacute;j&agrave; compil&eacute; et donc, chaque instruction en hexad&eacute;cimal
correspond &agrave; une instruction en assembleur, par exemple, dans un
programme que vous regardez avec votre &eacute;diteur hexad&eacute;cimal,
vous pouvez apper&ccedil;evoir le nombre 90, il correspond &agrave; l'instruction
NOP en assembleur, donc, le debugger ne fait que traduire toutes ces valeurs
en instructions assembleur. Voici quelques instructions assembleurs :
<br>Jne : cette instruction sert &agrave; aller &agrave; un emplacement
quand la valeur est fausse, son code hexad&eacute;cimal est 75.
<br>Je : cette instruction sert &agrave; aller &agrave; un emplacement
quand la valeur est correcte, son code hexad&eacute;cimal est 74.
<br>Jmp : cette instruction est &agrave; aller &agrave; un emplacement
dans tous les cas, son code hexad&eacute;cimal est EB.
<br>donc, dans le code, quand vous verrez :
<br>75xxx&nbsp; Jne xxx, vous vous direz : "Quand la valeur sera fausse,
le programme ira sur xxx, j'ai donc qu'&agrave; remplacer Jne par Je"
<br>C'est bon, vous pourrez faire &ccedil;a, mais le programme calculera
peut &ecirc;tre ici des d&eacute;placements de variables en m&eacute;moire,
et pas forc&eacute;ment le calcul d'un password. Essayez toujours, apr&egrave;s,
avec votre &eacute;diteur hexad&eacute;cimal, recherchez la valeur 75xxx,
et remplacez par 74, car nous avons vu plus haut que 74 correspond &agrave;
Je.
<br>Bon, c'est en fait assez compliqu&eacute; &agrave; expliquer sans exemple,
et j'ai pas trop le temps d'en faire un, alors, je vais mettre un tr&egrave;s
bon exemple, que j'ai demand&eacute; &agrave; un ami, le voici :
<p>Code.exe : Programme tr&egrave;s simple permettant d'apprendre &agrave;
cracker.
<br>A la base, quand on tape 1, le programme &eacute;crit "Bon code" et
pour tout le reste, il &eacute;crit "Mauvais code".
<p>Amusons nous avec un debugger, dans cet exemple, j'utilise Turbo Debugger
pour DOS.
<br>Je rep&egrave;re, assez rapidement dans le programme une comparaison
:
<p>&nbsp; cs:005B 9A91028560&nbsp;&nbsp;&nbsp;&nbsp; call&nbsp;&nbsp; 6085:0291
<br>&nbsp; cs:0060 803E520001&nbsp;&nbsp;&nbsp;&nbsp; cmp&nbsp;&nbsp;&nbsp;
byte ptr [0052],01&nbsp;&nbsp; <font color="#FF0000">&lt;-- ici, comparaison</font>
<br>&nbsp; cs:0065 751E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
jne&nbsp;&nbsp;&nbsp; 0085&nbsp; <font color="#FF0000">&lt;-----------------
ici, saut si faux</font>
<br>&nbsp; cs:0067 BF5401&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
mov&nbsp;&nbsp;&nbsp; di,0154
<br>&nbsp; cs:006A 1E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
push&nbsp;&nbsp; ds
<p>Je me rappelle :
<br>Jne : cette instruction sert &agrave; aller &agrave; un emplacement
quand la valeur est fausse, son code hexad&eacute;cimal est 75
<br>Je : cette instruction sert &agrave; aller &agrave; un emplacement
quand la valeur est correcte, son code hexad&eacute;cimal est 74.
<br>Jmp : cette instruction est &agrave; aller &agrave; un emplacement
dans tous les cas, son code hexad&eacute;cimal est EB.
<p>Il faut donc remplacer 75 (Jne) par 74(Je), ce qui donnera :
<p>&nbsp; cs:005B 9A91028560&nbsp;&nbsp;&nbsp;&nbsp; call&nbsp;&nbsp; 6085:0291
<br>&nbsp; cs:0060 803E520001&nbsp;&nbsp;&nbsp;&nbsp; cmp&nbsp;&nbsp;&nbsp;
byte ptr [0052],01
<br>&nbsp; cs:0065 741E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
je&nbsp;&nbsp;&nbsp; 0085
<br>&nbsp; cs:0067 BF5401&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
mov&nbsp;&nbsp;&nbsp; di,0154
<br>&nbsp; cs:006A 1E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
push&nbsp;&nbsp; ds
<p>avec un &eacute;diteur hexad&eacute;cimal, on cherchera donc :
<br>80 3E 52 00 01 75 1E BF 54 01&nbsp; et on remplace par
<br>-- -- -- -- -- 74 -- -- -- --
<p>Maintenant, quand on tape 2, le programme ‚crira Bon code et quand on
tape 1, le programme &eacute;crit : Mauvais code.
<br>Approfondissons un peu, le programme doit &eacute;crire "Bon code",
que l'on tape 1 ou n'importe quel autre nombre.
<p>Je vais vous montrer une erreur &agrave; &eacute;viter mais qui nous
en apprend :
<p>"Si on remplace jne 0085 par jmp 0085, comme &ccedil;a, il saute tout
de suite sur 0085"
<p>&nbsp; cs:005B 9A91028560&nbsp;&nbsp;&nbsp;&nbsp; call&nbsp;&nbsp; 6085:0291
<br>&nbsp; cs:0060 803E520001&nbsp;&nbsp;&nbsp;&nbsp; cmp&nbsp;&nbsp;&nbsp;
byte ptr [0052],01
<br>&nbsp; cs:0065 EB1E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
jmp&nbsp;&nbsp;&nbsp; 0085&nbsp;&nbsp; <font color="#FF0000">&lt;------------
ici</font>
<br>&nbsp; cs:0067 BF5401&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
mov&nbsp;&nbsp;&nbsp; di,0154
<br>&nbsp; cs:006A 1E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
push&nbsp;&nbsp; ds
<p>avec un &eacute;diteur hexad&eacute;cimal, on cherchera donc :
<br>80 3E 52 00 01 74 1E BF 54 01&nbsp; et on remplace par
<br>-- -- -- -- -- EB -- -- -- --
<p>mais maintenant, tout est mauvais, quoi que l'on tape, eh ben, on r&eacute;fl&eacute;chit
:
<br>"Si le code est faux (Jne), il va &agrave; l'emplacement 0085, &ccedil;a
veux dire que si il est juste, il ne lit pas cette instruction et continue
&agrave; lire la suite du programme"
<br>On dira alors au programme de sauter &agrave; l'instruction juste apr&egrave;s
: 0067
<p>&nbsp; cs:005B 9A91028560&nbsp;&nbsp;&nbsp;&nbsp; call&nbsp;&nbsp; 6085:0291
<br>&nbsp; cs:0060 803E520001&nbsp;&nbsp;&nbsp;&nbsp; cmp&nbsp;&nbsp;&nbsp;
byte ptr [0052],01
<br>&nbsp; cs:0065 EB00&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
jmp&nbsp;&nbsp;&nbsp; 0067
<br>&nbsp; cs:0067 BF5401&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
mov&nbsp;&nbsp;&nbsp; di,0154
<br>&nbsp; cs:006A 1E&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
push&nbsp;&nbsp; ds
<p>avec un &eacute;diteur hexad&eacute;cimal, on cherchera donc :
<br>80 3E 52 00 01 EB 1E BF 54 01&nbsp; et on remplace par
<br>-- -- -- -- -- -- 00 -- -- --
<p>Eh voil&agrave; le travail, maintenant, le programme &eacute;crit "Bon
code", quoi
<br>qu'il arrive. Amusez vous bien.
<p>The yAcC.
<p>Merci The yAcC pour ton exemple, t'es sympa, il permet de bien apprendre
le crack, on fabrique le programme et on le cracke, ce qui permet de tout
voir &eacute;tape par &eacute;tape.
<p>
<hr WIDTH="100%">
<h3>
<a NAME="6"></a><u>Le SE (Social Engeenering)</u></h3>
C'est l&agrave; qu'il faut jouer vos talents de menteur professionnel,
cela va vous permettre d'obtenir des informations sur le mot de passe de
la personne en lui demandant le plus simplement du monde : vous vous fa&icirc;tes
passer pour son webmaster, vous lui demandez tout, mais il est pr&eacute;f&eacute;rable
d'avoir d&eacute;j&agrave; un maximum d'informations sur la personne afin
d'&ecirc;tre plus cr&eacute;dible. Il est aussi vivement conseill&eacute;
d'&eacute;crire une page sur un h&eacute;bergeur gratuit comme http://citeweb.net,
www.multimania.fr, ...
<br>Il faut d'abord avoir un crayon et un papier pour faire du SE, afin
de noter les renseignements qui vous seront fournis, et les votres, car
n'oubliez pas que vous ne serez pas vous pendant une certainne p&eacute;riode.
Le SE exploite la faille principale d'une entreprise : le personnel, on
commence toujours par l&agrave;, apr&egrave;s on s'attaque ailleurs, mais
on commence d'abord par le SE.
<br>Exemple de conversation que j'ai fait avec un fournisseur d'acc&egrave;s
assez connu, afin d'avoir le mot de passe d'un gars :
<br>Je m'&eacute;tais auparavant renseign&eacute; de son login, c'est simple,
c'est ce qu'il y a &eacute;crit sur son adresse e-mail, avant le nom de
son fournisseur, exemple : Dupont@bouboule.com
<dl>
<pre>&lt;MOI> Bonjour, je vous appelle car j'ai perdu la feuille que vous m'aviez envoy&eacute;, et je ne peut plus me connecter...</pre>

<pre>&lt;BOUBOULE.COM> Oui, veuillez me donner votre login.</pre>

<pre>&lt;MOI> Dupont, D.U.P.O.N.T.</pre>

<pre>&lt;BOUBOULE.COM> Attendez, je vous passe le service concern&eacute;</pre>

<pre>... musique ... 5 minutes d'attentes et...</pre>

<pre>&lt;MOI> Oui, je vous appelle car j'ai perdu mon mot de passe</pre>

<pre>&lt;BOUBOULE.COM> Veuillez me donner votre login.</pre>

<pre>&lt;MOI> Dupont, D.U.P.O.N.T.</pre>

<pre>&lt;BOUBOULE.COM> Vous &ecirc;tes monsieur ?</pre>

<pre>&lt;MOI> Jean Dupont</pre>

<pre>&lt;BOUBOULE.COM> Vous avez fait quel type d'enregistrement ?</pre>

<pre>&lt;MOI> Pr&eacute;l&egrave;vement automatique (c'est le plus courant)</pre>

<pre>&lt;BOUBOULE.COM> Veuillez me donner les 5 derniers chiffres de votre carte de cr&eacute;dit.</pre>

<pre>&lt;MOI> (merde), euh... je n'ais pas ma carte sur moi, attendez ... non, elle doit &ecirc;tre en bas.</pre>

<pre>&lt;BOUBOULE.COM> D&eacute;sol&eacute;, je ne peux pas r&eacute;pondre &agrave; votre demande.</pre>

<pre>&lt;MOI> Oui, je comprends, au revoir.</pre>

<pre>J'avais un peu les boules, 1h 30 plus tard, je me d&eacute;cide de rappeller, (je r&eacute;sume l'attente de 5 minutes)</pre>

<pre>&lt;BOUBOULE.COM> alors monsieur Dupont, vous avez retrouv&eacute; votre carte de cr&eacute;dit ?</pre>

<pre>&lt;MOI> (merde encore) oui.</pre>

<pre>&lt;BOUBOULE.COM> Veuillez me donner les 5 derniers num&eacute;ros.</pre>

<pre>&lt;MOI> 5.6.7.8.4. (j'improvise)</pre>

<pre>&lt;BOUBOULE.COM> Ce n'est pas &ccedil;a, mais bon, si ce n'&eacute;tait pas vous, vous n'auriez pas rappell&eacute;, je vais vous donner votre mot de passe :</pre>

<pre>&lt;MOI> oui, allez-y.</pre>

<pre>&lt;BOUBOULE.COM> G.A.G.N.&Eacute;.</pre>
</dl>

<p><br>Eh voil&agrave; le travail, cette technique a bien march&eacute;.
<br>
<hr WIDTH="100%">
<h3>
<a NAME="7"></a><u>Attaque d'un sitez, ma m&eacute;thode, sans SE</u></h3>
Il y a plusieurs m&eacute;thodes, la premi&egrave;re, le SE, mais &ccedil;a
a d&eacute;j&agrave; &eacute;t&eacute; &eacute;voqu&eacute; plus haut.
<br>La deuxi&egrave;me, r&eacute;cupp&eacute;rer le fichier password, qui
se trouve dans le r&eacute;pertoire /etc/passwd du serveur (ftp://ftp.serveur.com)
<br>mais &ccedil;a ne marche pas tout le temps car souvent les sites sont
prot&eacute;g&eacute;s. mais dans le cas contraire, vous devrez avoir deux
types de donn&eacute;es :
<pre>1&deg;) infoman:jJS2NcqXf4h6E:500:100:Utilisateur:/home/infoman:/bin/bash</pre>

<pre>2&deg;) infoman:x:500:100:Utilisateur:/home/infoman:/bin/bash</pre>
Dans le premier cas, il va falloir utiliser un cracker de mots de passe
comme CrackerJack, PaceCrack, QCrack, John the ripper, ... l&agrave;, c'est
facile
<br>Sinon, dans le deuxi&egrave;me cas, le mot de passe crypt&eacute; a
&eacute;t&eacute; remplac&eacute; par un x, donc c'est plus dur (il est
cach&eacute;). Vous pouvez toujours tenter le SE, en relevant l'identifiant
(ici, infoman), et appeller l'entreprise, demander l'administrateur syt&egrave;me,
mais l&agrave;, c'est chaud, car je serais &eacute;tonn&eacute; que l'administrateur
vous donne le mot de passe comme &ccedil;a, ou alors, il est vraiment con.
Il faut donc essayer autrement, et puis j'ai dit : <b>Sans SE</b>.
<br>Vous pouvez r&eacute;cupp&eacute;rer l'utilitaire Unsecure pour windows
(<a href="www.sniperx.net">www.sniperx.net</a>), c'est un programme qui
fait des attaques &agrave; la brute force, ok, c'est la plus longue, mais
la plus efficace et la plus facile (de toutes fa&ccedil;ons, j'aime pas
bien hacker &agrave; l'aide d'utilitaires). Je sais qu'il existe des programmes
en C qui permettent de retrouver ces mots de passe cach&eacute;s par de
x ou *, mais je n'en ais pas ici, sinon, vous pensez bien que je l'aurais
mis, mais &ccedil;a existe, c'est s&ucirc;r.
<p>Cracker un mot de passe est moins compliqu&eacute; que l'on peut imaginer
:
<br>1. La premi&egrave;re &eacute;tape est de prendre une copie du fichier
passwd
<br>2. La seconde &eacute;tape est de trouver le mot de passe, &agrave;
l'aide d'un cracker et d'un g&eacute;n&eacute;rateur de dictionnaire. Les
programmes les plus utilis&eacute;s ici sont : Cracker Jack, John the Ripper,
Brute Force Cracker ou Jack the Ripper
<br>Un g&eacute;n&eacute;rateur de dictionnaire trouve toutes les lettres
possibles avec l'alphabet choisi.
<br>3.Vous lancer le cracker et attendez la r&eacute;ponse qu'il vous donnera
<p>Il existe aussi une technique tr&egrave;s connue, pour avoir le fichier
passwd, il s'agit de la technique PHF :
<br>cette technique ne marche quasiment plus actuellement, car elle est
tr&egrave;s r&eacute;pandue, mais vous pouvez toujours l'essayer, on ne
sait jamais, et puis, qui ne tente rien n'a rien :
<br>remplacez domainecible.com par le site que vous comptez hacker :
<br>http://domainecible.com/cgi-bin/phf?Qalias=x%0a/bin/cat%20/etc/passwd
<p>Aussi, parmis tous les utilisateurs, il y a des privil&egrave;ges, plus
le nombre est petit, plus l'utilisateur &agrave; des privil&egrave;ges,
par exemple, pour infoman, on aper&ccedil;oit le chiffre 500, c'est le
num&eacute;ro de privil&egrave;ge d'infoman, donc, &ccedil;a ne vaudra
pas le coup d'essayer de prendre son compte, il est trop nul, vous devrez
essayer &agrave; tout prit de vous emparer du root ou superuser, lui, son
num&eacute;ro de compte est 0 et il a le droit de tout faire, m&ecirc;me
d'acc&eacute;der aux donn&eacute;es des autres utilisateurs.
<p>Maintenant, si vous essayer de hacker une plus grande page, d'acc&eacute;der
&agrave; des ressources via FTP, &ccedil;a devient vite plus compliqu&eacute;
car le site est prot&eacute;g&eacute;, mais il n'y a aucune s&eacute;curit&eacute;
100 % fiable, toutes les s&eacute;curit&eacute;s peuvent &ecirc;tre perc&eacute;es,
mais si vous essayez d'attaquer le gouvernement, vous allez essayer d'aller
dans le r&eacute;pertoire /etc/passwd, et l&agrave;, soit on vous demande
un mot de passe (que l'on cracke avec un utilitaire de type Claymore),
soit il y a &eacute;crit "/etc/passwd acces denied", mais on verra comment
y acc&eacute;der tout de m&ecirc;me, si je ne dit pas tout maintenant,
c'est parce que je suis en train de finir de d&eacute;vellopper une technique
que je crois avoir trouv&eacute;, mais c'est assez dur, car leur s&eacute;curit&eacute;
est assez bien foutue, r&eacute;sultat des mon enqu&ecirc;te pour le num&eacute;ro
2,3 ou 4, mais je ne suis pas sur d'y arriver, en tout cas, n'oubliez pas
que leur technologie date d'il y a 20 ans et qu'il l'ont presque pas chang&eacute;e
depuis, c'est quand m&ecirc;me assez dur d'y arriver, et en plus, il va
falloir naviguer de fa&ccedil;on anonyme, et il y a de tr&egrave;s grands
risques de vous faire chopper, c'est donc &agrave; vos risques et p&eacute;rils
!!!, par contre, aux States, c'est diff&eacute;rent, car il y a le fbi,
la nasa et leur s&eacute;curit&eacute; est &eacute;poustouflante, essayez
d'aller sur : <a href="ftp://ftp.fbi.gov">ftp.fbi.gov</a>, vous verrez
... aux States, le gouvernement a 250 000 attaques par an, et &agrave;
peu pr&egrave;s 1/2 r&eacute;ussie &agrave; s'infiltrer dans le r&eacute;seau
!!!, faut vraiment &ecirc;tre un dieu pour niquer le fbi, ce que je ne
suis pas.
<br>Et si vraiment vous arrivez &agrave; niquer le gouvernement, vous &ecirc;tes
bien bal&egrave;zes et vous n'avez pas besoin de lire d'e-zines comme celui-ci.
Je vous rappelle que je bosse dans la s&eacute;curit&eacute;, donc, je
vous donnerais quelques trucs int&eacute;ressants au fil du temps, pour
que je puisse continuer &agrave; bosser contre des hackers comme vous,
et comme vous utiliserez mes techniques, je serais vous contre-attaquer,
et donc mon patron sera content de moi :-) = augmentation.
<br>
<hr WIDTH="100%">
<h3>
<a NAME="8"></a><u>Failles de s&eacute;curit&eacute;</u></h3>
Pour trouver une faille de s&eacute;curit&eacute;, il est bon de se procurer
SATAN (pour unix), ce petit programme exploite toutes les failles que peuvent
contenir un syst&egrave;me (<a href="http://www.trouble.org/~zen/satan/satan.html">http://www.trouble.org/~zen/satan/satan.html</a>)
<br>Sinon, si vous avez linux, il faut aller sur le site de Sun (sunsite.unc.edu)
et le r&eacute;cupp&eacute;rer &agrave; /pub/Linux/system/Network/admin/satan-linux.1.1.1.diff.gz
<br>Mais c'est tr&egrave;s difficile, et si vous y arrivez, vous serez
assez bon. C'est juste pour vous dire que de tels utilitaires existent,
je pense parler tr&egrave;s prochainement des failles sp&eacute;cifiques
aux OS (windows, mac, unix, ...)
<br>
<hr WIDTH="100%">
<h3>
<a NAME="9"></a><u>Le nucl&eacute;aire</u></h3>
Les armes nucl&eacute;aires sont des engins explosifs con&ccedil;us pour
produire instantan&eacute;ment une tr&egrave;s grande quantit&eacute; d'&eacute;nergie
nucl&eacute;aire et utilis&eacute;s initialement comme arme de guerre.
<br>Elles servent &agrave; d&eacute;truire de tr&egrave;s grandes superficies,
ce sont des bombes des d&eacute;g&acirc;ts inimaginables.
<br>Exemples : bombe atomique (A), bombe &agrave; hydrog&egrave;ne (H),
bombe fission-fusion-fission...
<br>L'&eacute;nergie est tir&eacute;e de la transformation de noyaux atomiques.
La bombe A obtient sa puissance de la rupture, ou fission, des noyaux des
atomes d'uranium ou de plutonium. Elle produit, pour une sph&egrave;re
de la taille d'une orange une explosion &eacute;quivalente &agrave; la
d&eacute;tonnation de 20 000 t de trinitrotolu&egrave;ne (TNT).
<br>La bombe H a &eacute;t&eacute; mis au point apr&egrave;s la 2nd guerre
mondiale, elle exploite d'&eacute;nergie d'&eacute;l&eacute;ments l&eacute;gers
tels que l'hydrog&egrave;ne. La puissance de ces bombes peuvent aller jusqu'&agrave;
l'&eacute;quivalence d'1 million de tonne de TNT. En plus, les dimensions
de la bombe sont consid&eacute;rablement r&eacute;duites.
<br>Selon la loi de la relativit&eacute; &eacute;tablie par Albert Einstein,
1 kg de mati&egrave;re serait &eacute;quivalent &agrave; l'&eacute;nergie
lib&eacute;r&eacute;e par l'explosion de&nbsp;&nbsp;&nbsp;&nbsp; 22 Mt
de TNT.
<br>Pour ce type d'op&eacute;rations, on utilise les atomes uranium-238,
uranium-235 et la plutonium-239.
<br>Voil&agrave;, c'est tout, je ne veux pas en expliquer trop long, car
apr&egrave;s &ccedil;a devient compliqu&eacute;, cette &eacute;nergie est
tr&egrave;s int&eacute;ressante et tr&egrave;s complexe, ne n'arrive pas
encore &agrave; tout comprendre moi-m&ecirc;me, on verra au fil du temps
diff&eacute;rents explosifs, ce sera plus simple &agrave; expliquer qu'ici,
car j'utiliserais des des exemples pratiques ( :-) ), vous pensez bien
que pour le nucl&eacute;aire on peut pas trop en faire !
<br>
<hr WIDTH="100%">
<h3>
<a NAME="10"></a><u>Le mot de la faim</u></h3>
Voil&agrave;, c'est fini pour aujourd'hui, vous vous appercevrez sans doute
que je n'ais pas d&eacute;vellopp&eacute; tous les sujets, c'est normal,
je tient &agrave; me faire comprendre par les d&eacute;butants, j'ai donc
&eacute;vit&eacute; d'employer du vocabulaire "technique", cela dit, cet
e-zine devient meilleur au fil du temps, nous nous int&eacute;resserons
aux attaques par divers moyens, on fera des exemples tr&egrave;s pratique,
si vous tenez &agrave; &eacute;crire un article, vous pouvez, je vous dirais
si je l'accepte o&ugrave; pas car je veux des articles clairs et de qualit&eacute;,
ce que je ne veux surtout pas, c'est que vous fassiez des articles de lamerz,
comme : apprendre &agrave; se servir d'un nuke, troyen ou mail-boom, ...
<br>Sinon, les articles qui tiennent la route seront accept&eacute;s, et
n'&eacute;kR1v&eacute; p4 kM3 &ccedil;4, c4R s1N0n, 0n p1G3 p@, ok ?
<br>envoyez moi toute remarque, suggestion, critique ou article &agrave;
3D13@usa.net (mais je ne la rel&egrave;ve pas tous les jours, alors patientez
pour la r&eacute;ponse)
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&deg;~-_-~&deg;
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
T&nbsp;&nbsp; o&nbsp; o&nbsp;&nbsp; T
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
^
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
(&nbsp;&nbsp; O&nbsp;&nbsp; )
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
------
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>
I'll be back !</b>
<pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; .-
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; _..-'(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; )`-.._
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ./'. '||\\.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (\_/)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; .//||` .`\.
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ./'.|'.'||||\\|..&nbsp;&nbsp;&nbsp; )o o(&nbsp;&nbsp;&nbsp; ..|//||||`.`|.`\.
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ./'..|'.|| |||||\`````` '`"'` ''''''/||||| ||.`|..`\.
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ./'.||'.|||| ||||||||||||.&nbsp;&nbsp;&nbsp;&nbsp; .|||||||||||| ||||.`||.`\.
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; /'|||'.|||||| ||||||||||||{&nbsp;&nbsp;&nbsp;&nbsp; }|||||||||||| ||||||.`|||`\
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; '.|||'.||||||| ||||||||||||{&nbsp;&nbsp;&nbsp;&nbsp; }|||||||||||| |||||||.`|||.`
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; '.||| ||||||||| |/'&nbsp;&nbsp; ``\||``&nbsp;&nbsp;&nbsp;&nbsp; ''||/''&nbsp;&nbsp; `\| ||||||||| |||.`
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; |/' \./'&nbsp;&nbsp;&nbsp;&nbsp; `\./&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \!|\&nbsp;&nbsp; /|!/&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \./'&nbsp;&nbsp;&nbsp;&nbsp; `\./ `\|
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }' `\ /' `{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp; V
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; `&nbsp;&nbsp;&nbsp; `&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; `&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; '&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; '&nbsp;&nbsp;&nbsp; '</pre>
&nbsp;
</body>
</html>
