<html>
<body bgcolor="#000000" text="#FFFFFF">

<p align="center"><font color="#FF0000"><b>Lamer, Histoire d'un Genre</b></font></p>

<hr>

<p><font size="3">Bon, tout d'abord voici ma premi&egrave;re contribution &agrave; ce mag et qui j'esp&egrave;re ne sera pas la derni&egrave;re !</font></p>

<p>Cet article est un ch'ti &eacute;claircissement sur le terme&nbsp; &quot;lamer&quot;, parce que j'ai remarquer, sur irc, qui &eacute;tait employ&eacute; &agrave; toutes les sauces. Donc j'ai pens&eacute; qu'un article &agrave; ce sujet s'imposait ! Bref, comme d'ab si vous vous r&eacute;agir ou autres choses voici mon mail : <a href="mailto:darkillah@yahoo.fr">darkillah@yahoo.fr</a></p>

<p><hr><br><b>Intro</b><hr></p>

<p>Vous vous demandez sûrement pourquoi parler du terme lamer, et bien tout simplement que votre d&eacute;finition de mot n'est pas forcement la bonne... <br>
En effet le lamer ou le lamah selon les channel et la culture de la personne, est employ&eacute; &agrave; toutes les sauces, pour rabaisser une personne. Mais ces personnes utilisant cet adjectifs p&eacute;joratifs sont souvent dans l'erreur... <br>
C'est en demandant &agrave; plusieurs personnes sur l'irc que j'ai pu voir la confusion qui existe sur ce mot &quot;lamer&quot; qui poss&egrave;de une histoire et une transformations de son sens qui est tr&egrave;s int&eacute;ressantes,&nbsp; j'ai donc d&eacute;cid&eacute; d'en faire un article sur ce sujet qui j'esp&egrave;re vous &eacute;clairciras ! </p>

<p><hr><br><b>1.L'erreur et le genre</b><hr></p>

<p>Bon tout d&#146;abord regardons les diff&eacute;rentes d&eacute;finitions erron&eacute; que certains pirates m'ont confi&eacute;, suivit de mon point de vu sur cette d&eacute;finition:</p>

<p><font color="#FFFF00"><strong>1.Un lamer est un d&eacute;butant en informatiques </strong></font></p>

<p>Alors tout d&#146;abord un d&eacute;butant en informatique se d&eacute;signe sous le nom de newbie et non pas lamer, car ce dernier
est un terme p&eacute;joratif. De plus, on a tous &eacute;t&eacute; un jour newbie et c'est en pers&eacute;v&eacute;rant que nous avons acquis suffisamment de
connaissances pour être reconnu comme hacker, donc un newbie est tr&egrave;s courageux.</p>

<p><font color="#FFFF00"><strong>2.Un lamer c'est un gars qui dit qui que c'est un hackeur (sic) </strong></font></p>

<p>Je pense que comme toutes &quot;organisations&quot;, l'underground poss&egrave;de une hi&eacute;rarchie malgr&eacute; elle, lui permettant de maintenir une certaine forme d'ordre et d'efficacit&eacute;. Car le monde de &quot;tout le monde est &eacute;gaux&quot;, ce ne peut être malheureusement qu'une fantasmagorie, il faut se rendre &agrave; l'&eacute;vidence, l'anarchie &agrave; l'Etat pure est impossible.</p>

<p><font color="#FFFF00"><strong>3.Un lamer est un gars qui utilise des logiciels cod&eacute;s par quelqu'un d'autre pour hacker (sic, mais sans les fautes)</strong></font></p>

<p>Je ne suis pas tout a fait d&#146;accord, car nous voulions un monde vivant de l'open source, et autre paradis de la
programmation, et maintenant on nous dit que c'est une attitude de lamer, faut savoir se que vous voulez les gars!, mais moi j'utilise quelques fois des&nbsp;progz autres que les miens pour parvenir &agrave; mes fins... (souvent les deux en même temps)</p>

<p><font color="#FFFF00"><strong>4.Un lamer c'est un gars (ou meuf) qui nuke (sic)</strong></font></p>

<p>L&agrave; tout d&eacute;pend du contexte, car si vous passez votre tant &agrave; faire ça &agrave; des gens qui vous ont rien fait, vous etes un gros con. Mais si vous l'utiliser pour d&eacute;connecter une personne qui essaie de vous flooder ou autres conneries du genre, vous allez pas rester les bras crois&eacute;s et vous allez vous d&eacute;barrass&eacute; de cet energue humaine.</p>

<p><font color="#FFFF00"><strong>5.Un lamer est une personne qui a windaube (SIC)</strong></font></p>

<p>La faut pas d&eacute;conner, j'ai une partition Windows en plus de ma partition Linux et swap et je ne suis pas le seul ! il faut arrêter de jou&eacute; les rebelZ ou libertaires pour impressionner la galerie, car rappelez vous d'une chose tr&egrave;s importante, ce n'est pas parce que vous avez Linux que vous faites partit de l'&eacute;lite mais sa aide &agrave; le devenir.</p>

<p><font color="#FFFF00"><strong>6.uN L4m3r c 357 Qu3lQuN Qu'3cR17 C0mM3 C4 oU&nbsp; CoMmE cA</strong></font></p>

<p>Les styles d'&eacute;criture font partis du milieu underground depuis des lustres certes sont d&eacute;nu&eacute; de bon sens dans une phrase mais regardez mon nick &quot;DarK_oMeN&quot;, j'utilise l'&eacute;criture alpha-num&eacute;rique pour d&eacute;corer ! </p>

<p><font color="#FF0000" size="4"><strong>Ca suffit pour les exemples et place &agrave; LA d&eacute;finition:</strong></font></p>

<p><strong>Voici deux d&eacute;finitions du mot, elle sont tir&eacute; de madchat.org, </strong></p>

<p>Internaute sans connaissances se faisant passer pour hacker.<br>
Lamer vient du terme ripper, individu qui d&eacute;tourne des portions de progs ou des progs entiers pour sen attribuer les m&eacute;rites. </p>

<p>LAMER Lamer: /n./ [prob. originaire du slang des skateboarders] <br>
Synonyme le luser, peu utilises par les hackers mais commun&eacute;ment
par les warez d00dz, crackers et phreakers. A l&#146;oppose
d`&eacute;lite (3l33t). Apporte la même connotation de conscience de
soi par l&#146;&eacute;litisme qu&#146;un luser a un hacker. Les
crackers utilisent cette expression pour les crackers-wannabee et
dans la culture phreaking, les lamers d&eacute;signent surtout ceux qui
piquent les codes des autres sans trop en comprendre le concept
fondamental. Dans la culture warez d00dz, ou la possibilit&eacute;
d`avoir des logiciels crackes avant même leur sortie officielle
est tr&egrave;s estim&eacute;e, le lamer est celui qui essaye d`uploader du
shareware ou des vieux programmes (dans ce contexte vieux designe
&#145;&#145;lu depuis plusieurs annees&#146;&#146; comme
n`importe quoi qui a plus de trois jours).</p>

<p><strong>Voici mon observation :</strong></p>

<p>Le lamer d&eacute;finissait, &agrave; la base, une personne qui s'attribuait les m&eacute;rites d'un programme qu'il n'avait pas conçus mais juste chang&eacute; quelques octets pour remplacer le nom de l'auteur par le sien et en diffusant son programme un maximum sur les diff&eacute;rents bbs de l'&eacute;poque pour se faire respecter des autres hacker et faire partit de l'Elite. Mais avec les avanc&eacute; technologiques qu'&agrave; subit l'informatique ces derni&egrave;res ann&eacute;es, le terme de lamer fut modifi&eacute; au goût du jour, et est devenu un mot courant utilis&eacute; maladroitement. Le lamer attend que les autres fasse le travaille pour lui et s'attribue les m&eacute;rites. Les lamer sont les principale victime du bust car leurs manque de comp&eacute;tences ou leurs arrogance leurs &agrave; fait du tord, regardez l'affaire Mitnick, son arrogance et sa soudaine c&eacute;l&eacute;brit&eacute; due aux piratage de l'ordinateur de Shimomura ...</p>

<p>Voila, vous savez tout ou du moins ce qu'il faut savoir sur ce terme qui m&eacute;ritait d'être &eacute;claircit.</p>

<p>Si vous avez des questions, <a href="mailto:darkillah@yahoo.fr">darkillah@yahoo.fr</a></p>

<p align="right">-ScienTisT-</p>
</body>
</html>
