<html>
<body bgcolor="#000000" text="#FFFFFF" link="#3366FF" vlink="#FFFF66" alink="#FF0000">

<p align="center"><font color="#CC0000" size="7" face="Comic Sans MS">Le Trashing</font></p>
<hr>
<p>&nbsp;</p>
<p>Me revoilou pour mon troisieme article pour la session 7 du mag. Ce coup ci ça sera le
Trashing, et oui on parle bien des poubelles, donc nous aborderons et assimilerons 
l'Art de fouiller dans les poubelles mais pas n'importe qu'elle poubelles !<br>
Je parle des poubelles des entreprises aussi bien grosses que petites ou se cachent de
nombreuses merveilles qui sont class&eacute; en deux cat&eacute;gories bien discinctes:<br>
- Les tr&eacute;sors : des n° de CB, des listes de password, des pr&eacute;fixes de PaBX, des communiqu&eacute;s
importants et par cons&eacute;quent confidentiels, du matos (rare et lourd)...<br>
- La merde : des tampax usag&eacute;s, des filtres &agrave; caf&eacute;, des mouchoir plein de morves... Enfin
pas la peine de vous faire un dessin...</p>

<p align="center">Voila , on peu comencer &agrave; entamer la partie concrete !</p>

<p align="center"><hr><br>Introduction<br><hr></p>

<p>
Quoi dire de plus mis &agrave; part que le trashing est un Art trop m&eacute;connu et pourtant si efficace...<br>
Il s'allie souvent avec le social enginering pour tir&eacute; &agrave; max des info trouv&eacute; dans les poubelles <br>
(Non, Jean Kevin tu ne trouveras rien dans la poubelle de ta voisine...).<br>
J'expliquerai dans le prochain num&eacute;ro comment jou&eacute; avec les gardes et les cam&eacute;ra, alors
apprenez moi bien tout ca et testez ca et envoyez un mail si vous avez trouv&eacute; des infos</p>

<p align="center"><hr><br>LE MATOS<br><hr></p>

<p>Voici une liste non exaustives de ce que vous avez besoin pour reussir votre trashing :</p>

<p>
- Des sacs de poubelles<br>
- Une lampe torche<br>
- Un pied de biche<br>
- Un ou deux potes (facultatif)<br>
- Des fringues sales et crack&eacute; (pour jouer les clochard si on vous rep&egrave;re)<br>
- Des Talkies-Walkies
</p>

<p>
Voila sa suffira pour un trash classique mais je vous expliquerez plus tard quelques
techniques pour detourner le regard d'un possible gardien ou encore comment se cachez des cam&eacute;ra de
surveillance...
</p>

<p align="center"><hr><br>Reperer sa cible<br><hr></p>

<p>
Les cibles peuvent etre tr&egrave;s divers: sa peut aller de la station service &agrave; la banque en
passant par le supermach&eacute;.<br>
En faite tout d&eacute;pend ce que vous cherchez.... Mais bon, je vous conseil de commencer<br>
par une petite cible sans cam&eacute;ra ni guarde ou autres proc&eacute;d&eacute;s de surveillance qui pour
faire tourner le petit trash &agrave; un v&eacute;ritable cauchemar.... Car il y a des consignes a
respecter car on est jamais trop prudent !<br>
Il ne faut sous AUCUNS pretexte que vous dites que vous avez trasher et faites en sorte que
votre cible soit assez &eacute;loign&eacute; de chez vous donc prenez la voiture ( parce que les sacs
vous allez pas les transport&eacute; &agrave; la main, parce que un c'est lourd et encombrant et deux 
comme discretion y a mieux...). Et demander &agrave; un pote de faire le guet dans la voiture 
pendant que vous prenez<br>
les sacs de poubelles. Et surtout ne rester pas plus de 5 minutes dans la benne, prenez
trois ou quatres sacs et cassez vous ! vous trirez chez vous....
</p>

<p align="center"><hr><br>Le Trashing est r&eacute;ussi<br><hr></p>

<p>Arretez vous dans un champs ou une usine desafect&eacute;. Pourquoi ? Ben pour trier pardi !<br>
Parce que l'odeur noseabonde que d&eacute;gage un ou tous les sacs commence &agrave; vous etre
insupportable (pov' petit).<br>
Donc un chtit triage entre la paperasse et la merde est<br>
indispensable.... Une fois en s&eacute;curit&eacute;e &agrave; l'abris des regards indiscrets, sortez votre
tr&eacute;sor ainsi que les sacs poubelles neuf, videz les sacs et commencer &agrave; class&eacute; dans deux
sacs distincts ce qui vous interresse. Mais pass&eacute; y pas trois heures quand meme, mettez
tous les papiers dans un (c'est c qui nous interresse) et le reste dans l'autre 
(direction la benne la plus proche).<br>
Mais faite attention, car il met arriv&eacute; de trouv&eacute; des montres<br>
un modem 33.6 intact, des souris et claviers.... Donc ouvrez l'oeil !<br>
</p>

<p align="center"><hr><br>Damned ! On m'a rep&eacute;r&eacute; !<br><hr></p>

<p>AIE !!! Vous vous etes fait chopp&eacute; par cet saloperie de gardien qui trainait par hasard
autour de la benne principale, et par malheur tu es dedans. Ce con t'as rep&eacute;r&eacute; ! tu as le 
choix entre 3 m&eacute;thodes:
</p>

<p><font color="#3333FF">
1.Tu te rend<br>
2.Tu lui refait le portrait<br>
3.Tu te tire</font></p>

<p>Alors l&agrave;, moi je te conseil de te rendre ou de te tir&eacute; mais surtout ne le frappe pas
sinon tu es mal !<br>
Si tu decide de te rendre ou qu'il te rattrape pendant tas tentative de fuite, profite du
fait que tu es habill&eacute; comme un clochard, dis lui que tu voulais juste dormir dedans....<br>
En principe il te relachera et te demandera ta carte d'identit&eacute;e, tu ne lui donne surtout 
pas et t'invente un bobard comme tu as l'habithude...et tu sera sauf mais le trashing a foir&eacute; !</p>
<p>Si ce trou du cul ne veux rien savoir et entreprend de t'emmener voir nos amis les flics,
et bien tu nie en bloc s'il te soupçonne d'espionnage et tu renforce le fait que tu n'est 
qu'un clochard (NDC : si ça tourne mal j'aurai plutot tendance a refaire le portrait du mec ... mais bon ...)<br>
mais attention, le d&eacute;tail qui tue : si il sappercoivent que tu sent le dove et l'hugo boss (NDC : apr&eacute;s etre passer dans des poubelles de luxes), ben tu vas
te faire nicker, alors debrouille toi pour que tu ne sente pas bon, c tres important n'empeche.<br>
Une bouteille de pinard pourrait renforcer l'argument du clochard alors ne la n&eacute;glige pas. (NDC : une bouteille de champagne cuv&eacute;e 1956 ça va aussi ?)
</p>

<p>J'allais oublier (puisqu'il faut vraiment tout vous dire): Conservez TOUS les documents 
soigneusement dans un classeur, de maniere &agrave; vous en service pour un possible social enginering....</p>

<p align="center"><hr><br>Conclusion<br><hr></p>

<p align="center">Rappellez-vous: en agissant ainsi, vous contribuez &agrave; diminuer la quantit&eacute;
de d&eacute;chets susceptibles de polluer notre environnement. Donc, votre bonne conscience est 
sauv&eacute;e !! (ouf...)(NDC : si vous vous faites choper vous pouvez aussi dire que vous etes
militant chez greenpeace et que vous vouliez etudier les dechets rejeter par cette entreprise
:p !!!)
</p>

<p>voici mon mail, je compte sur vous pour r&eacute;agir : <a href="mailto:darkillah@yahoo.fr">darkillah@yahoo.fr</a></p>

<p align="right">&eacute;crit par <font color="#FF0000">-ScienTisT-</font> </p>
</body>
</html>
