<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="7" FACE="Comic Sans MS">L'Arnaque du mois</FONT></P>
<P>
<P><FONT SIZE="6" FACE="Comic Sans MS">&quot;Comment je vais me choper une 3dfx&sup2; gratuite ???&quot;</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Je dois pas etre le seul &agrave; me poser cette question, mais pourtant
je dois etre l'un des rare seul &agrave; avoir trouv&eacute; une r&eacute;ponse &agrave; cette question...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Bien sur je ne revendique pas avoir eut l'id&eacute;e mais au moins je peux
affirmer que j'ai pris le risque de l'essay&eacute;e.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Bon si vous suivez &agrave; la lettre ce que je vous dis vous ne risquez
ABSOLUMENT rien...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><BR>
Vous allez aller &agrave; l'hypermarch&eacute; AUCHAN le plus pr&egrave;s de chez vous (ou le plus loin, c'est
comme vous voulez, moi je suis une grosse larve) et vous allez ramasser les tickets de caisses que vous allez trouver
un peu partout, ce qui nous interesse ce sont les num&eacute;ros de cartes bancaires pr&eacute;sentent sur ces
tickets...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Une fois votre petite collec' &eacute;tablie, vous allez rentrer chez vous,
choper un bottin t&eacute;l&eacute;phonique et choper le num&eacute;ro, le nom, pr&eacute;nom et l'addresse d'une
personne habitant suffisament loin pour ne pas pouvoir faire de rapprochement avec vous.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">&ccedil;a y est ?</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Maintenant on va voir vos talents de com&eacute;dien (social engineering,
ou l'art de se faire passer pour ce que l'on n'est pas), demerdez-vous pour savoir dans quoi la personne bosse,
les jours ou elle n'est pas l&agrave; et surtout ses horaires et ceux o&ugrave; la maison est vide.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Une fois toutes ces informations not&eacute;es sur un calepin, apprenez
les...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Le lendemain, prenez le train et rendez vous dans un petit village, &agrave;
peine arriv&eacute; l&agrave; bas dirigez vous au commissariat (juste avant de rentrer appellez la maison de la
veille pour etre sur que personne n'y est) et faites une d&eacute;claration de vol, donnez les renseignements dont
les poulets auront besoin et demandez leurs un r&eacute;cipiss&eacute;.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Reprenez, le train en direction de votre logis et connectez vous &agrave;
Internet.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Commandez votre 3Dfx&sup2; avec les num&eacute;ros de cartes sur les tickets
de caisse AUCHAN (pas de pub)</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Faites vous livrer, sous 24 heures, &agrave; l'addresse qui est not&eacute;e
dans votre calepin...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Dormez bien et mettez votre reveil &agrave; dans 20 heures.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Une fois r&eacute;veill&eacute; et pret &agrave; partir, munissez vous de
votre r&eacute;cipiss&eacute; et LAISSER VOTRE CARTE D'IDENTITE A LA MAISON, &ccedil;a serait con lors d'un controle
de pr&eacute;senter deux pi&egrave;ces diff&eacute;rentes...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Partez attendre DHL devant la maison de l'autre qui est au boulot et d&egrave;s
que vous voyez le coursier arriver, pr&eacute;sentez lui votre r&eacute;cipiss&eacute; et dites lui que vous etes
&agrave; la bourre et que vous devez partir, il vous fera signer son petit truc et vous fouttra la paix.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Il ne vous reste plus qu'&agrave; rentrer chez vous tranquillement et profiter
de votre nouvelle carte 3Dfx&sup2;...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Attention, cette arnaque s'adapte &agrave; tout hardware pourvu qu'il ne
soit pas trop grand...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">J'ai mis l'exemple de la 3Dfx&sup2;, parceque c'est ce que j'ai command&eacute;.</FONT></P>
<P>
<P>
<P ALIGN="RIGHT"><FONT SIZE="5" FACE="Comic Sans MS">Demogorgon999</FONT></P>
<P>
<P ALIGN="CENTER"><A HREF="sommaire.htm"><FONT SIZE="5" FACE="Comic Sans MS">Sommaire</FONT></A>

</BODY>

</HTML>