<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="7" FACE="Comic Sans MS">HACKING</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Le hacking c'est l'art de penetrer dans un ordinateur et d'en devenir &quot;roots&quot;
ou &quot;sysops&quot; c'est &agrave; dire l'&eacute;quivalent du propri&eacute;taire...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Nous n'allons pas commencer les cours tout de suite mais pour comprendre
vous allez devoir tout faire dans l'ordre.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Ce mois nous allons apprendre, par plusieurs techniques, &agrave; chopper
un compte pirate sur AOL et Infonie.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Avec un compte pirate, il devient tr&egrave;s dur pour l'ennemi de vous
chopper si vous vous faites gauler (tr&egrave;s dur mais n&eacute;anmoins pas impossible).</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">______________________________________________Demogorgon999_________</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Vous allez devoir vous connecter &agrave; Internet par un cd de d&eacute;mo
Aol que vous inscrirez &agrave; votre nom mais que vous annulerez &agrave; la fin du mois par une simple lettre.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Ensuite vous allez t&eacute;l&eacute;charger le logiciel &quot;mIRC&quot;
(gratuit) que vous trouverez sans probl&egrave;mes en faisant une recherche dans &quot;</FONT><A HREF="http://www.yahoo.com"><FONT
SIZE="5" FACE="Comic Sans MS">http://www.yahoo.com</FONT></A><FONT SIZE="5" FACE="Comic Sans MS">&quot;, ce logiciel
est en fait un endroit o&ugrave; vous pourrez discuter dans des milliers de forums et que nous &eacute;tudierons
surement lors d'un prochain num&eacute;ro.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Vous devez en fait rentrer dans un salon et demander s'il y a des possesseurs
d'AOL (ou d'Infonie, c'est comme vous voulez) et attendre les r&eacute;ponses.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Si vous recevez des r&eacute;ponses, parlez &agrave; chaque personne individuellement
et demandez leurs:</FONT></P>
<P><FONT SIZE="5" COLOR="#0099FF" FACE="Comic Sans MS">pour AOL</FONT><FONT SIZE="5" FACE="Comic Sans MS">: le
fichier &quot;Main.idx&quot; (qui se trouve dans le dossier &quot;idb&quot; de AOL parceque vous l'avez effac&eacute;
par erreur ou une autre connerie dans le genre.</FONT></P>
<P><FONT SIZE="5" COLOR="#0099FF" FACE="Comic Sans MS">pour Infonie</FONT><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">:
le fichier &quot;Infonie.ini&quot; qui se trouve dans le dossier &quot;Infonie&quot; pour la meme raison stupide.</FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><BR>
Ensuite une fois l'un des deux fichiers r&eacute;cup&eacute;r&eacute;, vous allez devoir vous y prendre de deux
mani&egrave;res diff&eacute;rentes.</FONT></P>
<P><FONT SIZE="5" COLOR="#0099FF" FACE="Comic Sans MS">pour AOL</FONT><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">:
vous allez creer un dossier sur votre ordinateur que vous appellerez Aol H. et vous y d&eacute;poserez VOTRE fichier
&quot;Main.idx&quot;, vous placerez ensuite le fichier &quot;Main.idx&quot; que vous aurez re&ccedil;u &agrave;
la place du votre dans le dossier &quot;idb&quot; de AOL.</FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">Utilisez ensuite le programme &quot;Aolpass&quot; (fournit
dans le dossier &quot;proggys&quot; de cet emag) pour d&eacute;crypter le code et le login de la personne) et vous
aurez votre compte AOL pirate (attention ceci ne marche que si le mec est am&eacute;ricain).</FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><BR>
</FONT><FONT SIZE="5" COLOR="#0099FF" FACE="Comic Sans MS">pour Infonie</FONT><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">:
vous ouvrirez le fichier &quot;Infonie.ini&quot; et vous verrez apparaitre le login et le pass de la personne EN
CLAIR !!!</FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">Prenez un cd de demo Infonie et vous l'installez comme si
vous possediez d&eacute;j&agrave; un compte, tapez le login, le pass et &ccedil;a y est...</FONT></P>
<P><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS"><BR>
Rien ne vous interdit d'utiliser un trojan pour choper ces fichiers et rien ne vous interdit non plus d'utiliser
un g&eacute;n&eacute;rateur de carte de cr&eacute;dit mais vous etes l&agrave; pour apprendre donc je vous aurais
appris dans quels fichiers se trouvent les passwords et login.</FONT></P>
<P>
<P ALIGN="RIGHT"><FONT SIZE="5" COLOR="#FFFFFF" FACE="Comic Sans MS">Demogorgon999</FONT></P>
<P ALIGN="CENTER"><A HREF="sommaire.htm"><FONT SIZE="5" FACE="Comic Sans MS">SOMMAIRE</FONT></A>

</BODY>

</HTML>