<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 1.1 for Windows">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY TEXT="#FFFFFF" BGCOLOR="#000000">

<P ALIGN="CENTER"><FONT SIZE="7" FACE="Comic Sans MS">Phreaking</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Le phreaking c'est l'art de gruger les r&eacute;seau t&eacute;l&eacute;phoniques
et de pouvoir ainsi t&eacute;l&eacute;phoner gratuitement ou autres trucs dans le genre.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Nous allons apprendre ce mois &ccedil;i deux plans de Beige-box.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">La beige box permet &agrave; l'utilisateur de t&eacute;l&eacute;phoner sans
d&eacute;bourser un centime en utilisant la ligne d'une autre personne (la personne sera rembours&eacute;e apr&egrave;s
contestation et France T&eacute;l&eacute;com aura d&eacute;bours&eacute; de sa poche pour vos appels).</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">__________________________________________________F34r F4ct0ry_____</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Pour le premier plan vous allez avoir besoin d' un t&eacute;l&eacute;phone,
de deux pinces crocos et d'un fer &agrave; souder.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><BR>
Prenez le t&eacute;l&eacute;phone et couper le cordon au niveau de la prise murale, vous devriez trouver un fil
bleu, un fil blanc et un fil jaune.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">D&eacute;nudez le fil bleu et le fil blanc car ce sont ceux qui vont nous
interresser.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Soudez une pince croco au fil bleu et une pince croco au fil blanc, &ccedil;a
y est la Beige box est prete...</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Vous allez chercher une maison (de pr&eacute;f&eacute;rence la nuit) et
vous allez tourner autour pour voir ou se trouve le boitier t&eacute;l&eacute;phonique, une fois rep&eacute;r&eacute;
ouvrez le et regardez o&ugrave; se trouve le fil bleu et blanc.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Vous mettez des gants en caoutchouc et vous les sectionnez histoire de placer
votre cordon bleu sur le leur et votre cordon blanc sur le leur aussi, maintenant vous pouvez passer vos coup de
t&eacute;l&eacute;phones c'est France t&eacute;l&eacute;com qui r&eacute;gale !!!</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">__________________________________________________________________</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Pour le secon plan, vous aurez besoin de d&eacute;bourser de l'argent mais
vous aurez besoin de faire beaucoup moins d'efforts.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Il vous faut acheter un t&eacute;l&eacute;phone multicombin&eacute;du papier
cadeau et une victime qui habite &agrave; moins de 200 m&egrave;tres de ches vous.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS"><BR>
Vous allez ensuite apporter le t&eacute;l&eacute;phone multicombin&eacute; chez vous et le brancher car il faut
le regler pour que les combin&eacute;s ait la meme fr&eacute;quence que la base.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Une fois cette &eacute;tape pass&eacute;e vous allez garder l'un des combin&eacute;s
et remettre la base et les autres combin&eacute;s dans leur emballage de fa&ccedil;on &agrave; ce que la personne
ne remarque pas que l'un des combin&eacute;s &agrave; disparut et de fa&ccedil;on &agrave; ce que l'emballage ait
l'air d'etre neuf.</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">Vous l'emballerez ensuite dans du papier cadeau et vous IMPRIMEREZ (surtout
pas &agrave; la main) le nom de la victime sur une carte de voeux (tapez surtout pas votre nom &ccedil;a serait
stupide de vous faire gauler pour &ccedil;a !!!).</FONT></P>
<P><FONT SIZE="5" FACE="Comic Sans MS">D&eacute;poser l&agrave; chez la victime et attendez la nuit pour t&eacute;l&eacute;phoner
GRATUITEMENT l&agrave; ou vous voulez (pour vous connecter &agrave; votre compte pirate AOL si vous voulez !!!).</FONT></P>
<P>
<P ALIGN="RIGHT"><FONT SIZE="6" FACE="Comic Sans MS">F34r F4ct0ry</FONT></P>
<P ALIGN="CENTER"><A HREF="sommaire.htm"><FONT SIZE="6" FACE="Comic Sans MS">Sommaire</FONT></A>

</BODY>

</HTML>