<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>================================================================================</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<FONT SIZE=2>
<P>================================================================================</P>
<P>**************************************  XIII ************************************ Protogyser</P>

<P>&nbsp;</P>
<P>1°) Introduction</P>

<P>2°) Mise en garde</P>

<P>3°) News</P>

<P>4°) Spoofer sur IRC</P>

<P>5°) Ce que vous pouvez faire avec la SUPER GLUE.</P>

<P>6°) Vive  la Fnac.</P>

<P>7°) Vive le Cin&eacute;ma.</P>

<P>8°)  Four11, les r&eacute;v&eacute;lations.</P>

<P>9°) Courrier</P>

<P>10°) Cr&eacute;dits</P>

<P>&nbsp;</P>
<U><P>1. Introduction</P>
</U>
<P>Oui oui je sais, on a un max de retard. Ceci est d&ucirc; au fait que la maquette de XIII num&eacute;ro 3 &eacute;tait sur mon HDD uniquement. Elle &eacute;tait d&eacute;j&agrave; bien avanc&eacute;e, on avait 2 semaines d’avance et PAF&nbsp;! Mon HDD qui p&egrave;te, gardant tout se qui &eacute;tait dessus. En plus, j’avais commenc&eacute; un article sur les commandes de base de l’IRC. Enfin bref, le 3 est sortit est c’est l’essentiel. Par contre, il sera un peu cours. Ce mois-ci un tr&egrave;s bon article sur le spoof venu de Okki. Bon, je vous laisse d&eacute;couvrir ce petit num&eacute;ro.</P>

<U><P>2. Mise en garde.</P>
</U>
<P>Les auteurs de ce e-zine ne pourront en aucuns cas &ecirc;tre tenus responsables de l'utilisation</P>
<P>que pourront faire les lecteurs ayant lu leur(s) article(s). Les articles font r&eacute;f&eacute;rence &agrave; </P>
<P>certain logiciels dont l'utilisation, et m&ecirc;me le t&eacute;lechargement sont interdit par les lois</P>
<P>fran&ccedil;aises en vigueur. Les articles peuvent donner des exemples d'utilisations de logiciels</P>
<P>interdites. Ces articles ne sont l&agrave; qu'a titre informatif.</P>

<P>La r&eacute;daction d&eacute;cline toute responsabilit&eacute; quand aux opinions formul&eacute;es dans les articles, celles-</P>
<P>ci n'engageant que leurs auteurs.</P>

<U><P>3. News</P>

</U><P>Un lecteur va bient&ocirc;t rejoindre notre &eacute;quipe. Il est en train de bosser sur une interface en Visual Basic 5 pour le num&eacute;ro 4 (chht, c’est un secret hein&nbsp;!). Le num&eacute;ro 4 contiendra aussi les pr&eacute;c&eacute;dent num&eacute;ros.</P>

<P>C’est tout pour les news. Ah si&nbsp;! Nous avons recrut&eacute; un &quot;&nbsp;agent charg&eacute; des relations ext&eacute;rieures&nbsp;&quot; avec qui vous pourrez parler sur IRC. Le serveur IRC est irc.funradio.fr, et allez dans le channel #quake-fr. L&agrave;, tapez r&eacute;guli&egrave;rement &quot;&nbsp;##XIII##&nbsp;&quot; et il vous parlera (peut-&ecirc;tre).</P>

<P>Un nouveau virus &agrave; la con est sorti. Vous devez en avoir entendu parler. Il se nomme WIN95.CIH et d&nbsp;&eacute;truit les partitions qui sont sur votre HDD le 26 de chaque mois. Il se transmet par les fichiers .exe infect&eacute;e. Par exemple, si vous avez le virus mais que vous ne le savez pas (ou si vous le savez c’est pareil de toute fa&ccedil;on&nbsp;:-) et que vous ex&eacute;cutez un programme, le virus infecte l’exe. DONC, si ensuite vous envoyez l’exe &agrave; un pote, il aura le virus. Et tout &ccedil;a a <I>vitae eternam. </I>Mais y’a evidemment une parade. T&eacute;lechargez AntiViral Tool Kit Pro sur le site </FONT><A HREF="http://www.avp.com/"><FONT SIZE=2>www.avp.com</FONT></A><FONT SIZE=2> (y’a m&ecirc;me la version fran&ccedil;aise). Cet anti-virus pas mal du tout scannera votre PC et d&eacute;tectera WIN95.CIH m&ecirc;me s’il est dans les fichiers zipp&eacute;s ou les fichiers PAK. Il d&eacute;tecte pleins d’autres virus (a peut pr&egrave;s 30 000). Et comme on est gentil, on a joint le crack a ce num&eacute;ro. Copiez le fichier &quot;&nbsp;avp.key&nbsp;&quot; joint a ce num&eacute;ro dans le dossier o&ugrave; vous avez install&eacute; AVP, et voil&agrave;, vous l’avez en version compl&egrave;te. De rien.&nbsp;;-) </P>

<U><P>4. Spoofer sur IRC</P>
</U>
<P>Salut a tous... et oui, je suis de retour pour ce nouveau numero de XIII</P>
<P>La derniere fois, je vous avez parler des Trojans, ou comment</P>
<P>s'en d&eacute;barasser. Depuis la derniere fois, on m'a rapporter qu'il existait</P>
<P>d'autres m&eacute;thodes, d'autres sortes de Trojans. En attendant d'en apprendre</P>
<P>davantage sur le sujet, je vais vous apprendre une nouvelle mani&egrave;re</P>
<P>de vous prot&eacute;ger sur l'IRC... Et oui, ca ne marche que sur IRC. Mais bon,</P>
<P>c'est la que les attaquent sont les plus faciles en fait. Alors, aujourd'hui</P>
<P>on va apprendre comment modifier son adresse IP, ou plus exactement :</P>
<P>comment changer de netmask sur IRC</P>

<P>Pour commencer, voyons voir de quoi nous aurons besoin :</P>
<P>Il va vous falloir un client IRC pour commencer, ce qui parait logique.</P>
<P>Je vous conseil fortement mIRC 5.31 A ce qu'il parait, ca ne marche pas</P>
<P>avec la version 5.4 de mIRC :( http://www.mirc.co.uk</P>

<P>Ensuite, vous aurez besoin d'un scanner qui cherchera des serveurs WinGate. C'est grace a lui qui vous trouverez des ports 1080 ouverts. Logiquement,</P>
<P>le port 23 peut lui aussi faire office de serveur WinGate. Le bleme</P>
<P>c'est qu'on trouve plein de trucs qui n'ont rien a voir avec WinGate</P>
<P>sur le 23... Pour ma part, j'utilise wGateScan, disponible a l'adresse</P>
<P>suivante : http://web.aurecvideo.fr/pixel/progs/  Histoire d'utiliser</P>
<P>des softs fran&ccedil;ais. Y a pas a dire, on est plutot bon dans ce domaine :)</P>

<P>Attention, avec le scanner wGateScan, et avec surement plein d'autres</P>
<P>scanners, vous avez plusieurs options de recherche. N'utilisez que</P>
<P>"Try to open the port only" Effectivement, on ne demande qu'a trouver</P>
<P>un serveur WinGate, le reste, on s'en fou... et puis, n'oubliez pas</P>
<P>de modifier le port dans la case ad&eacute;quate. Je vous conseil plut&ocirc;t</P>
<P>le port 1080.</P>

<P>Ensuite, ca se corse un peu. Va falloir trouver des adresses IP</P>
<P>qui ont bien un port 1080 ouvert. Si vous en trouvez une, c'est pas dit</P>
<P>que la partie soit gagner. Parfois, il vous faudra tester un bon paquet</P>
<P>d'IP avant d'en trouver une bonne... Pour ce faire, la meilleure solution</P>
<P>est d'aller sur Undernet et de faire un petit /who *ca* pour connaitre</P>
<P>une liste de personnes etant susceptibles d'&ecirc;tres cabl&eacute;es. Les canadiens</P>
<P>le sont g&eacute;n&eacute;ralement. Ce sera plus simple de jouer de la sorte avec eux</P>
<P>du fait qu'ils sont tr&egrave;s souvent connect&eacute;s 24h / 24 Arf</P>

<P>Une fois que vous avez une liste de victimes potentielles, vous entrez</P>
<P>leur IP dans le scanner, et vous lancez la recherche. S'il ne trouve</P>
<P>aucune porte ouverte, essayez une autre adresse IP jusqu'&agrave; ce qu'il</P>
<P>vous donne une liste de serveurs potentiels.</P>

<P>Prenez la premiere adresse IP qu'il vous donne et allez dans mIRC</P>
<P>puis dans File / Setup / Firewall  Cochez la case "Use SOCKS firewall"</P>
<P>entrez votre IP dans Hostname et v&eacute;rifiez que le port est bien 1080</P>
<P>(ou 23, selon lequel vous aurez choisi).</P>

<P>Pour finir, allez dans File puis Disconnect ainsi que Reconnect</P>
<P>Attention, toutes les adresses IP que votre scanner trouvera</P>
<P>ne sont pas forc&eacute;ment bonnes. Si mIRC refuse de se connecter,</P>
<P>trouver une autre adresse IP et r&eacute;essayer. Une derniere chose,</P>
<P>parfois vous aurez l'impression que mIRC a planter. Ne vous inqui&eacute;tez pas</P>
<P>ce n'est pas le cas. Il met un peu de temps mais g&eacute;n&eacute;ralement,</P>
<P>c'est une bonne chose. Si ca a marcher, faites /dns suivi de votre nick</P>
<P>Logiquement, vous devriez voir apparaitre une autre IP que la votre.</P>

<P>L'avantage de choisir une personne cabl&eacute;e, c'est qu'elle a une IP fixe</P>
<P>ce qui vous &eacute;vite de refaire cette manip a chaque fois que vous vous</P>
<P>connecterez sur le net.</P>

<P>Pour conclure cet article, nous allons voir, en quoi il est int&eacute;ressant</P>
<P>de changer de netmask sur IRC. Tout d'abord, ca vous prot&egrave;ge du nuking.</P>
<P>Quand une personne va faire /dns suivi de votre nick, elle n'obtiendra pas</P>
<P>votre r&eacute;elle adresse IP et ne pourra donc pas vous nuker. Mais ce n'est</P>
<P>pas tout. Effectivement, ca vous prot&egrave;ge en partie du banissement.</P>
<P>Lorsque vous vous faites banir d'un channel ou d'un serveur, il vous suffit</P>
<P>de changer &agrave; nouveau de netmask pour pouvoir revenir. Vous n'avez pas besoin</P>
<P>de changer votre nick, mais je vous le conseil fortement. Si l'op&eacute;rateur</P>
<P>qui vous a bani vous voit revenir, sans tarder, il vous banira de nouveau.</P>
<P>Vous pourriez effectivement revenir, faire votre Take Over et vider</P>
<P>la ban list, mais ca, c'est une autre histoire...</P>

<P>Je remercie tout particuli&egrave;rement ChRiS ainsi que CAT2000EC</P>
<P>pour leur aide pr&eacute;cieuse...</P>

<P>                                      Okki</P>
<P>                                     </P>

<U><P>5. Ce que vous pouvez faire avec de la SUPER GLUE</P>
</U>
<P>&nbsp;</P>
<P>(homage &agrave; Phranks)</P>

<P>&nbsp;</P>
<P>- Coller une pi&egrave;ce de 10 francs sur le sol d'un Supermarch&eacute;, &agrave; un endroit ou il y a beaucoup de passage.</P>
<P>- Pour ne plus payer d'horodateur. Enduisez une pi&egrave;ce de 20 centimes, de SUPER GLUE, et introduisez la dans la fente. R&eacute;p&eacute;ter l'op&eacute;ration sur l'ensemble des machines du quartier. Vous pourrez alors contester l'amende, en toute l&eacute;galit&eacute;.</P>
<P>- Dans un super march&eacute;, coller un &agrave; un des embalages plac&eacute;s l'un &agrave; cot&eacute; de l'autre.</P>
<U>
<OL START=6>

<LI>Vive  la Fnac.</LI></OL>


</U><P>La Fnac vous propose de ramener tout achat ne vous convenant pas, dans un d&eacute;lai de 7 jours.</P>
<P>En cas de retour d'une marchandise, soit on vous l'&eacute;change, soit on vous la rembourse.</P>
<P>Ce syst&egrave;me est tr&egrave;s tr&egrave;s avantageux pour le consomateur.</P>
<P>Meme si, comme l'a r&eacute;v&eacute;l&eacute; le VIRUS INFORMATIQUE, la fnac revend pour du neuf, les marchandises raport&eacute;es, en les r&eacute;-embalant.</P>
<P>Je m'explique.</P>

<P>&#9;*(A)* 2 pour 1:</P>
<P>&#9;---------------</P>
<P>&#9;Achetez un des nombreux articles dispos&eacute;s dans l'un des pr&eacute;sentoires de la fnac.</P>
<P>Retournez chez vous , et revenez le lendemain avec le tiket de caisse, mais sans votre article.</P>
<P>Prenez en un identique, dans les rayons.</P>
<P>Et demandez &agrave; vous faire rembourser, ou &agrave; l'&eacute;changer.</P>
<P>Ca marche &agrave; tous les coups.</P>

<P>&#9;*(B)* Louer c'est Mall:</P>
<P>&#9;----------------------</P>
<P>&#9;Pourquoi louer une playstation, un graveur, une t&eacute;l&eacute;, ... pour le week-end ?</P>
<P>Acheter, &agrave; la Fnac, utiliser 6 jours, ramener le tout.</P>

<P>&#9;*(C)* Jean bal:</P>
<P>&#9;---------------</P>
<P>&#9;La Loi oblige tout vendeur &agrave; vous montrer ce que vous achetez.</P>
<P>Lorsque vous achetez un article sous embalage, le vendeur est tenue de vous le d&eacute;baler.</P>
<P>Si par malheur, arrivez chez vous, l'article n'est pas &agrave; l'int&eacute;rieur de la boite, </P>
<P>ramenez la boite, et r&eacute;clamez un &eacute;change.</P>
<P>Ceci vaut pour un disque, un CD-rom, ... enfin tout les truc l&eacute;ger qui p&egrave;se moins lourd que la boite qui les contient.</P>

<P>&nbsp;</P>
<U><P>7. Vive le Cin&eacute;ma</U>.</P>
<U>
</U><P>Le Cin&eacute;ma c'est bien, mais c'est cher. Heureusement, UGC fait des cartes de cin&eacute;ma.</P>
<P>Lorsque vous utiliser la carte pour la premi&egrave;re fois, la date est imprim&eacute;e au dos.</P>
<P>De plus, au fur et &agrave; mesure de son utilisation, le nombre de place utilis&eacute;e, vient s'imprimer au dos de la carte.</P>

<P>&#9;Ainsi, pr&eacute;alablement &agrave; son utilisation, vous devez disposez au dos de la carte, un petit morceau de scotch, &agrave; l'emplacement ou viennent s'imprimer les diff&eacute;rentes informations.</P>

<P>&#9;Une fois la totalit&eacute; des places utilis&eacute;es, ou &agrave; l'&eacute;ch&eacute;ance du terme, retirez le scotch.</P>

<P>&#9;Avant de diposer d'une nouvelle carte, vous devrez effacer la bande magn&eacute;tique plac&eacute;e au dos de la carte (ou la recopier, mais c'est chiant).</P>
<P>Pour cela rien de plus simple. Munissez vous d'un aimant, et passez le plusieurs fois le long de la bande magn&eacute;tique (le mieux dans ce genre &eacute;tant un effaceur de bande).</P>
<P>La aussi, &ccedil;a marche &agrave; tous les coups.</P>

<P>&nbsp;</P>
<U><P>8. Four11, les r&eacute;v&eacute;lations.</P>
</U>
<P>Je sais que &ccedil;a peut paraitre bizare, mais moi je m'amuse avec FOUR11, c'est une sorte de 3611 pour les USA.</P>
<P>En furetant &agrave; droite et &agrave; gauche, j'ai trouv&eacute; des individus surprenant, r&eacute;f&eacute;renc&eacute;s dans cet annuaire, voyez plutot :</P>

<P>* Commen&ccedil;ons par les Extra terrestres, en anglais : "ALIEN"&gt;"NEILA"</P>
<P>-------------------------------------------------------------------</P>

<P> Name &#9;&#9;&#9;Address&#9;&#9;&#9;&#9;&#9;&#9;&#9;Phone&#9;&#9;</P>
<P> Anthony Neila&#9;&#9;110 Carlotta Cir, Mill Valley,CA 94941-2441&#9;&#9;(415)381-1611</P>
<P> David J Neila&#9;&#9;235 Wheeler St #2, Akron,OH 44304-1765&#9;&#9;&#9;(330)374-1331</P>
<P> David &amp; Karen Neila&#9;5764 Eastview Dr, Clinton,OH 44216-9706&#9;&#9;&#9;(330)882-4044</P>
<P> Emina Neila&#9;&#9;2301 Sw 9th St #7, Miami,FL 33135-4945&#9;&#9;&#9;(305)642-5419</P>
<P> James Neila&#9;&#9;4510 Arlen Av, El Paso,TX 79904-1951&#9;&#9;&#9;(915)755-3739</P>
<P> John S Neila&#9;&#9;1767 Tobey Rd, Chamblee,GA 30341-4829&#9;&#9;&#9;(770)451-2258</P>
<P> John S Neila&#9;&#9;4451 Longbow Dr, Titusville,FL 32796-1000&#9;&#9;&#9;(407)267-9725</P>
<P> Nick &amp; N Neila&#9;&#9;908 Sw 5th Ct, Boynton Beach,FL 33426-4712&#9;&#9;(561)738-6745</P>
<P> Nick &amp; Ann Neila&#9;7656 N 2nd Av, Clinton,OH 44216-9105&#9;&#9;&#9;&#9;(330)882-3397</P>
<P> Steve Neila&#9;&#9;Balsam Rd, Greentown,PA 18426&#9;&#9;&#9;&#9;&#9;(717)676-4325</P>

<P>* Continuons avec notre vampire ador&eacute; : "DRACULA"&gt;"ALUCARD"</P>
<P>-----------------------------------------------------------</P>

<P>Name&#9;&#9;&#9;Address&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;Phone</P>
<P> C Alucard&#9;&#9;Tonawanda,NY 14150&#9;&#9;&#9;&#9;&#9;&#9;(716)695-8784</P>
<P> Don Alucard&#9;153 Thierman Ln, Louisville,KY 40207-5053&#9;&#9;&#9;(502)896-0596</P>

<P>&nbsp;</P>
<P>* Il y a aussi, le diable, autrement appel&eacute; le "MALIN"&gt;"NILAM"</P>
<P>-------------------------------------------------------------</P>

<P>Name&#9;&#9;&#9;&#9;Address&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;Phone</P>
<P> Abdul W &amp; Nei Nilam&#9;3230 Hewitt Av #4, Silver Spring,MD 20906-4982&#9;&#9;(301)460-4238</P>
<P> Firoz Nilam&#9;&#9;37 Pleasant Av, Saddle River,NJ 07458-2420&#9;&#9;(201)818-9579</P>
<P> Walter Nilam&#9;&#9;1166 Ridgeley Dr, Campbell,CA 95008-0740&#9;&#9;&#9;(408)377-3474</P>

<P>&nbsp;</P>
<P>* Le diable, est aussi appel&eacute; "SATAN"&gt;"NATAS"</P>
<P>---------------------------------------------</P>

<P> Name&#9;&#9;&#9;Address&#9;&#9;&#9;&#9;&#9;&#9;&#9;Phone</P>
<P> Jan &amp; Paal Natas&#9;365 Nw 46th Ct, Fort Lauderdl,FL 33309-4022&#9;(954)938-0949</P>
<P> Taris &amp; H Natas&#9;2713 Fairmount Av, Atlantic City,NJ 08401-3805&#9;(609)344-0830</P>

<P>* Pour ceux qui revent d'avoir le t&eacute;l&eacute;phone de Bill Gates :</P>
<P>-----------------------------------------------------------</P>

<P>Name&#9;&#9;&#9;Address&#9;&#9;&#9;&#9;&#9;&#9;&#9;Phone</P>
<P> Bill Connard&#9;2418 Streambed Ct, Arlington,TX 76006-6405&#9;(817)640-0205</P>

<P>&nbsp;</P>
<P>&#9;Toutes ces adresses et num&eacute;ros de t&eacute;l&eacute;phones sont authentiques, allez les v&eacute;rifier : http://www.four11.com/</P>

<U><P>&nbsp;</P>
<P>&nbsp;</P>
<P>9. Courrier</P>
</U>
<P>J’ai perdu 2 mails qui &eacute;taient gentillements stock&eacute;s sur mon HDD, mais pour la raison &eacute;nonc&eacute;e dans l’introduction, ils ne pourront pas figurer ici.</P>

<I><P>Salut &agrave; toute l'&eacute;quipe de xiii<BR>
vos e-zine sont g&eacute;niale ( mais un peu court :-((( )<BR>
enfin en ce qui concerne le newbinnage , il faut que vous continuez dans<BR>
cette direction !! car vous &ecirc;tes les seuls qui permette un bon d&eacute;but en<BR>
piratage informatique avec des bon court sur la th&eacute;orie ...<BR>
mais quand j'ai visitez votre site j'ai &eacute;t&eacute; surpris par le compteur ( 52<BR>
visiteurs le 23 aout ) c'est peu pour un ce super e-zine ... :-((( donc<BR>
j'&eacute;ssayerai de vous faire un peu connaitre ( sur les newsgroupe ) essayer<BR>
aussi de mettre votre e-zine un peu partout sur le web ( dans les site<BR>
pirate fran&ccedil;ais !! )<BR>
voila , c'est tout , un petit message pour vous soutenir :-)))<BR>
au faite j'attend toujours le 3 eme e-zine .... ?? il etait pr&eacute;vu le 10 aout<BR>
..<BR>
alors est il sorti ? si oui pouvez vous m'en envoyer un exemplaire ? sinon<BR>
des nouvelles de sa sortie ...<BR>
merci<BR>
bon voila je vous remercie beaucoup et vous r&eacute;&eacute;criverai certainement ...<BR>
@+ nono.s<BR>
<BR>
Ps : pourriez faire un article sur p&eacute;n&eacute;trer un pc grace &agrave; irc ...<BR>
merci<BR>
</P>
</I><P>Salut Nono. Tiens, notre &quot;&nbsp;agent charg&eacute; des relations ext&eacute;rieures&nbsp;&quot; t’a parl&eacute; hier soir &agrave; ce qu’il m’a dit. Cool &ccedil;a, et en plus c’est toi qui va <B>tenter</B> de nous faire une interface en VB5. Cool &ccedil;a, moi &ccedil;a me gonfle les TXT.</P>

<P>Pour le compteur, &ccedil;a veut pas dire grand chose en fait. La plupart des lecteurs r&eacute;cup&egrave;rent le zine sur IRC, Newsgroups voire ICQ. Donc bon. </P>
<P>Et pour le retard, cf. Introduction. L’&quot;&nbsp;agent charg&eacute; des relations ext&eacute;rieures&nbsp;&quot; t’en enverra un d&egrave;s ce soir.</P>

<P>Quand a p&eacute;n&eacute;trer un PC par l’IRC&nbsp;, c’est moyennement possible. Tu peux faire certaines choses comme supprimer les &eacute;crans de veille ou les polices d’&eacute;criture ou pleins d’autres trucs gr&acirc;ce &agrave; Peur De Rien, le script IRC de mon ami NoiZer (salut Noiz, je te send un exemplaire&nbsp;!). Mais sinon, non, impossible de faire se que tu peux faire avec Socket.2.3 avec l’IRC.</P>

<P>&nbsp;</P>
<P><BR>
</P>
<U><P>10. Cr&eacute;dits</P>

</U><P>R&eacute;dacteur en chef&nbsp;: Bob Morane</P>
<P>R&eacute;dacteurs&nbsp;: Okki &amp; Protogyser</P>
<P>Maquetiste&nbsp;: Bob Morane</P>
<P>Agent charg&eacute; des relations ext&eacute;rieures&nbsp;: Fox Scully ou Dana Mulder ou Sculler ou Muldy</P>
<P>Article &quot;&nbsp;Spoofer sur IRC&nbsp;&quot;&nbsp;: Okki</P>
<P>Autres articles&nbsp;: Protogyser</P>
<P>Introduction&nbsp;: Bob Morane</P>
<P>Courrier&nbsp;: Bob Morane </P>
<P>Abonnement : </FONT><A HREF="mailto:xiii@mygale.org"><FONT SIZE=2>xiii@mygale.org</FONT></A></P>
<FONT SIZE=2><P>Publicit&eacute; : nono.s</P>
<P>Responsable site web : Bob Morane</P>
<P>Editeur responsable : on est irresponsables</P></FONT></BODY>
</HTML>
