<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Document sans titre</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#FFFFFF" link="#FFFFFF" vlink="#FFFFFF" alink="#FFFFFF">
<div align="center">
  <h1>Notions de base des r&eacute;seaux TCP/IP</h1>
</div>
<p></p>
<p>A) Notions de base sur les adresses IP par rapport &agrave; Internet</p>
<p> </p>
<p> </p>
<p>L&#8217;Internet est fond&eacute; sur la famille des protocoles TCP/IP. Ces
  protocoles permettent de faire communiquer une des stations d&#8217;un r&eacute;seau
  local avec l&#8217;une des stations d&#8217;un autre r&eacute;seau local se
  trouvant aux Etats Unis ou en Australie ou partout ailleurs. Pour ce faire
  les informations doivent traverser un r&eacute;seau longue distance (WAN, Wide
  Area Network). Ce r&eacute;seau WAN dans notre cas est Internet. Il interconnecte
  des r&eacute;seaux locaux du monde entier. </p>
<p> </p>
<p>De nombreuses entreprises ont organis&eacute; leur r&eacute;seau informatique
  local, national ou international sur le m&ecirc;me principe qu&#8217;Internet,
  on parle alors de r&eacute;seau Intranet. D&#8217;autres entreprises utilisent
  Internet pour interconnecter leur r&eacute;seaux locaux (sans que d&#8217;autres
  utilisateurs puissent se connecter &agrave; ces r&eacute;seaux locaux) en cr&eacute;ant
  un VPN (Virtual Private Network). Dans ce cas on parle d&#8217;Extranet.</p>
<p> </p>
<p>Principe</p>
<p> </p>
<p>Comme cela a &eacute;t&eacute; dit pr&eacute;c&eacute;demment n&#8217;importe
  qu&#8217;elle station d&#8217;un r&eacute;seau local connect&eacute; &agrave; Internet
  peut communiquer avec n&#8217;importe qu&#8217;elle autre station d&#8217;un
  autre r&eacute;seau local connect&eacute; aussi &agrave; Internet. Pour que
  cela puisse se faire (pour que l&#8217;information soit achemin&eacute;e vers
  la station d&eacute;sir&eacute;e), Il faut donc que chaque station soit identifi&eacute;e
  par une adresse qui lui est sp&eacute;cifique (dans notre cas c&#8217;est l&#8217;adresse
  IP). </p>
<p>En fait pour simplifier la gestion du r&eacute;seau Internet et afin d&#8217;&eacute;viter &agrave; Internet
  de conna&icirc;tre toutes les adresses des stations qui sont connect&eacute;es,
  il a &eacute;t&eacute; d&eacute;cid&eacute; qu&#8217;Internet doit se charger
  d&#8217;acheminer l&#8217;information d&#8217;une station vers le r&eacute;seau
  local o&ugrave; se trouve la station destinatrice et c&#8217;est ensuite le
  r&eacute;seau local qui se chargera d&#8217;acheminer l&#8217;information vers
  la bonne station. Pour cela il faut donc que tous les r&eacute;seaux locaux
  connect&eacute;s &agrave; Internet soient identifi&eacute;s par une adresse
  unique (dans notre cas c&#8217;est la &laquo; partie r&eacute;seau &raquo; de
  l&#8217;adresse IP).</p>
<p> </p>
<p>Les diff&eacute;rentes classes d&#8217;adresses IP</p>
<p>L&#8217;Internet est donc un r&eacute;seau bas&eacute; sur un ensemble de
  protocoles : les protocoles de la famille TCP/IP. La version actuelle est nomm&eacute;e
  IPV4 (version 4). </p>
<p>Pour localiser les machines, on fait usage d&#8217;adresses. Ces derni&egrave;res
  sont utilis&eacute;es &agrave; de nombreux niveaux dans les paquets qui transitent
  sur le r&eacute;seau. Les adresses IP sont de la forme suivante : X. Y. Z.
  T o&ugrave; X, Y, Z, et T sont des nombres compris entre 0 et 255 (octets).
  Par exemple, 193. 252. 19. 3 est l&#8217;adresse IP d&#8217;une machine connect&eacute;e
  sur l&#8217;Internet (DNS de Wanadoo). Il faut huit bits pour coder chacun
  des quatre octets constituant une adresse IP. On sait que 0 se code 00000000,
  255 se code 11111111 et 193 se code 1100 0001. </p>
<p>Les adresses IP peuvent donc &ecirc;tre repr&eacute;sent&eacute;es sur 32
  bits. Ces 32 bits sont s&eacute;par&eacute;s en deux zones de bits contigu&euml;s
  : </p>
<p>une partie d&eacute;crit le num&eacute;ro du r&eacute;seau local auquel est
  rattach&eacute; la station, </p>
<p>une partie correspond au num&eacute;ro de la station dans le r&eacute;seau
  local lui-m&ecirc;me, appel&eacute;e num&eacute;ro d&#8217;h&ocirc;te. Dans
  cette derni&egrave;re partie, deux num&eacute;ros sont r&eacute;serv&eacute;s
  : celui o&ugrave; tous les bits sont nuls (on indique ainsi le r&eacute;seau
  lui-m&ecirc;me, une adresse de ce type s&#8217;appelle adresse r&eacute;seau),
  et celui o&ugrave; tous les bits sont &agrave; 1 (on indique alors l&#8217;ensemble
  des machines, une adresse de ce type s&#8217;appelle adresse de diffusion ou
  adresse broadcast). </p>
<p>Selon l&#8217;adresse IP on d&eacute;finit diff&eacute;rentes classes d&#8217;adresses.
  Il existe quatre classes d&#8217;adresses avec la version 4 (version courante)
  des protocoles TCP/IP, car les parties r&eacute;seau et h&ocirc;te n&#8217;ont
  pas toujours la m&ecirc;me taille. D&eacute;taillons donc l&#8217;espace d&#8217;adressage
  d&#8217;IPV4.</p>
<p> </p>
<p>II.1) Les adresses de classe A</p>
<p> </p>
<p>Les adresses de classe A ont une partie r&eacute;seau sur 8 bits, et une partie
  h&ocirc;te sur 24 bits. Leur bit de poids le plus fort est 0, ce qui permet
  de les distinguer des autres classes. </p>
<p> </p>
<p>Elles commencent en 0. 0. 0. 0 et se terminent en 127. 255. 255. 255. Il y
  a donc 128 r&eacute;seaux de classe A, chacun pouvant accueillir th&eacute;oriquement
  jusqu&#8217;&agrave; (224 - 2) h&ocirc;tes (l&#8217;adresse r&eacute;seau et
  l&#8217;adresse de diffusion ne d&eacute;signent pas d&#8217;h&ocirc;te particulier). </p>
<p> </p>
<p> Remarque : </p>
<p>Ces 127 adresses sont d&eacute;j&agrave; toutes r&eacute;serv&eacute;es sur
  l&#8217;Internet</p>
<p>Le r&eacute;seau de classe A d&#8217;adresse 127.0.0.0 est un r&eacute;seau
  fictif interne &agrave; chaque machine : chaque n&#339;ud s&#8217;identifie
  au h&ocirc;te 1 de ce r&eacute;seau, dont l&#8217;adresse IP est 127. 0. 0.
  1, et qu&#8217;on appelle localhost. Pour comprendre cela, rappelons-nous qu&#8217;&agrave; chaque
  interface physique d&#8217;une machine, une carte Ethernet par exemple, est
  associ&eacute;e une adresse IP unique. Souvent, le syst&egrave;me d&#8217;exploitation
  cr&eacute;e une interface virtuelle suppl&eacute;mentaire, appel&eacute;e &laquo; pseudo-interface
  loopback &raquo;, et lui attribue l&#8217;adresse 127.0.0.1. Ainsi, un programme
  cherchant &agrave; s&#8217;adresser, &agrave; l&#8217;aide des protocoles TCP/IP, &agrave; un
  autre programme situ&eacute; sur la m&ecirc;me machine n&#8217;a qu&#8217;&agrave; indiquer
  127.0.0.1 dans le champ destination des datagrammes IP qu&#8217;il g&eacute;n&egrave;re.
  Ces datagrammes ne quitteront pas la machine, car le syst&egrave;me d&#8217;exploitation
  reconna&icirc;tra alors cette adresse comme &eacute;tant celle de son interface
  loopback.</p>
<p>Le r&eacute;seau de classe A d&#8217;adresse 10. 0. 0. 0 est utilis&eacute; pour
  cr&eacute;er des r&eacute;seaux priv&eacute;s. Les paquets d&#8217;informations
  envoy&eacute;s par les stations de ce r&eacute;seau ne sont pas achemin&eacute;s
  (rout&eacute;s) par Internet</p>
<p> </p>
<p> </p>
<p>II.2) Les adresses de classe B</p>
<p> </p>
<p>Les adresses de classe B ont une partie r&eacute;seau sur 16 bits, et une
  partie h&ocirc;te de m&ecirc;me taille. Leurs deux bits de poids forts sont
  10, ce qui permet de les distinguer des autres classes. </p>
<p> </p>
<p>Elles commencent en 128.0. 0. 0 et se terminent en 191. 255. 255. 255. Il
  y a donc 16 384 r&eacute;seaux de classe B, chacun pouvant accueillir jusqu&#8217;&agrave; 65
  534 h&ocirc;tes. Une grande partie de ces 16 384 adresses r&eacute;seaux est
  d&eacute;j&agrave; r&eacute;serv&eacute;e. Pour en obtenir, il faut justifier
  qu&#8217;on s&#8217;appr&ecirc;te &agrave; connecter un r&eacute;seau de tr&egrave;s
  grande envergure &agrave; l&#8217;Internet.</p>
<p> </p>
<p>II.3) Les adresses de classe C</p>
<p> </p>
<p>Les adresses de classe C ont une partie r&eacute;seau sur 24 bits, et une
  partie h&ocirc;te sur 8 bits. Leurs trois bits de poids fort sont 110, ce qui
  permet de les distinguer des autres classes.</p>
<p> </p>
<p>Elles commencent en 192. 0. 0. 0 et se terminent en 223. 255. 255. 255. Il
  y a donc 2 097 152 r&eacute;seaux de classe C, chacun pouvant accueillir jusqu&#8217;&agrave; 254
  h&ocirc;tes. Il reste encore suffisamment de classes C pour pouvoir en distribuer
  encore pendant cinq &agrave; dix ans, d&#8217;apr&egrave;s de r&eacute;centes
  analyses fond&eacute;es sur le taux de croissance estim&eacute; de l&#8217;Internet.</p>
<p> </p>
<p>II.4) Les adresses de classe D</p>
<p> </p>
<p>On les appelle aussi adresses de groupes multicast. Elles commencent en 224.
  0. 0. 0 et se terminent en 239. 255. 255. 255. Ce sont des adresses particuli&egrave;res
  o&ugrave; la notion de r&eacute;seau dispara&icirc;t : elles d&eacute;signent
  non pas un h&ocirc;te particulier, mais un groupe d&#8217;h&ocirc;tes. Tout &eacute;quipement
  d&eacute;sirant faire partie d&#8217;un groupe peut demander &agrave; y adh&eacute;rer
  en pr&eacute;cisant l&#8217;adresse multicast correspondante. A tout moment,
  tout paquet &eacute;mis par une machine quelconque sur l&#8217;Internet, et &agrave; destination
  d&#8217;une adresse multicast particuli&egrave;re, est achemin&eacute; vers
  tous les membres du groupe en question.</p>
<p> </p>
<p>Certaines adresses du groupe sont d&eacute;j&agrave; attribu&eacute;es, en
  voici un &eacute;chantillon :</p>
<p> </p>
<p> </p>
<p> Adresse Nom associ&eacute; Description </p>
<p>224. 0. 0. 0 BASE-ADRESS.MCAST.NET. D&eacute;but des adresses multicast </p>
<p>224. 0. 0. 1 ALL-SYSTEMS.MCAST.NET Toutes les machines </p>
<p>224. 0. 0. 2 ALL-ROUTERS.MCAST.NET Tous les routeurs </p>
<p>224. 0. 0. 12 DHCP-AGENTS.MCAST.NET Agents DHCP </p>
<p>224. 0. 0. 13 PIM-ROUTERS.MCAST.NET Rouleurs multicast supportant PIM </p>
<p> </p>
<p>II.5) Les adresses de classe E</p>
<p> </p>
<p>Les adresses de classe E d&eacute;butent en 240. 0. 0. 0 et se terminent en
  255. 255. 255. 255. Elles sont r&eacute;serv&eacute;es par Iana. Seule 255.
  255. 255. 255 est pour l&#8217;instant attribu&eacute;e, elle d&eacute;signe
  toutes les machines, et est utilis&eacute;e lorsqu&#8217;on a besoin de s&#8217;adresser &agrave; tous
  les &eacute;quipements directement connect&eacute;s &agrave; un m&ecirc;me
  support : un paquet &agrave; destination de cette adresse ne traverse jamais
  les routeurs.</p>
<p> </p>
<p> </p>
<p>Les masques de r&eacute;seau et de sous - r&eacute;seaux</p>
<p>III.1) Les masques de r&eacute;seau</p>
<p> </p>
<p>Pour que le r&eacute;seau Internet puisse router (acheminer) les paquets de
  donn&eacute;es, il faut qu&#8217;il connaisse l&#8217;adresse IP du r&eacute;seau
  local de destination. On a vu pr&eacute;c&eacute;demment qu&#8217;une adresse
  IP est constitu&eacute;e d&#8217;une partie R&eacute;seau et d&#8217;une partie
  Station. </p>
<p>Il faut donc d&eacute;terminer cette adresse r&eacute;seau &agrave; partir
  de l&#8217;adresse IP de destination. Pour cela on utilise le masque de sous
  r&eacute;seau.</p>
<p> </p>
<p>A chaque classe d&#8217;adresses est associ&eacute; un masque de r&eacute;seau,
  ou netmask, qui est constitu&eacute; de 32 bits. Le tableau suivant fournit
  les diff&eacute;rents masques pour les trois classes traditionnelles.</p>
<p> </p>
<p> </p>
<p>Classe Masque </p>
<p>A 255. 0. 0. 0 </p>
<p>B 255. 255. 0. 0 </p>
<p>C 255. 255. 255. 0 </p>
<p> </p>
<p> </p>
<p>Un &laquo; ET &raquo; logique appliqu&eacute; entre le masque de r&eacute;seau
  et l&#8217;adresse IP permet d&#8217;obtenir l&#8217;adresse d&#8217;un r&eacute;seau
  correspondant.</p>
<p> </p>
<p>Calcul de l&#8217;adresse r&eacute;seau en d&eacute;cimal</p>
<p> </p>
<p>@ IP 193 252 19 3 </p>
<p>Masque R&eacute;seau 255 255 255 0 </p>
<p>@ R&eacute;seau 193 252 19 0 </p>
<p> </p>
<p>Calcul de l&#8217;adresse r&eacute;seau en binaire</p>
<p> </p>
<p>@ IP 1100 0001 1111 1100 0001 0011 0000 0011 </p>
<p>Masque R&eacute;seau 1111 1111 1111 1111 1111 1111 0000 0000 </p>
<p>@ R&eacute;seau 1100 0001 1111 1100 0001 0011 0000 0000 </p>
<p> </p>
<p> </p>
<p>Un &laquo; ET &raquo; logique appliqu&eacute; entre le compl&eacute;ment &agrave; 1
  du masque de r&eacute;seau et une adresse IP permet d&#8217;obtenir la partie
  h&ocirc;te correspondante. </p>
<p> </p>
<p>Calcul de l&#8217;adresse h&ocirc;te en d&eacute;cimal</p>
<p> </p>
<p>@ IP 193 252 19 3 </p>
<p>Masque R&eacute;seau 0 0 0 255 </p>
<p>@ H&ocirc;te 0 0 0 3 </p>
<p> </p>
<p>Calcul de l&#8217;adresse h&ocirc;te en binaire</p>
<p> </p>
<p>@ IP 1100 0001 1111 1100 0001 0011 0000 0011 </p>
<p>Masque R&eacute;seau 0000 0000 0000 0000 0000 0000 1111 1111 </p>
<p>@ H&ocirc;te 0000 0000 0000 0000 0000 0000 0000 0011 </p>
<p>Ainsi, &agrave; l&#8217;aide du masque de r&eacute;seau, on peut d&eacute;finir,
  pour toute adresse IP :</p>
<p> </p>
<p>L&#8217;adresse r&eacute;seau associ&eacute;e,</p>
<p> </p>
<p>La partie h&ocirc;te associ&eacute;e,</p>
<p> </p>
<p>L&#8217;adresse de diffusion associ&eacute;e qui d&eacute;signe tous les h&ocirc;tes
  de ce r&eacute;seau.</p>
<p> </p>
<p>Le tableau suivant fournit ces informations pour trois adresses IP prises
  parmi les trois classes fondamentales.</p>
<p> </p>
<p> </p>
<p>Adresse IP 10. 25. 2. 5 172. 17. 5. 8 192. 168. 53. 24 </p>
<p>Classe A B C </p>
<p>Masque de r&eacute;seau 255. 0. 0. 0 255. 255. 0. 0 255. 255. 255. 0 </p>
<p>Adresse de r&eacute;seau 10. 0. 0. 0 172. 17. 0. 0 192. 168. 53. 0 </p>
<p>Adresse de diffusion 10. 255. 255. 255 172. 17. 255. 255 192. 168. 53. 255 </p>
<p>Compl&eacute;ment &agrave; 1 du masque 0.255.255.255 0.0.255.255 0.0.0.255 </p>
<p>Partie h&ocirc;te de l&#8217;adresse 0.25.2.5 0.0.5.8 0.0.0.24 </p>
<p> </p>
<p> </p>
<p>III.2) Les masques de sous - r&eacute;seaux</p>
<p> </p>
<p>Parfois, on est amen&eacute; &agrave; r&eacute;partir les adresses IP d&#8217;un
  m&ecirc;me r&eacute;seau de classe A, B ou C sur plusieurs supports physiques.
  En effet, si on dispose d&#8217;une cinquantaine de machines, &agrave; r&eacute;partir
  sur trois r&eacute;seaux Ethernet par exemple, notre fournisseur ne va pas
  nous offrir trois r&eacute;seaux de classe C : une seule classe C peut d&eacute;j&agrave; accueillir
  254 machines.</p>
<p> </p>
<p>Pour r&eacute;soudre ce probl&egrave;me, il faut introduire un nouveau type
  de masque : le masque de sous - r&eacute;seaux.</p>
<p> </p>
<p>Le principe est simple : le r&eacute;seau est d&eacute;coup&eacute; en sous
  - r&eacute;seaux de m&ecirc;me taille. Pour cela, la partie h&ocirc;te des
  adresses est elle-m&ecirc;me d&eacute;coup&eacute;e en deux plages de bits
  :</p>
<p> </p>
<p>la plage des bit de poids forts correspond aux bits identifiant les sous r&eacute;seaux</p>
<p> </p>
<p>l&#8217;autre plage d&eacute;signe le num&eacute;ro de machine dans le sous
  r&eacute;seau. </p>
<p> </p>
<p>Dans le masque de sous r&eacute;seau, les bits correspondant aux bits des
  sous r&eacute;seaux sont positionn&eacute;s &agrave; 1</p>
<p> </p>
<p>Pour trouver le sous - r&eacute;seau auquel appartient un &eacute;quipement,
  il suffit donc d&#8217;appliquer un &laquo; ET &raquo; logique entre son adresse
  IP et le masque de sous - r&eacute;seaux.</p>
<p> </p>
<p>Parmi les num&eacute;ros de sous - r&eacute;seaux ainsi cr&eacute;&eacute;s,
  deux sont interdits d&#8217;utilisation : </p>
<p>le sous - r&eacute;seau 0 qui serait confondu avec l&#8217;adresse du r&eacute;seau</p>
<p> </p>
<p>et le sous - r&eacute;seau o&ugrave; tous les bits sont &agrave; 1, car l&#8217;adresse
  de diffusion de ce sous-r&eacute;seau serait confondue avec l&#8217;adresse
  de diffusion du r&eacute;seau.</p>
<p> </p>
<p>On perd donc d&#8217;entr&eacute;e de jeu deux adresses de sous - r&eacute;seaux. </p>
<p>Application</p>
<p> </p>
<p> </p>
<p>Exemple :</p>
<p>Une soci&eacute;t&eacute; a obtenu une adresse r&eacute;seau de classe C pour
  pouvoir connecter son r&eacute;seau sur Internet. Cette soci&eacute;t&eacute; poss&egrave;de
  3 succursales (une &agrave; Melun, une &agrave; Combs et une &agrave; la Rochette)
  qui doivent pouvoir communiquer entre elles &agrave; travers les r&eacute;seaux
  publics (WAN).</p>
<p> </p>
<p> </p>
<p> </p>
<p>L&#8217;adresse Internet de cette soci&eacute;t&eacute; est 195.18. 37. 0.
  C&#8217;est donc une adresse de classe C.</p>
<p>On peut voir sur le sch&eacute;ma qu&#8217;il y a 6 sous-r&eacute;seaux (3
  r&eacute;seaux locaux et 3 &agrave; travers le r&eacute;seau WAN).</p>
<p> </p>
<p>D&eacute;termination des adresses de sous r&eacute;seaux </p>
<p>&Eacute;tant donn&eacute; qu&#8217;il y a 6 sous r&eacute;seaux &agrave; adresser,
  nous devons donc choisir un nombre de bit pouvant coder 6 + 2 r&eacute;seaux
  = 8, soit 3 bit. En effet, dans un plan d&#8217;adressage, il ne faut pas oublier
  de compter les 2 r&eacute;seaux que l&#8217;on n&#8217;a pas le droit d&#8217;utiliser.
  (Voir paragraphe pr&eacute;c&eacute;dent.)</p>
<p> </p>
<p> Ces 3 bit sont pris sur les bit de poids fort de la partie station de l&#8217;adresse
  Internet.</p>
<p> </p>
<p> </p>
<p>Partie r&eacute;seau de l&#8217;adresse Internet Partie station </p>
<p>195 18 37 0 </p>
<p>1100 0011 0001 0010 0010 0101 0000 0000 </p>
<p>1100 0011 0001 0010 0010 0101 XXX0 0000 </p>
<p> </p>
<p> </p>
<p>avec ces 3 bit on peut obtenir les combinaisons suivantes :</p>
<p>000 Cette combinaison est inutilisable puisque identique &agrave; l&#8217;adresse
  r&eacute;seau globale</p>
<p>001 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau local
  de Melun</p>
<p>010 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau local
  de Combs</p>
<p>011 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau local
  de La Rochette</p>
<p>100 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau WAN
  entre Internet et Melun</p>
<p>101 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau WAN
  entre Combs et Melun</p>
<p>110 Cette combinaison sera utilis&eacute;e pour coder le r&eacute;seau WAN
  entre La Rochette et Melun</p>
<p>111 Cette combinaison est inutilisable puisque identique &agrave; l&#8217;adresse
  de diffusion globale</p>
<p> </p>
<p>Ceci nous permet de remplir les adresses de sous r&eacute;seaux dans le tableau.
  Pour les adresses de diffusion il suffit de mettre les 5 bit restants de la
  partie station &agrave; 1. Pour le masque de sous r&eacute;seau, il suffit
  de mettre les bit de la partie r&eacute;seau et sous r&eacute;seau &agrave; 1
  et les autres &agrave; 0 :</p>
<p> 1111 1111 &#8211; 1111 1111 &#8211; 1111 1111 - 1110 0000 = 255.255.255.224</p>
<p> </p>
<p> </p>
<p> </p>
<p>num&eacute;ro adresse du </p>
<p>sous - r&eacute;seau masque de </p>
<p>sous - r&eacute;seau adresse de diffusion plage fonction </p>
<p>0 195. 18. 37. 0 Ne pas utiliser </p>
<p>1 195. 18. 37. 32 255. 255. 255. 224 195. 18. 37. 63 195. 18. 37. 33 &agrave; 195.
  18. 37. 62 LAN de Melun </p>
<p>2 195. 18. 37. 64 255. 255. 255. 224 195. 18. 37. 95 195. 18. 37. 65 &agrave; 195.
  18. 37. 94 LAN de Combs </p>
<p>3 195. 18. 37. 96 255. 255. 255. 224 195. 18. 37. 127 195. 18. 37. 97 &agrave; 195.
  18. 37. 126 LAN de la Rochette </p>
<p>4 195. 18. 37. 128 255. 255. 255. 224 195. 18. 37. 159 195. 18. 37. 129 &agrave; 195.
  18. 37. 158 WAN Melun-Internet </p>
<p>5 195. 18. 37. 160 255. 255. 255. 224 195. 18. 37. 191 195. 18. 37. 161 &agrave; 195.
  18. 37. 190 WAN Melun-Combs </p>
<p>6 195. 18. 37. 192 255. 255. 255. 224 195. 18. 37. 223 195. 18. 37. 193 &agrave; 195.
  18. 37. 222 WAN Melun-La Rochette </p>
<p>7 195. 18. 37. 224 195. 18. 37. 255 Ne pas utiliser </p>
<p>L&#8217;attribution des adresses IP</p>
<p> </p>
<p>Comme toutes les ressources num&eacute;riques de l&#8217;Internet, l&#8217;espace
  d&#8217;adressage IPV4 est g&eacute;r&eacute; par Iana. Dans un but de d&eacute;localisation
  de la t&acirc;che d&#8217;attribution des classes d&#8217;adresses IP, Iana
  a d&eacute;l&eacute;gu&eacute; les plages d&#8217;adresses &agrave; diff&eacute;rents
  organismes. Pour obtenir une classe d&#8217;adresses, il faut contacter l&#8217;organisme
  qui fait g&eacute;ographiquement comp&eacute;tence. Le plan d&#8217;adressage
  actuel est d&eacute;crit dans le tableau suivant. </p>
<p>RIPE (R&eacute;seaux IP Europ&eacute;ens) est l&#8217;organisme comp&eacute;tent
  en Europe. APNIC g&egrave;re la zone Asie - Pacifique. L&#8217;InterNIC g&egrave;re
  de nombreuses zones g&eacute;ographiques, notamment l&#8217;Am&eacute;rique,
  et il existe plusieurs autres organismes auxquels Iana a d&eacute;l&eacute;gu&eacute; une
  partie de l&#8217;espace d&#8217;adressage. Ces diff&eacute;rents registres
  Internet d&eacute;l&egrave;guent parfois &agrave; leur tour &agrave; d&#8217;autres
  entit&eacute;s locales. Par exemple, le NIC-France (g&eacute;r&eacute; par
  l&#8217;Inria) s&#8217;est occup&eacute; pendant une p&eacute;riode d&#8217;attribuer
  des classes d&#8217;adresses aux organismes d&eacute;sireux de se connecter &agrave; l&#8217;Internet
  depuis la France.</p>
<p> </p>
<p> </p>
<p> </p>
<p>Bloc d&#8217;adresses Registre obtenant la d&eacute;l&eacute;gation Date de
  d&eacute;l&eacute;gation </p>
<p>000-063 Iana Septembre 81 </p>
<p>064-095 Iana - R&eacute;serv&eacute; Septembre 81 </p>
<p>096-126 Iana - R&eacute;serv&eacute; Septembre 81 </p>
<p>127 Iana Septembre 81 </p>
<p>128-191 Diff&eacute;rents registres Mai 93 </p>
<p>192-193 Diff&eacute;rents registres Mai 93 </p>
<p>194-195 RIPE NCC - Europe Mai 93 </p>
<p>196-197 InterNIC Mai 93 </p>
<p>198-199 InterNIC Am&eacute;rique Centrale et du Sud Mai 93 </p>
<p>200- 201 APNIC - Pacifique Mai 93 </p>
<p>204-205 InterNIC - Am&eacute;rique du Nord Mars 94 </p>
<p>206 InterNIC - Am&eacute;rique du Nord Avril 95 </p>
<p>207 InterNIC - Am&eacute;rique du Nord Novembre 95 </p>
<p>208 InterNIC - Am&eacute;rique du Nord Avril 96 </p>
<p>209 InterNIC - Am&eacute;rique du Nord Juin 96 </p>
<p>210 APNIC - Pacifique Juin 96 </p>
<p>211 APNIC - Pacifique Juin 96 </p>
<p>212-223 Iana - R&eacute;serv&eacute; Septembre 81 </p>
<p>224-239 Iana - Muticast Septembre 81 </p>
<p>240-255 Iana - R&eacute;serv&eacute; Septembre 81 </p>
<p> </p>
<p> </p>
<p>Attribution d&#8217;un r&eacute;seau de classe A, B ou C</p>
<p> </p>
<p>En France, ce sont les fournisseurs qui g&egrave;rent ce service, chacun disposant
  d&#8217;un ensemble de classes C qui lui ont &eacute;t&eacute; d&eacute;l&eacute;gu&eacute;es
  par RIPE, ou par NIC-France. Ainsi, c&#8217;est au fournisseur d&#8217;attribuer
  une ou plusieurs classes C. Celui qui d&eacute;sire une classe B doit s&#8217;adresser
  directement &agrave; RIPE ou &agrave; L&#8217;InterNIC, et fournir un dossier
  justifiant sa demande. Personne ne peut obtenir de classe A, elles ont toutes
  d&eacute;j&agrave; &eacute;t&eacute; d&eacute;l&eacute;gu&eacute;es.</p>
<p>Lorsqu&#8217;un client utilisant des adresses attribu&eacute;es par un fournisseur
  d&eacute;cide de r&eacute;silier son abonnement pour se connecter chez un concurrent,
  il doit rendre ces adresses et renum&eacute;roter son r&eacute;seau avec de
  nouvelles adresses fournies par le nouveau fournisseur. Cette op&eacute;ration
  est parfois complexe et co&ucirc;teuse mais est impos&eacute;e pour des raisons
  techniques, notamment pour juguler l&#8217;explosion des tables de routage
  des routeurs des fournisseurs du monde entier.</p>
<p>B) Internet et les protocoles.</p>
<p>Un peu d&#8217;histoire...</p>
<p>Le protocole TCP/IP a &eacute;t&eacute; mis au point dans le cadre du projet
  ARPA au d&eacute;but des ann&eacute;es 1980. Bien que sa structure ne lui permette
  pas de s&#8217;int&eacute;grer dans le mod&egrave;le OSI, il est devenu un
  standard de fait li&eacute; &agrave; la croissance du syst&egrave;me Unix.
  Il est le pr&eacute;curseur des mod&egrave;les organis&eacute;s en couches
  et ses protocoles englobent l&#8217;ensemble complet des fonctionnalit&eacute;s
  attendues dans toutes les couches OSI, de la d&eacute;finition des trames transmises
  sur le r&eacute;seau jusqu&#8217;aux applicatifs utilisateurs du type &eacute;mulation
  de terminal ou transfert de fichiers.</p>
<p> </p>
<p> </p>
<p> </p>
<p>I) Pr&eacute;sentation rapide des diff&eacute;rents protocoles.</p>
<p> </p>
<p>I.1) Le protocole de r&eacute;solution des adresses ARP :</p>
<p> </p>
<p>Le protocole ARP (Address Resolution Protocol) est un m&eacute;canisme de
  traduction dynamique d&#8217;adresse impl&eacute;ment&eacute; au niveau liaison.
  Il est utilis&eacute; pour traduire des adresses de type INTERNET sur 32 bits
  en adresses ETHERNET sur 48 bits. ARP se pr&eacute;sente comme un service qui
  g&egrave;re des tables de correspondance d&#8217;adresses et r&eacute;pond &agrave; des
  requ&ecirc;tes d&#8217;identification. Lorsqu&#8217;il re&ccedil;oit une requ&ecirc;te,
  il cr&eacute;e un message qui est ensuite diffus&eacute; sur le r&eacute;seau
  en attente d&#8217;une r&eacute;ponse positive de la part d&#8217;une des machines
  connect&eacute;es. La r&eacute;ception de la r&eacute;ponse est assortie d&#8217;une
  temporisation. Une r&eacute;ponse positive provoque une mise &agrave; jour
  par ARP de ses tables de traduction d&#8217;adresses.</p>
<p>Autrement dit lorsqu&#8217;un &eacute;quipement A veut envoyer un datagramme
  IP &agrave; un &eacute;quipement B qui est connect&eacute; sur le m&ecirc;me
  support, il doit l&#8217;encapsuler dans une trame de la couche MAC (802.3
  par exemple). Le probl&egrave;me est que A ne conna&icirc;t &agrave; priori
  que l&#8217;adresse IP de B et ne conna&icirc;t pas l&#8217;adresse MAC de
  B. Il faut donc un protocole qui permette d&#8217;&eacute;tablir un lien entre
  l&#8217;adresse MAC d&#8217;un &eacute;quipement et son adresse IP. C&#8217;est
  le r&ocirc;le du protocole ARP. Exemple :</p>
<p>L&#8217;&eacute;quipement A conna&icirc;t l&#8217;adresse IP de B et veut
  lui faire parvenir un datagramme IP.</p>
<p>L&#8217;&eacute;quipement A envoie donc, sur le support, une trame MAC de
  diffusion contenant dans son champ information l&#8217;adresse IP de B.</p>
<p>Tous les &eacute;quipements connect&eacute;s sur le support d&eacute;codent
  cette trame, et compare l&#8217;adresse IP contenue dans le champ information &agrave; leur
  propre adresse IP.</p>
<p>L&#8217;&eacute;quipement B reconna&icirc;t ainsi son adresse IP et renvoie &agrave; A
  une trame ARP pour lui indiquer son adresse MAC.</p>
<p>L&#8217;&eacute;quipement A conna&icirc;t ainsi l&#8217;adresse MAC de B et
  peut ainsi construire une trame avec l&#8217;adresse MAC de B, et encapsuler
  le datagramme IP destiner &agrave; B</p>
<p>I.2) Le protocole IP :</p>
<p> </p>
<p>Le protocole Internet est responsable de l&#8217;adressage et du routage entre
  machines, du cheminement des paquets de donn&eacute;es dans le r&eacute;seau,
  de la constitution et du r&eacute;assemblage des paquets. Les fonctionnalit&eacute;s
  assur&eacute;es par IP peuvent se d&eacute;duire de l&#8217;examen de l&#8217;en-t&ecirc;te
  du paquet. Il identifie entre autres la source et la destination du paquet
  et comporte des identificateurs de fragmentation.</p>
<p> </p>
<p>I.3) Le protocole UDP :</p>
<p> </p>
<p>Le protocole UDP (User Datagram Protocol) est un protocole de transmission
  de datagrammes sur le r&eacute;seau qui fournit de mani&egrave;re optionnelle
  un certain nombre de contr&ocirc;les. Un datagramme est un paquet de donn&eacute;es
  consid&eacute;r&eacute; comme une entit&eacute; isol&eacute;e et ind&eacute;pendante,
  c&#8217;est-&agrave;-dire qu&#8217;il comporte dans son en-t&ecirc;te toutes
  les informations n&eacute;cessaires &agrave; son acheminement &agrave; travers
  le r&eacute;seau jusqu&#8217;&agrave; son destinataire.</p>
<p> </p>
<p>La transmission de paquets composant le message est donc assur&eacute;e de
  mani&egrave;re totalement ind&eacute;pendante pour chaque paquet. On pourrait,
  dans une certaine mesure, comparer ce type de service au service postal qui
  prend en charge les messages et assure leur transport &agrave; destination
  mais sans garantir le chemin parcouru par chaque message, ni le temps mis pour
  le parcourir, ni &agrave; fortiori le respect d&#8217;une s&eacute;quentialit&eacute; dans
  la d&eacute;livrance des messages. </p>
<p>De plus, en ce qui concerne UDP, un paquet peut &ecirc;tre retransmis plusieurs
  fois en fonction des diff&eacute;rents temporisateurs du r&eacute;seau. Une
  en-t&ecirc;te UDP contient un nombre limit&eacute; d&#8217;informations. On
  y trouve :</p>
<p> </p>
<p>Les adresses origine et destination</p>
<p>La longueur du datagramme</p>
<p>Une zone de contr&ocirc;le d&#8217;erreurs</p>
<p> </p>
<p>Pour envoyer un datagramme, le syst&egrave;me doit donc, tout d&#8217;abord,
  en utilisant les primitives ad&eacute;quates, renseigner l&#8217;adresse et
  le num&eacute;ro port de destination. Ces informations sont connues dans les
  tables syst&egrave;me.</p>
<p> </p>
<p>I.4) Le protocole TCP :</p>
<p> </p>
<p>Le protocole TCP est le protocole majeur de toute l&#8217;architecture INTERNET.
  C&#8217;est un protocole qui fonctionne en mode connect&eacute;. Il dispose
  d&#8217;un ensemble de fonctionnalit&eacute;s. En voici quelques unes :</p>
<p> </p>
<p>Identification pr&eacute;cise de l&#8217;&eacute;metteur et du destinataire</p>
<p>Gestion des accus&eacute;s de r&eacute;ception</p>
<p>D&eacute;livrance de donn&eacute;es fiable, s&eacute;quentielle et sans duplication</p>
<p>M&eacute;canisme de contr&ocirc;le de flux</p>
<p>Connexions passives et actives</p>
<p>Multiplexage (plusieurs connexions simultan&eacute;es sur un m&ecirc;me support).</p>
<p> </p>
<p>C&#8217;est un protocole beaucoup plus complexe qu&#8217;UDP, il se charge,
  entre autres, de remettre en ordre, avant leur d&eacute;livrance, les paquets
  qui lui parviennent.</p>
<p> </p>
<p>Une fonctionnalit&eacute; importante est sa facult&eacute; de traiter les
  messages hors norme (out of band data). Ils correspondent &agrave; une notion
  d&#8217;urgence au niveau des donn&eacute;es et de leur d&eacute;livrance,
  impl&eacute;ment&eacute;e dans le protocole TCP. Une donn&eacute;e urgente
  doit &ecirc;tre transmise en dehors de toute s&eacute;quentialit&eacute; par
  rapport au flux de transmission normal des donn&eacute;es. Ces messages sont
  ins&eacute;r&eacute;s dans le flux de propagation normal et enti&egrave;rement
  g&eacute;r&eacute;s par le protocole. Ils ne sont pas conserv&eacute;s au niveau
  utilisateur. Cette impl&eacute;mentation permet &agrave; TCP de g&eacute;rer
  simultan&eacute;ment la transmission de plusieurs de ces messages.</p>
<p> </p>
<p>I.5) Le protocole ICMP :</p>
<p> </p>
<p>Le protocole ICMP (Internet Control Message Protocol) constitue le protocole
  des messages d&#8217;erreur. Il fait enti&egrave;rement partie de la couche
  IP. Les messages ICMP sont class&eacute;s en plusieurs cat&eacute;gories :</p>
<p> </p>
<p>La premi&egrave;re est constitu&eacute;e de tous les messages r&eacute;sultant
  d&#8217;un incident r&eacute;seau, o&ugrave; qu&#8217;il se soit produit, et
  qui peuvent &ecirc;tre transmis &agrave; l&#8217;&eacute;metteur du paquet
  ayant subi l&#8217;incident. On peut classer dans cette cat&eacute;gorie les
  erreurs de routage ou celles qui r&eacute;sultent d&#8217;une indisponibilit&eacute; du
  destinataire.</p>
<p> </p>
<p>La seconde classe est constitu&eacute;e de tous les messages d&#8217;erreur
  induits par des incidents entre une machine h&ocirc;te et la porte (gateway)
  par laquelle passent les paquets, par exemple, il peut s&#8217;agir d&#8217;une
  proc&eacute;dure de routage qui informe l&#8217;h&ocirc;te d&#8217;un meilleur
  chemin que celui qui a &eacute;t&eacute; choisi &agrave; l&#8217;origine.</p>
<p> </p>
<p>La derni&egrave;re cat&eacute;gorie concerne tout ce qui est gestion de r&eacute;seau,
  les tests de connexion, les mesures de performances et de trafic (ping).</p>
<p> </p>
<p>Toutes les actions, transmissions ou redirections induites par un message
  ICMP sont prises en charge par la couche ICMP de IP.</p>
<p> </p>
<p> </p>
<p> II) IP dans le d&eacute;tail&#8230;</p>
<p>Introduction</p>
<p>Les donn&eacute;es envoy&eacute;es sur un r&eacute;seau informatique ne sont
  jamais &quot;en vrac&quot; : elles sont toujours regroup&eacute;es en paquets
  dont la structure est bien d&eacute;finie. </p>
<p> </p>
<p>Dans le cas de TCP/IP, ces paquets sont appel&eacute;s datagrammes. En plus
  des donn&eacute;es proprement dites, les datagrammes contiennent aussi une
  ent&ecirc;te qui apporte certains renseignements concernant les donn&eacute;es,
  comme leur adresse IP de provenance et de destination. Pour pouvoir transiter
  par tous les types de r&eacute;seaux locaux, le datagramme IP est enferm&eacute; dans
  une trame (&quot;enveloppe&quot;) dont le type correspond au r&eacute;seau
  travers&eacute;. C'est ce qu'on appelle l'encapsulation. </p>
<p> </p>
<p>La taille maximale d'un datagramme IP (ent&ecirc;te + donn&eacute;es) est
  de 65535 octets. Comme il se peut qu'un r&eacute;seau travers&eacute; ne puisse
  pas acheminer des blocs de donn&eacute;es aussi grands, le protocole IP est
  capable de g&eacute;rer la fragmentation des datagrammes, ce qui permet de
  d&eacute;couper un grand datagramme en datagrammes plus petits. </p>
<p> </p>
<p>La structure g&eacute;n&eacute;rale d'un datagramme IP est repr&eacute;sent&eacute;e
  sur la figure suivante : </p>
<p> </p>
<p> </p>
<p> 4 8 16 19 24 32 </p>
<p>Version Long. Ent&ecirc;te Type de Service Longueur Totale du datagramme 1 </p>
<p>Identification Flag Fragment 2 </p>
<p>Dur&eacute;e de Vie Protocole Checksum 3 </p>
<p>Adresse IP Source 4 </p>
<p>Adresse IP destination 5 </p>
<p>Options </p>
<p>Options Bourrage </p>
<p> </p>
<p>Donn&eacute;es </p>
<p> </p>
<p> </p>
<p>Ent&ecirc;te du datagramme</p>
<p>La taille de l'ent&ecirc;te d'un datagramme IP est variable, mais elle fait
  toujours au moins 20 octets. Sur la figure ci-dessus, examinons les diff&eacute;rentes
  parties : </p>
<p> </p>
<p>II-1)Version (Vers)</p>
<p>Sur ces 4 bits est cod&eacute; le num&eacute;ro de version du protocole IP
  utilis&eacute;. Actuellement, il s'agit pratiquement toujours de la version
  4 (0100). Le num&eacute;ro 5 sert &agrave; des applications exp&eacute;rimentales
  et la version 6 est en cours de mise en service (celle-ci utilise une autre
  structure de datagramme). Les num&eacute;ros 0 et 15 sont r&eacute;serv&eacute;s. </p>
<p> II-2) Longueur d'ent&ecirc;te (I.H.L.)</p>
<p>Comme la longueur d'une ent&ecirc;te de datagramme IP est variable, elle est
  cod&eacute;e sur 4 bits, sous forme de mots de 32 bits (4 octets). (Par exemple,
  5 repr&eacute;sente 5 fois 32 bits, soit 20 octets). </p>
<p>II-3) Type de service (Type of Service ToS)</p>
<p>Ce champ de 8 bits poss&egrave;de la structure suivante : </p>
<p>(Pour l&#8217;instant une seule option peut &ecirc;tre s&eacute;lectionn&eacute;e)</p>
<p> </p>
<p> </p>
<p>Priorit&eacute; Type de Service </p>
<p> -d&eacute;lai +d&eacute;bit +fiable -co&ucirc;t 0 </p>
<p>0 1 2 3 4 5 6 7 </p>
<p> </p>
<p>3 bits indiquant la priorit&eacute;. </p>
<p>- 000 (Par d&eacute;faut - priorit&eacute; la moins &eacute;lev&eacute;e) </p>
<p>- 111 (supervision r&eacute;seau- priorit&eacute; la plus &eacute;lev&eacute;e).
  Cette partie est utilis&eacute;e par certaines passerelles. </p>
<p> </p>
<p>4 bits indiquant le type de service souhait&eacute; (en fonctionnement normal,
  ils sont tous &agrave; z&eacute;ro) : </p>
<p> </p>
<p>- Le premier bit demande au routeur de choisir un chemin ayant un d&eacute;lai
  de transmission le plus court possible (par exemple choisir de passer par un
  c&acirc;ble sous marin plut&ocirc;t que par une liaison satellite)</p>
<p>- Le deuxi&egrave;me bit demande au routeur un d&eacute;bit &eacute;lev&eacute;. </p>
<p>- Le troisi&egrave;me bit demande au routeur de diriger les paquets vers des
  liaisons fiables </p>
<p>- Le quatri&egrave;me bit demande au routeur de choisir un chemin ayant un
  co&ucirc;t minimum. </p>
<p> </p>
<p>1 bit r&eacute;serv&eacute; pour le futur, devant actuellement rester &agrave; z&eacute;ro
  sauf pour certains cas exp&eacute;rimentaux. </p>
<p>II-4) Longueur du datagramme (Long. Totale)</p>
<p>Longueur totale du datagramme (ent&ecirc;te + donn&eacute;es), en octets.
  Comme ce champ est cod&eacute; sur 16 bits, la longueur maximale d'un datagramme
  IP est de 65535 octets. Attention : si un datagramme est fragment&eacute;,
  ce champ fait r&eacute;f&eacute;rence &agrave; la longueur du fragment courant
  et non &agrave; la longueur du datagramme initial. </p>
<p>II-5) Fragmentation </p>
<p>Si le routeur re&ccedil;oit un datagramme trop grand pour le support sur lequel
  il doit l&#8217;envoyer, il est obliger de fragmenter ce datagramme. Il est
  donc n&eacute;cessaire de rep&eacute;rer ces fragments et de faire en sorte
  que le r&eacute;cepteur des fragments d&#8217;un datagramme puisse &laquo; recoller &raquo; les
  morceaux dans le bon ordre pour reconstituer le datagramme. 3 champs permettent
  de r&eacute;soudre ce probl&egrave;me.</p>
<p> </p>
<p>II-6) Identification (ID)</p>
<p>Ce champ sur 16 bits sert &agrave; identifier un datagramme ou les fragments
  d'un datagramme fragment&eacute;. En effet, ce champ a la m&ecirc;me valeur
  pour tous les fragments provenant d'un m&ecirc;me datagramme. </p>
<p> II-7) Drapeau (Flg)</p>
<p>Ces 3 bits donnent des informations concernant la fragmentation : </p>
<p> </p>
<p> </p>
<p>0 DF MF </p>
<p> </p>
<p>Le premier n'est pas utilis&eacute; et doit rester &agrave; z&eacute;ro. </p>
<p>Le deuxi&egrave;me sert &agrave; interdire la fragmentation du datagramme
  (0 - Autoris&eacute;, 1 - Interdit) (appel&eacute; bit de &laquo; non-fragmentation &raquo; ou &laquo; Don&#8217;t
  Fragment &raquo; DF). </p>
<p>Le troisi&egrave;me est &agrave; z&eacute;ro s'il s'agit du dernier fragment
  du datagramme et &agrave; un si d'autres fragments doivent encore arriver (appel&eacute; bit &laquo; fragments &agrave; suivre &raquo; ou &laquo; More
  Fragment &raquo; MF). </p>
<p>II-8) Place du fragment (Fragment)</p>
<p>Ce nombre cod&eacute; sur 13 bits indique la position qu&#8217;a le 1er octet
  de donn&eacute;e du fragment dans le datagramme (non fragment&eacute;). Ce
  nombre est un multiple de 8 octets. Ainsi, une valeur de 10 signifierait que
  le 1er octet de donn&eacute;e de ce fragment est en fait l&#8217;octet 80 du
  datagramme non fragment&eacute;. S'il s'agit du premier fragment, ou si le
  datagramme n'est pas fragment&eacute;, tous les bits sont &agrave; z&eacute;ro. </p>
<p>II-9) Dur&eacute;e de vie (Time to Life TtL)</p>
<p>Th&eacute;oriquement, ce champ doit indiquer sur 8 bits le nombre de secondes
  pendant lequel le datagramme est autoris&eacute; &agrave; voyager. A chaque
  passage d'une passerelle, on retire le temps qu'a pris la travers&eacute;e
  de la passerelle. En pratique, comme ce temps est souvent inf&eacute;rieur &agrave; une
  seconde, on retire 1, ce qui fait que ce champ indique plus souvent le nombre
  de passerelles par lesquelles le datagramme peut passer qu'une dur&eacute;e
  proprement dite. Quand le champ dur&eacute;e de vie atteint z&eacute;ro, le
  datagramme est d&eacute;truit et un message d'erreur est envoy&eacute; &agrave; l'&eacute;metteur.
  Cette m&eacute;thode permet d'&eacute;viter qu'un datagramme ne circule ind&eacute;finiment
  en boucle. </p>
<p>II-10) Num&eacute;ro de protocole (Protocole)</p>
<p>Ce champ de 8 bits indique &agrave; quel protocole de niveau plus &eacute;lev&eacute; est
  destin&eacute; le datagramme (SAP). La valeur z&eacute;ro est r&eacute;serv&eacute;e.
  Quelques exemples de valeurs : (La liste compl&egrave;te se trouve dans la
  RFC 790)</p>
<p>1 : ICMP (Internet Control Message Protocol)</p>
<p>6 : TCP (Transmission Control Protocol)</p>
<p>17 : UDP (User Datagram Protocol)</p>
<p> </p>
<p>II-11) Contr&ocirc;le d'ent&ecirc;te (Checksum)</p>
<p>Permet de v&eacute;rifier si l&#8217;ent&ecirc;te du paquet n&#8217;a pas
  subit de modification pendant la transmission Si il y a eu modification, le
  datagramme est d&eacute;truit. Le champ est calcul&eacute; comme suit : c'est
  le compl&eacute;ment &agrave; 1 sur 16 bits de la somme des compl&eacute;ments &agrave; un
  de tous les mots de 16 bits de l'ent&ecirc;te, en consid&eacute;rant les bits
  du champ &quot;contr&ocirc;le d'ent&ecirc;te&quot; comme &eacute;tant &agrave; z&eacute;ro. </p>
<p>II-12) Adresse IP source</p>
<p>Adresse IP de l'&eacute;metteur du datagramme. </p>
<p>II-13) Adresse IP destination</p>
<p>Adresse IP du destinataire du datagramme. </p>
<p>II-14) Options IP (Options)</p>
<p>Il s'agit d'un champ de longueur variable utilis&eacute; principalement pour
  la mise au point ou pour des exp&eacute;rimentations. Les options ne sont pas
  obligatoires. Elles sont toutes cod&eacute;e les unes &agrave; la suite des
  autres, sans s&eacute;parateur particulier. </p>
<p>II-15) Bourrage</p>
<p>A cause de la structure du champ &quot;longueur d'ent&ecirc;te&quot;, la longueur
  de l'ent&ecirc;te doit &ecirc;tre un multiple de 32 bits. Si des options IP
  sont utilis&eacute;es, il se peut que ce ne soit plus le cas. On remplit alors
  le champ &quot;Bourrage&quot; de z&eacute;ros jusqu'&agrave; ce que la longueur
  de l'ent&ecirc;te soit &agrave; nouveau multiple de 32 bits. </p>
<p>II-16) Donn&eacute;es</p>
<p>Ce sont les donn&eacute;es du datagramme proprement dites. </p>
<p> </p>
<p> C) Les protocoles des r&eacute;seaux locaux</p>
<p> </p>
<p>Nous avons commenc&eacute; &agrave; voir comment gr&acirc;ce au protocole
  IP on peut interconnecter des r&eacute;seaux locaux. </p>
<p>Pour compl&eacute;ter l&#8217;&eacute;tude il va &ecirc;tre n&eacute;cessaire
  de mettre en &eacute;vidence comment gr&acirc;ce au protocole ARP, le paquet
  va pouvoir &ecirc;tre distribu&eacute; sur le r&eacute;seau local. Pour cela,
  il est avant tout n&eacute;cessaire de montrer comment l&#8217;information
  circule sur un r&eacute;seau local.</p>
<p>Nous nous int&eacute;resserons dans un premier temps au type de r&eacute;seau
  local et aux protocoles les plus couramment utilis&eacute;s &agrave; savoir
  :</p>
<p> </p>
<p>r&eacute;seau Ethernet 10baseT et 100baseT </p>
<p>protocole de Niveau II EthernetII</p>
<p> </p>
<p> </p>
<p>I) M&eacute;thode d&#8217;acc&egrave;s au support.</p>
<p> </p>
<p> </p>
<p>Pour comprendre la m&eacute;thode d&#8217;acc&egrave;s, il faut d&eacute;j&agrave; comprendre
  le fonctionnement d&#8217;un HUB (en fran&ccedil;ais : concentrateur)</p>
<p>Un HUB est constitu&eacute; de plusieurs ports acc&eacute;ssibles par des
  prises RJ 45 femelles. Lorsqu&#8217;une station envoie des donn&eacute;es dans
  une trame (sur la &laquo; paire &eacute;mission &raquo;), le HUB re&ccedil;oit
  cette trame et la r&eacute;envoie en m&ecirc;me temps sur tous les autres ports
  (sur la &laquo; paire r&eacute;ception &raquo; des stations)</p>
<p> </p>
<p>Le probl&egrave;me est le suivant :</p>
<p> </p>
<p>La station A envoie une trame, B et C re&ccedil;oivent cette trame. Si pendant
  ce temps la station C envoie aussi une trame, la station B va recevoir un m&eacute;lange
  des deux trames ce qui donnera quelque chose d&#8217;incompr&eacute;hesible
  pour B. Il est donc n&eacute;cessaire de r&egrave;glementer l&#8217;envoi des
  trames sur le support physique d&#8217;o&ugrave; la mise au point d&#8217;une &laquo; m&eacute;thode
  d&#8217;acc&egrave;s au support.</p>
<p> </p>
<p>La m&eacute;thode d&#8217;acc&egrave;s utilis&eacute;e sur les r&eacute;seaux
  Ethernet est conforme au CSMA/CD (Carrier Sense Multiple Access/ Collision
  Detect en fran&ccedil;ais cela donne : Surveillance de Porteuse pour l&#8217;Acc&eacute;s
  Multiple/ D&eacute;tection de Collision). Dans cette m&eacute;thode il y a
  deux aspects le CSMA et le CD</p>
<p> </p>
<p> I-1) Le principe du CSMA est le suivant :</p>
<p> </p>
<p>Une station qui veut envoyer une trame (station A) v&eacute;rifie qu&#8217;il
  n&#8217;y a pas de signal (de trame) sur sa paire r&eacute;ception.</p>
<p>Si il y a un signal (c&#8217;est qu&#8217;une autre station -B par exemple-
  est en train d&#8217;envoyer une trame) alors la station A attend tant qu&#8217;il
  y a un signal sur sa paire r&eacute;ception</p>
<p>Si il n&#8217;y a pas de signal alors la station peut envoyer sa trame</p>
<p> </p>
<p>On voit qu&#8217;avec ce syst&egrave;me une station ne peut pas &eacute;mettre
  si une autre station a commenc&eacute; &agrave; &eacute;mettre, sauf si deux
  stations constatent en m&ecirc;me temps que personne n&#8217;&eacute;met de
  trame et qu&#8217;elles d&eacute;cident en m&ecirc;me temps d&#8217;&eacute;mettre,
  d&#8217;o&ugrave;</p>
<p> </p>
<p>I-2) Le principe du CD (collision detect) :</p>
<p> </p>
<p>Lorsqu&#8217;une station est en train d&#8217;envoyer une trame et qu&#8217;en
  m&ecirc;me temps elle d&eacute;tecte un signal sur sa paire r&eacute;ception
  elle arr&ecirc;te d&#8217;envoyer sa trame (bien entendu il en est de m&ecirc;me
  pour toutes les stations qui &eacute;taient en train d&#8217;&eacute;mettre.</p>
<p> </p>
<p>Les stations qui ont arr&ecirc;t&eacute; d&#8217;emettre vont devoir recommencer &agrave; &eacute;mettre.
  Si elles recommencent &agrave; r&eacute;envoyer leur trame en m&ecirc;me temps
  la collision va se reproduire. Pour &eacute;viter cela chaque station va r&eacute;&eacute;mettre
  sa trame au bout d&#8217;un temps &eacute;gal &agrave; NxTS (N multipli&eacute; par
  TS)</p>
<p> </p>
<p>&laquo; TS &raquo; est le Time Slot dont la valeur est de 51,2 &micro;s pour
  le 10 Base T. L&#8217;origine de ce Time Slot sera vu en d&eacute;tail par
  la suite. </p>
<p> </p>
<p>&laquo; N &raquo; est un nombre entier dont la valeur est prise au hasard
  dans un intervalle de valeurs dont la taille augmente &agrave; chaque tentative
  rat&eacute;e. Au bout de 16 tentatives la station arr&ecirc;te ses tentatives
  et retoune un message d&#8217;erreur</p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p>Nombre de tentatives Plage de tirage de N </p>
<p>1 0 ? 1 </p>
<p>2 0 ? 3 </p>
<p>3 0 ? 7 </p>
<p>4 0 ? 15 </p>
<p>5 0 ? 31 </p>
<p>6 0 ? 63 </p>
<p>7 0 ? 127 </p>
<p>8 0 ? 255 </p>
<p>9 0 ? 511 </p>
<p>10 0 ? 1023 </p>
<p>11 0 ? 1023 </p>
<p>12 0 ? 1023 </p>
<p>13 0 ? 1023 </p>
<p>14 0 ? 1023 </p>
<p>15 0 ? 1023 </p>
<p>16 0 ? 1023 </p>
<p> </p>
<p> </p>
<p> </p>
<p>I-3) Algorithme d&#8217;&eacute;mission</p>
<p> </p>
<p>L&#8217;algorigramme suivant montre le processus d&#8217;&eacute;mission d&#8217;une
  trame par une station.</p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p> II) Format de la trame Ethernet II</p>
<p> </p>
<p>Nous avons vu que les stations appartenant &agrave; un m&ecirc;me r&eacute;seau
  local s&#8217;&eacute;changent des trames. Ces trames peuvent contenir par
  exemple un paquet IP. Nous allons maintenant &eacute;tudier les diff&eacute;rents
  champs de cette trame Ethernet II.</p>
<p> </p>
<p>II-1) Le pr&eacute;ambule sert &agrave; la synchronisation des horloges au
  niveau physique. En effet il est n&eacute;cessaire de resynchroniser les horloges
  au d&eacute;but de chaque trame puisque en l&#8217;absence de trame, il n&#8217;y
  a aucun signal de transmis sur le support et les horloges sont donc d&eacute;synchronis&eacute;es. </p>
<p>Il est donc possible que les premiers de ces 7 premiers octets soient mal
  d&eacute;cod&eacute;s.</p>
<p>L&#8217;essentiel est que le SFD soit reconnu en entier et identifier comme &eacute;tant
  le d&eacute;but r&eacute;el de la trame, pour que la trame soit valide. (SFD=Start
  Frame Delimitor : d&eacute;limiteur de d&eacute;but de trame. Il est aussi
  appel&eacute; fanion ou drapeau ou Flag en anglais)</p>
<p> </p>
<p>II-2) Les adresses MAC</p>
<p> </p>
<p>Chaque fabricant de carte r&eacute;seau attribue &agrave; chaque carte une
  adresse sp&eacute;cifique c&#8217;est l&#8217;adresse MAC. En principe chaque
  carte r&eacute;seau a une adresse unique au monde.</p>
<p>Chaque trame contient dans une ent&ecirc;te l&#8217;adresse MAC de la station
  origine et l&#8217;adresse MAC de la station destination</p>
<p> </p>
<p>II-3) Protocole R&eacute;seau</p>
<p> </p>
<p>Comme cela a &eacute;t&eacute; dit dans l&#8217;&eacute;tude du mod&egrave;le
  de r&eacute;f&eacute;rence OSI, la communication entre entit&eacute;s de couches
  adjacentes se fait par le point d&#8217;acc&egrave;s au service (SAP : Service
  Access Point). A chaque protocole correspond un identifiant pour le point d&#8217;acc&egrave;s.
  La RFC 1700 donne les identifiants. La valeur doit &ecirc;tre sup&eacute;rieure &agrave; 1500
  en d&eacute;cimal (5DC en Hexa). En ce qui nous concerne deux protocoles seront
  couramment utilis&eacute;s</p>
<p> </p>
<p> </p>
<p> </p>
<p>Champ Protocole</p>
<p>(D&eacute;cimal) Champ Protocole</p>
<p>(Hexad&eacute;cimal) Protocole </p>
<p>2048 800 (s&#8217;&eacute;crit : 0x800) IP </p>
<p>2054 806 (s&#8217;&eacute;crit : 0x806) ARP </p>
<p> </p>
<p> </p>
<p> II-4) Champ de donn&eacute;es</p>
<p> </p>
<p>Une trame doit obligatoirement contenir un nombre entier d&#8217;octets. Le
  champ de donn&eacute;es doit avoir une longueur maximale de 1500 octets et
  une longueur minimale de 46 octets. Si cette longueur est inf&eacute;rieure &agrave; 46
  octets, il est n&eacute;cessaire de rajouter des octets de remplissage permettant
  d&#8217;obtenir 46 octets (PAD). Cela afin que la dur&eacute;e de transmission
  de la trame soit au moins &eacute;gale au Time Slot (temps n&eacute;cessaire &agrave; la
  trame pour faire l&#8217;aller et retour entre deux stations dans le cas le
  plus d&eacute;favorable : 51,2 &micro;s pour le 10 base T). Cela permettant
  d&#8217;&ecirc;tre certain de d&eacute;tecter toutes les collisions (Du premier
  octet de l&#8217;adresse destinataire au dernier octet du CRC la longueur minimale
  de la trame est donc de 64 octets soit 512 bit).</p>
<p> </p>
<p>II-5) D&eacute;tection d&#8217;erreurs</p>
<p> </p>
<p>La d&eacute;tection des erreurs se fait en utilisant un CRC sur 32 bits, dont
  le polyn&ocirc;me g&eacute;n&eacute;rateur est &eacute;gal &agrave; :</p>
<p> </p>
<p>G(x) = x32 + x26 + x23 + x22 + x16 + x12 + x11 + x10 + x8 + x5 + x4 + x2 +
  1</p>
<p> </p>
<p>L&#8217;exp&eacute;diteur de la trame d&eacute;termine le CRC gr&acirc;ce &agrave; une
  division polynomiale du contenu de la trame (adresses + champ protocole + champ
  de donn&eacute;es) par le polyn&ocirc;me g&eacute;n&eacute;rateur puis l&#8217;exp&eacute;diteur &laquo; colle &raquo; ce
  CRC apr&egrave;s le champ de donn&eacute;es puis envoie sa trame.</p>
<p> </p>
<p>Le r&eacute;cepteur r&eacute;cup&egrave;re la trame, rep&egrave;re la fin
  de la trame (IFS : voir paragraphe suivant) Le r&eacute;cepteur fait &agrave; son
  tour le m&ecirc;me calcul du CRC que l&#8217;exp&eacute;diteur, puis il compare
  les deux CRC. Si ils sont identiques la trame est consid&eacute;r&eacute;e
  bonne et elle est envoy&eacute;e &agrave; la couche sup&eacute;rieure, si ils
  sont diff&eacute;rents la trame est consid&eacute;r&eacute;e mauvaise et elle
  est aussit&ocirc;t d&eacute;truite.</p>
<p> </p>
<p>II-6) Silence Inter trame</p>
<p> </p>
<p>Le silence Inter trame (IFS : Inter Frame Spacing) est la dur&eacute;e minimale
  qui s&eacute;pare deux trames sur le r&eacute;seau. En 10 base T cette dur&eacute;e
  est de 9,6 &micro;s. Le silence inter trame permet de d&eacute;terminer la
  fin d&#8217;une trame.</p>
<p> </p>
<p> </p>
<p> </p>
<p>II-7) Repr&eacute;sentation de la</p>
<p> trame Ethernet II</p>
<p> </p>
<p> </p>
<p> </p>
<p>7 octets</p>
<p>Pr&eacute;ambule 10101010</p>
<p>-----------</p>
<p>10101010 </p>
<p>1 octet (SFD) 10101011 </p>
<p>6 octets Adresse Destinataire </p>
<p>6 octets Adresse Source </p>
<p>2 octets Protocole R&eacute;seau </p>
<p>Taille donn&eacute;es min. = 46 octets</p>
<p> </p>
<p>Taille donn&eacute;es max. = 1500 octets </p>
<p>Donn&eacute;es</p>
<p> </p>
<p>+ PAD pour un remplissage &eacute;ventuel </p>
<p>4 octets CRC </p>
<p> </p>
<p> </p>
<p> </p>
<p> D) Le Protocole ARP (Address Resolution Protocole)</p>
<p> </p>
<p>Nous avons vu dans les chapitres pr&eacute;c&eacute;dents </p>
<p>Que l&#8217;adressage IP permettait l&#8217;adressage de stations appartenant &agrave; diff&eacute;rents
  r&eacute;seaux. L&#8217;acheminement des paquets &agrave; travers les r&eacute;seaux
  se faisant gr&acirc;ce aux routeurs au niveau de la couche 3. </p>
<p>Que l&#8217;adressage &agrave; l&#8217;int&eacute;rieur d&#8217;un r&eacute;seau
  local se fait gr&acirc;ce &agrave; l&#8217;adresse MAC des stations au niveau
  de la couche 2.</p>
<p> </p>
<p>De ces deux remarques on d&eacute;duit donc qu&#8217;il est n&eacute;cessaire
  d&#8217;&eacute;tablir un lien entre l&#8217;adresse IP d&#8217;une station
  et son adresse MAC pour qu&#8217;un Paquet IP arrivant dans un r&eacute;seau
  local &agrave; destination d&#8217;une station puisse &ecirc;tre achemin&eacute; vers
  la bonne station. C&#8217;est le protocole ARP qui va permettre d&#8217;&eacute;tablir
  ce lien.</p>
<p> </p>
<p>I) Explication :</p>
<p> </p>
<p>Une station A veut envoyer un paquet IP &agrave; une station B du r&eacute;seau
  local. La station A conna&icirc;t l&#8217;adresse IP de la station B mais ne
  conna&icirc;t pas son adresse MAC.</p>
<p> </p>
<p>&Eacute;tape 1</p>
<p>La station A va donc fabriquer un paquet de requ&ecirc;te ARP. Ce Paquet contient
  (entre autres) les &eacute;l&eacute;ments suivants :</p>
<p> </p>
<p>Le type de paquet ARP (demande, requ&ecirc;te)</p>
<p>@ MAC de A (adresse MAC source)</p>
<p>@ IP de A (adresse IP source)</p>
<p>un &eacute;l&eacute;ment &agrave; 0 (indiquant @MAC destination inconnue)</p>
<p>@ IP de B (Adresse IP destination)</p>
<p> </p>
<p>&Eacute;tape 2</p>
<p>Ce paquet est ensuite encapsul&eacute; dans une trame qui va &ecirc;tre diffus&eacute;e &agrave; toutes
  les stations du r&eacute;seau local (il est n&eacute;cessaire de la diffuser
  puisque l'adresse MAC destinataire n&#8217;est pas connue). Les &eacute;l&eacute;ments
  de la trame seront donc :</p>
<p> </p>
<p>@ MAC de A (adresse MAC de la source)</p>
<p>@ MAC de diffusion (FF FF FF FF FF FF)</p>
<p>Type de protocole au niveau 3 (0806 indique que le champ &laquo; info &raquo; de
  la trame Ethernet II contient un paquet ARP)</p>
<p> </p>
<p>&Eacute;tape 3</p>
<p>Toutes les stations du r&eacute;seau local vont donc devoir prendre en compte
  cette trame et analyser le paquet qui s&#8217;y trouve encapsul&eacute;. Les
  stations qui ne reconnaissent pas leur propre adresse IP dans le champ Adresse
  IP destination ne font rien de plus. </p>
<p> </p>
<p>&Eacute;tape 4</p>
<p>Par contre la station B qui reconna&icirc;t son adresse IP doit fabriquer
  un paquet de r&eacute;ponse ARP. Ce paquet contient entre autre les &eacute;l&eacute;ments
  suivants :</p>
<p> </p>
<p>Le type de paquet ARP (R&eacute;ponse)</p>
<p>@ MAC de B (adresse MAC source. C&#8217;est l&#8217;adresse qui &eacute;tait
  recherch&eacute;e.)</p>
<p>@ IP de B (adresse IP source = @IP destination dans la Requ&ecirc;te)</p>
<p>@ MAC de A (adresse MAC destination = @MAC source dans la Requ&ecirc;te )</p>
<p>@ IP de A (Adresse IP destination = @IP source dans la Requ&ecirc;te)</p>
<p> &Eacute;tape 5</p>
<p>Ce paquet est ensuite encapsul&eacute; dans une trame qui va &ecirc;tre envoy&eacute;e &agrave; la
  station A. Les &eacute;l&eacute;ments de la trame seront donc :</p>
<p> </p>
<p>@ MAC de B (adresse MAC de la source. C&#8217;est l&#8217;adresse qui &eacute;tait
  recherch&eacute;e)</p>
<p>@ MAC de A (adresse MAC destination)</p>
<p>Type de protocole au niveau 3 (0806 indique que le champ &laquo; info &raquo; de
  la trame Ethernet II contient un paquet ARP)</p>
<p>&Eacute;tape 6</p>
<p>La station A qui re&ccedil;oit directement la trame (point &agrave; point)
  va pouvoir envoyer son paquet IP dans une trame ayant la bonne adresse MAC
  de destination. La station A va mettre aussi &agrave; jour sa table ARP. Ceci
  lui permettra, la prochaine fois, de ne pas refaire une requ&ecirc;te ARP.
  Toutefois, &eacute;tant donn&eacute; que un r&eacute;seau peut &eacute;voluer
  et que les cartes r&eacute;seau peuvent &ecirc;tre chang&eacute;es, il est
  n&eacute;cessaire qu&#8217;une station v&eacute;rifie r&eacute;guli&egrave;rement
  sa table ARP en refaisant des requ&ecirc;tes ARP.</p>
<p> </p>
<p>Cet &eacute;change peut &ecirc;tre repr&eacute;sent&eacute; par le diagramme
  fl&eacute;ch&eacute; suivant :</p>
<p> </p>
<p> </p>
<p>Format du paquet ARP :</p>
<p>(Format classique sur un r&eacute;seau Ethernet utilisant le protocole IP
  V4)</p>
<p> </p>
<p> </p>
<p> </p>
<p> </p>
<p>00 01 (indique r&eacute;seau Ethernet classique) 08 00 (indique r&eacute;seau
  IP) </p>
<p>06 (longueur @ MAC) 04 (longueur @ IP) 00 01 (pour une requ&ecirc;te) 00 02
  (pour une r&eacute;ponse) </p>
<p>&Ecirc; (sur 6 octets) Adresse MAC de l&#8217;&eacute;metteur de la trame&#8230; </p>
<p>&#8230;Suite de l&#8217;adresse MAC de l&#8217;&eacute;metteur Adresse IP
  de l&#8217;&eacute;metteur de la trame&#8230; </p>
<p>&#8230;Suite de l&#8217;adresse IP de l&#8217;&eacute;metteur (4 octets) Adresse
  MAC du destinataire de la trame&#8230; </p>
<p>&#8230;Suite de l&#8217;adresse MAC du destinataire (dans le cas d&#8217;une
  requ&ecirc;te = 00 00 00 00 00 00 = @ inconnue) </p>
<p>Adresse IP du destinataire de la trame (sur 4 octets) <br>
</p>
</body>
</html>
